openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
typedef struct {                                    /*!< (@ 0x50001200) SPI Structure                                          */
  __IO uint16_t  SPI_CTRL_REG;                      /*!< (@ 0x50001200) SPI control register 0                                 */
  __IO uint16_t  SPI_RX_TX_REG0;                    /*!< (@ 0x50001202) SPI RX/TX register0                                    */
  __IO uint16_t  SPI_RX_TX_REG1;                    /*!< (@ 0x50001204) SPI RX/TX register1                                    */
  __IO uint16_t  SPI_CLEAR_INT_REG;                 /*!< (@ 0x50001206) SPI clear interrupt register                           */
  __IO uint16_t  SPI_CTRL_REG1;                     /*!< (@ 0x50001208) SPI control register 1                                 */
} SPI_Type;


/* ================================================================================ */
/* ================                      SPI2                      ================ */
/* ================================================================================ */


/**
  * @brief SPI2 registers (SPI2)
  */

typedef struct {                                    /*!< (@ 0x50001300) SPI2 Structure                                         */
  __IO uint16_t  SPI2_CTRL_REG;                     /*!< (@ 0x50001300) SPI control register 0                                 */
  __IO uint16_t  SPI2_RX_TX_REG0;                   /*!< (@ 0x50001302) SPI RX/TX register0                                    */
  __IO uint16_t  SPI2_RX_TX_REG1;                   /*!< (@ 0x50001304) SPI RX/TX register1                                    */
  __IO uint16_t  SPI2_CLEAR_INT_REG;                /*!< (@ 0x50001306) SPI clear interrupt register                           */
  __IO uint16_t  SPI2_CTRL_REG1;                    /*!< (@ 0x50001308) SPI control register 1                                 */
} SPI2_Type;


/* ================================================================================ */
/* ================                     TIMER1                     ================ */
/* ================================================================================ */


/**
  * @brief TIMER1 registers (TIMER1)
  */

typedef struct {                                    /*!< (@ 0x50000200) TIMER1 Structure                                       */
  __IO uint16_t  CAPTIM_CTRL_REG;                   /*!< (@ 0x50000200) Capture Timer control register                         */
  __IO uint16_t  CAPTIM_TIMER_VAL_REG;              /*!< (@ 0x50000202) Capture Timer counter value                            */
  __IO uint16_t  CAPTIM_STATUS_REG;                 /*!< (@ 0x50000204) Capture Timer status register                          */
  __IO uint16_t  CAPTIM_GPIO1_CONF_REG;             /*!< (@ 0x50000206) Capture Timer gpio1 selection                          */
  __IO uint16_t  CAPTIM_GPIO2_CONF_REG;             /*!< (@ 0x50000208) Capture Timer gpio2 selection                          */
  __IO uint16_t  CAPTIM_RELOAD_REG;                 /*!< (@ 0x5000020A) Capture Timer reload value and Delay in shot
                                                         mode                                                                  */
  __IO uint16_t  CAPTIM_SHOTWIDTH_REG;              /*!< (@ 0x5000020C) Capture Timer Shot duration in shot mode               */
  __IO uint16_t  CAPTIM_PRESCALER_REG;              /*!< (@ 0x5000020E) Capture Timer prescaler value                          */
  __IO uint16_t  CAPTIM_CAPTURE_GPIO1_REG;          /*!< (@ 0x50000210) Capture Timer value for event on GPIO1                 */
  __IO uint16_t  CAPTIM_CAPTURE_GPIO2_REG;          /*!< (@ 0x50000212) Capture Timer value for event on GPIO2                 */
  __IO uint16_t  CAPTIM_PRESCALER_VAL_REG;          /*!< (@ 0x50000214) Capture Timer interrupt status register                */
  __IO uint16_t  CAPTIM_PWM_FREQ_REG;               /*!< (@ 0x50000216) Capture Timer pwm frequency register. PWM5 period
                                                         is defined by the reference clock frequency multiplied by this
                                                          value.                                                               */
  __IO uint16_t  CAPTIM_PWM_DC_REG;                 /*!< (@ 0x50000218) Capture Timer pwm dc register                          */
} TIMER1_Type;


/* ================================================================================ */
/* ================                      TRNG                      ================ */
/* ================================================================================ */


/**
  * @brief TRNG registers (TRNG)
  */

typedef struct {                                    /*!< (@ 0x50005000) TRNG Structure                                         */
  __IO uint32_t  TRNG_CTRL_REG;                     /*!< (@ 0x50005000) TRNG control register                                  */
  __IO uint32_t  TRNG_FIFOLVL_REG;                  /*!< (@ 0x50005004) TRNG FIFO level register                               */
  __IO uint32_t  TRNG_VER_REG;                      /*!< (@ 0x50005008) TRNG Version register                                  */
} TRNG_Type;


/* ================================================================================ */
/* ================                      UART                      ================ */
/* ================================================================================ */


/**
  * @brief UART registers (UART)
  */

typedef struct {                                    /*!< (@ 0x50001000) UART Structure                                         */
  __IO uint16_t  UART_RBR_THR_DLL_REG;              /*!< (@ 0x50001000) Receive Buffer Register                                */
  __I  uint16_t  RESERVED;
  __IO uint16_t  UART_IER_DLH_REG;                  /*!< (@ 0x50001004) Interrupt Enable Register                              */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  UART_IIR_FCR_REG;                  /*!< (@ 0x50001008) Interrupt Identification Register                      */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  UART_LCR_REG;                      /*!< (@ 0x5000100C) Line Control Register                                  */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  UART_MCR_REG;                      /*!< (@ 0x50001010) Modem Control Register                                 */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  UART_LSR_REG;                      /*!< (@ 0x50001014) Line Status Register                                   */
  __I  uint16_t  RESERVED5[3];
  __IO uint16_t  UART_SCR_REG;                      /*!< (@ 0x5000101C) Scratchpad Register                                    */
  __I  uint16_t  RESERVED6[47];
  __IO uint16_t  UART_USR_REG;                      /*!< (@ 0x5000107C) UART Status register.                                  */
  __I  uint16_t  RESERVED7[5];
  __IO uint16_t  UART_SRR_REG;                      /*!< (@ 0x50001088) Software Reset Register.                               */
  __I  uint16_t  RESERVED8[3];
  __IO uint16_t  UART_SBCR_REG;                     /*!< (@ 0x50001090) Shadow Break Control Register                          */
  __I  uint16_t  RESERVED9[11];
  __IO uint16_t  UART_DMASA_REG;                    /*!< (@ 0x500010A8) DMA Software Acknowledge                               */
  __I  uint16_t  RESERVED10[11];
  __IO uint16_t  UART_DLF_REG;                      /*!< (@ 0x500010C0) Divisor Latch Fraction Register                        */
  __I  uint16_t  RESERVED11[25];
  __IO uint16_t  UART_CPR_REG;                      /*!< (@ 0x500010F4) Component Parameter Register                           */
  __I  uint16_t  RESERVED12;
  __IO uint16_t  UART_UCV_REG;                      /*!< (@ 0x500010F8) Component Version                                      */
  __I  uint16_t  RESERVED13;
  __IO uint16_t  UART_CTR_REG;                      /*!< (@ 0x500010FC) Component Type Register                                */
} UART_Type;


/* ================================================================================ */
/* ================                      UART2                     ================ */
/* ================================================================================ */


/**
  * @brief UART2 registers (UART2)
  */

typedef struct {                                    /*!< (@ 0x50001100) UART2 Structure                                        */
  __IO uint16_t  UART2_RBR_THR_DLL_REG;             /*!< (@ 0x50001100) Receive Buffer Register                                */
  __I  uint16_t  RESERVED;
  __IO uint16_t  UART2_IER_DLH_REG;                 /*!< (@ 0x50001104) Interrupt Enable Register                              */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  UART2_IIR_FCR_REG;                 /*!< (@ 0x50001108) Interrupt Identification Register/FIFO Control
                                                         Register                                                              */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  UART2_LCR_REG;                     /*!< (@ 0x5000110C) Line Control Register                                  */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  UART2_MCR_REG;                     /*!< (@ 0x50001110) Modem Control Register                                 */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  UART2_LSR_REG;                     /*!< (@ 0x50001114) Line Status Register                                   */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  UART2_MSR_REG;                     /*!< (@ 0x50001118) Modem Status Register                                  */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  UART2_SCR_REG;                     /*!< (@ 0x5000111C) Scratchpad Register                                    */
  __I  uint16_t  RESERVED7[9];
  __IO uint16_t  UART2_SRBR_STHR0_REG;              /*!< (@ 0x50001130) Shadow Receive/Transmit Buffer Register                */
  __I  uint16_t  RESERVED8;
  __IO uint16_t  UART2_SRBR_STHR1_REG;              /*!< (@ 0x50001134) Shadow Receive/Transmit Buffer Register                */
  __I  uint16_t  RESERVED9;
  __IO uint16_t  UART2_SRBR_STHR2_REG;              /*!< (@ 0x50001138) Shadow Receive/Transmit Buffer Register                */
  __I  uint16_t  RESERVED10;
  __IO uint16_t  UART2_SRBR_STHR3_REG;              /*!< (@ 0x5000113C) Shadow Receive/Transmit Buffer Register                */
  __I  uint16_t  RESERVED11;
  __IO uint16_t  UART2_SRBR_STHR4_REG;              /*!< (@ 0x50001140) Shadow Receive/Transmit Buffer Register                */
  __I  uint16_t  RESERVED12;
  __IO uint16_t  UART2_SRBR_STHR5_REG;              /*!< (@ 0x50001144) Shadow Receive/Transmit Buffer Register                */
  __I  uint16_t  RESERVED13;
  __IO uint16_t  UART2_SRBR_STHR6_REG;              /*!< (@ 0x50001148) Shadow Receive/Transmit Buffer Register                */
  __I  uint16_t  RESERVED14;
  __IO uint16_t  UART2_SRBR_STHR7_REG;              /*!< (@ 0x5000114C) Shadow Receive/Transmit Buffer Register                */
  __I  uint16_t  RESERVED15;
  __IO uint16_t  UART2_SRBR_STHR8_REG;              /*!< (@ 0x50001150) Shadow Receive/Transmit Buffer Register                */
  __I  uint16_t  RESERVED16;
  __IO uint16_t  UART2_SRBR_STHR9_REG;              /*!< (@ 0x50001154) Shadow Receive/Transmit Buffer Register                */
  __I  uint16_t  RESERVED17;
  __IO uint16_t  UART2_SRBR_STHR10_REG;             /*!< (@ 0x50001158) Shadow Receive/Transmit Buffer Register                */
  __I  uint16_t  RESERVED18;
  __IO uint16_t  UART2_SRBR_STHR11_REG;             /*!< (@ 0x5000115C) Shadow Receive/Transmit Buffer Register                */
  __I  uint16_t  RESERVED19;
  __IO uint16_t  UART2_SRBR_STHR12_REG;             /*!< (@ 0x50001160) Shadow Receive/Transmit Buffer Register                */
  __I  uint16_t  RESERVED20;
  __IO uint16_t  UART2_SRBR_STHR13_REG;             /*!< (@ 0x50001164) Shadow Receive/Transmit Buffer Register                */
  __I  uint16_t  RESERVED21;
  __IO uint16_t  UART2_SRBR_STHR14_REG;             /*!< (@ 0x50001168) Shadow Receive/Transmit Buffer Register                */
  __I  uint16_t  RESERVED22;
  __IO uint16_t  UART2_SRBR_STHR15_REG;             /*!< (@ 0x5000116C) Shadow Receive/Transmit Buffer Register                */
  __I  uint16_t  RESERVED23;
  __IO uint16_t  UART2_FAR_REG;                     /*!< (@ 0x50001170) FIFO Access Register                                   */
  __I  uint16_t  RESERVED24[5];
  __IO uint16_t  UART2_USR_REG;                     /*!< (@ 0x5000117C) UART Status register.                                  */
  __I  uint16_t  RESERVED25;
  __IO uint16_t  UART2_TFL_REG;                     /*!< (@ 0x50001180) Transmit FIFO Level                                    */
  __I  uint16_t  RESERVED26;
  __IO uint16_t  UART2_RFL_REG;                     /*!< (@ 0x50001184) Receive FIFO Level.                                    */
  __I  uint16_t  RESERVED27;
  __IO uint16_t  UART2_SRR_REG;                     /*!< (@ 0x50001188) Software Reset Register.                               */
  __I  uint16_t  RESERVED28;
  __IO uint16_t  UART2_SRTS_REG;                    /*!< (@ 0x5000118C) Shadow Request to Send                                 */
  __I  uint16_t  RESERVED29;
  __IO uint16_t  UART2_SBCR_REG;                    /*!< (@ 0x50001190) Shadow Break Control Register                          */
  __I  uint16_t  RESERVED30;
  __IO uint16_t  UART2_SDMAM_REG;                   /*!< (@ 0x50001194) Shadow DMA Mode                                        */
  __I  uint16_t  RESERVED31;
  __IO uint16_t  UART2_SFE_REG;                     /*!< (@ 0x50001198) Shadow FIFO Enable                                     */
  __I  uint16_t  RESERVED32;
  __IO uint16_t  UART2_SRT_REG;                     /*!< (@ 0x5000119C) Shadow RCVR Trigger                                    */
  __I  uint16_t  RESERVED33;
  __IO uint16_t  UART2_STET_REG;                    /*!< (@ 0x500011A0) Shadow TX Empty Trigger                                */
  __I  uint16_t  RESERVED34;
  __IO uint16_t  UART2_HTX_REG;                     /*!< (@ 0x500011A4) Halt TX                                                */
  __I  uint16_t  RESERVED35;
  __IO uint16_t  UART2_DMASA_REG;                   /*!< (@ 0x500011A8) DMA Software Acknowledge                               */
  __I  uint16_t  RESERVED36[11];
  __IO uint16_t  UART2_DLF_REG;                     /*!< (@ 0x500011C0) Divisor Latch Fraction Register                        */
  __I  uint16_t  RESERVED37[25];
  __IO uint16_t  UART2_CPR_REG;                     /*!< (@ 0x500011F4) Component Parameter Register                           */
  __I  uint16_t  RESERVED38;
  __IO uint16_t  UART2_UCV_REG;                     /*!< (@ 0x500011F8) Component Version                                      */
  __I  uint16_t  RESERVED39;
  __IO uint16_t  UART2_CTR_REG;                     /*!< (@ 0x500011FC) Component Type Register                                */
} UART2_Type;


/* ================================================================================ */
/* ================                       USB                      ================ */
/* ================================================================================ */


/**
  * @brief USB registers (USB)
  */

typedef struct {                                    /*!< (@ 0x50001800) USB Structure                                          */
  __IO uint16_t  USB_MCTRL_REG;                     /*!< (@ 0x50001800) Main Control Register)                                 */
  __IO uint16_t  USB_XCVDIAG_REG;                   /*!< (@ 0x50001802) Transceiver diagnostic Register (for test purpose
                                                         only)                                                                 */
  __IO uint16_t  USB_TCR_REG;                       /*!< (@ 0x50001804) Transceiver configuration Register                     */
  __IO uint16_t  USB_UTR_REG;                       /*!< (@ 0x50001806) USB test Register (for test purpose only)              */
  __IO uint16_t  USB_FAR_REG;                       /*!< (@ 0x50001808) Function Address Register                              */
  __IO uint16_t  USB_NFSR_REG;                      /*!< (@ 0x5000180A) Node Functional State Register                         */
  __IO uint16_t  USB_MAEV_REG;                      /*!< (@ 0x5000180C) Main Event Register                                    */
  __IO uint16_t  USB_MAMSK_REG;                     /*!< (@ 0x5000180E) Main Mask Register                                     */
  __IO uint16_t  USB_ALTEV_REG;                     /*!< (@ 0x50001810) Alternate Event Register                               */
  __IO uint16_t  USB_ALTMSK_REG;                    /*!< (@ 0x50001812) Alternate Mask Register                                */
  __IO uint16_t  USB_TXEV_REG;                      /*!< (@ 0x50001814) Transmit Event Register                                */
  __IO uint16_t  USB_TXMSK_REG;                     /*!< (@ 0x50001816) Transmit Mask Register                                 */
  __IO uint16_t  USB_RXEV_REG;                      /*!< (@ 0x50001818) Receive Event Register                                 */
  __IO uint16_t  USB_RXMSK_REG;                     /*!< (@ 0x5000181A) Receive Mask Register                                  */
  __IO uint16_t  USB_NAKEV_REG;                     /*!< (@ 0x5000181C) NAK Event Register                                     */
  __IO uint16_t  USB_NAKMSK_REG;                    /*!< (@ 0x5000181E) NAK Mask Register                                      */
  __IO uint16_t  USB_FWEV_REG;                      /*!< (@ 0x50001820) FIFO Warning Event Register                            */
  __IO uint16_t  USB_FWMSK_REG;                     /*!< (@ 0x50001822) FIFO Warning Mask Register                             */
  __IO uint16_t  USB_FNH_REG;                       /*!< (@ 0x50001824) Frame Number High Byte Register                        */
  __IO uint16_t  USB_FNL_REG;                       /*!< (@ 0x50001826) Frame Number Low Byte Register                         */
  __I  uint16_t  RESERVED[11];
  __IO uint16_t  USB_UX20CDR_REG;                   /*!< (@ 0x5000183E) Transceiver 2.0 Configuration and Diagnostics
                                                         Register(for test purpose only)                                       */
  __IO uint16_t  USB_EPC0_REG;                      /*!< (@ 0x50001840) Endpoint Control 0 Register                            */
  __IO uint16_t  USB_TXD0_REG;                      /*!< (@ 0x50001842) Transmit Data 0 Register                               */
  __IO uint16_t  USB_TXS0_REG;                      /*!< (@ 0x50001844) Transmit Status 0 Register                             */
  __IO uint16_t  USB_TXC0_REG;                      /*!< (@ 0x50001846) Transmit command 0 Register                            */
  __IO uint16_t  USB_EP0_NAK_REG;                   /*!< (@ 0x50001848) EP0 INNAK and OUTNAK Register                          */
  __IO uint16_t  USB_RXD0_REG;                      /*!< (@ 0x5000184A) Receive Data 0 Register                                */
  __IO uint16_t  USB_RXS0_REG;                      /*!< (@ 0x5000184C) Receive Status 0 Register                              */
  __IO uint16_t  USB_RXC0_REG;                      /*!< (@ 0x5000184E) Receive Command 0 Register                             */
  __IO uint16_t  USB_EPC1_REG;                      /*!< (@ 0x50001850) Endpoint Control Register 1                            */
  __IO uint16_t  USB_TXD1_REG;                      /*!< (@ 0x50001852) Transmit Data Register 1                               */
  __IO uint16_t  USB_TXS1_REG;                      /*!< (@ 0x50001854) Transmit Status Register 1                             */
  __IO uint16_t  USB_TXC1_REG;                      /*!< (@ 0x50001856) Transmit Command Register 1                            */
  __IO uint16_t  USB_EPC2_REG;                      /*!< (@ 0x50001858) Endpoint Control Register 2                            */
  __IO uint16_t  USB_RXD1_REG;                      /*!< (@ 0x5000185A) Receive Data Register,1                                */
  __IO uint16_t  USB_RXS1_REG;                      /*!< (@ 0x5000185C) Receive Status Register 1                              */
  __IO uint16_t  USB_RXC1_REG;                      /*!< (@ 0x5000185E) Receive Command Register 1                             */
  __IO uint16_t  USB_EPC3_REG;                      /*!< (@ 0x50001860) Endpoint Control Register 3                            */
  __IO uint16_t  USB_TXD2_REG;                      /*!< (@ 0x50001862) Transmit Data Register 2                               */
  __IO uint16_t  USB_TXS2_REG;                      /*!< (@ 0x50001864) Transmit Status Register 2                             */
  __IO uint16_t  USB_TXC2_REG;                      /*!< (@ 0x50001866) Transmit Command Register 2                            */
  __IO uint16_t  USB_EPC4_REG;                      /*!< (@ 0x50001868) Endpoint Control Register 4                            */
  __IO uint16_t  USB_RXD2_REG;                      /*!< (@ 0x5000186A) Receive Data Register 2                                */
  __IO uint16_t  USB_RXS2_REG;                      /*!< (@ 0x5000186C) Receive Status Register 2                              */
  __IO uint16_t  USB_RXC2_REG;                      /*!< (@ 0x5000186E) Receive Command Register 2                             */
  __IO uint16_t  USB_EPC5_REG;                      /*!< (@ 0x50001870) Endpoint Control Register 5                            */
  __IO uint16_t  USB_TXD3_REG;                      /*!< (@ 0x50001872) Transmit Data Register 3                               */
  __IO uint16_t  USB_TXS3_REG;                      /*!< (@ 0x50001874) Transmit Status Register 3                             */
  __IO uint16_t  USB_TXC3_REG;                      /*!< (@ 0x50001876) Transmit Command Register 3                            */
  __IO uint16_t  USB_EPC6_REG;                      /*!< (@ 0x50001878) Endpoint Control Register 6                            */
  __IO uint16_t  USB_RXD3_REG;                      /*!< (@ 0x5000187A) Receive Data Register 3                                */
  __IO uint16_t  USB_RXS3_REG;                      /*!< (@ 0x5000187C) Receive Status Register 3                              */
  __IO uint16_t  USB_RXC3_REG;                      /*!< (@ 0x5000187E) Receive Command Register 3                             */
  __I  uint32_t  RESERVED1[20];
  __IO uint16_t  USB_DMA_CTRL_REG;                  /*!< (@ 0x500018D0) USB DMA control register                               */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  USB_CHARGER_CTRL_REG;              /*!< (@ 0x500018D4) USB Charger Control Register                           */
  __IO uint16_t  USB_CHARGER_STAT_REG;              /*!< (@ 0x500018D6) USB Charger Status Register                            */
} USB_Type;


/* ================================================================================ */
/* ================                     WAKEUP                     ================ */
/* ================================================================================ */


/**
  * @brief WAKEUP registers (WAKEUP)
  */

