openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
typedef struct {                                    /*!< (@ 0x50000100) WAKEUP Structure                                       */
  __IO uint16_t  WKUP_CTRL_REG;                     /*!< (@ 0x50000100) Control register for the wakeup counter                */
  __IO uint16_t  WKUP_COMPARE_REG;                  /*!< (@ 0x50000102) Number of events before wakeup interrupt               */
  __IO uint16_t  WKUP_RESET_IRQ_REG;                /*!< (@ 0x50000104) Reset wakeup interrupt                                 */
  __IO uint16_t  WKUP_COUNTER_REG;                  /*!< (@ 0x50000106) Actual number of events of the wakeup counter          */
  __IO uint16_t  WKUP_RESET_CNTR_REG;               /*!< (@ 0x50000108) Reset the event counter                                */
  __IO uint16_t  WKUP_SELECT_P0_REG;                /*!< (@ 0x5000010A) select which inputs from P0 port can trigger
                                                         wkup counter                                                          */
  __IO uint16_t  WKUP_SELECT_P1_REG;                /*!< (@ 0x5000010C) select which inputs from P1 port can trigger
                                                         wkup counter                                                          */
  __IO uint16_t  WKUP_SELECT_P2_REG;                /*!< (@ 0x5000010E) select which inputs from P2 port can trigger
                                                         wkup counter                                                          */
  __IO uint16_t  WKUP_SELECT_P3_REG;                /*!< (@ 0x50000110) select which inputs from P3 port can trigger
                                                         wkup counter                                                          */
  __IO uint16_t  WKUP_SELECT_P4_REG;                /*!< (@ 0x50000112) select which inputs from P3 port can trigger
                                                         wkup counter                                                          */
  __IO uint16_t  WKUP_POL_P0_REG;                   /*!< (@ 0x50000114) select the sesitivity polarity for each P0 input       */
  __IO uint16_t  WKUP_POL_P1_REG;                   /*!< (@ 0x50000116) select the sesitivity polarity for each P1 input       */
  __IO uint16_t  WKUP_POL_P2_REG;                   /*!< (@ 0x50000118) select the sesitivity polarity for each P2 input       */
  __IO uint16_t  WKUP_POL_P3_REG;                   /*!< (@ 0x5000011A) select the sesitivity polarity for each P3 input       */
  __IO uint16_t  WKUP_POL_P4_REG;                   /*!< (@ 0x5000011C) select the sesitivity polarity for each P3 input       */
} WAKEUP_Type;


/* ================================================================================ */
/* ================                      WDOG                      ================ */
/* ================================================================================ */


/**
  * @brief WDOG registers (WDOG)
  */

typedef struct {                                    /*!< (@ 0x50003100) WDOG Structure                                         */
  __IO uint16_t  WATCHDOG_REG;                      /*!< (@ 0x50003100) Watchdog timer register.                               */
  __IO uint16_t  WATCHDOG_CTRL_REG;                 /*!< (@ 0x50003102) Watchdog control register.                             */
} WDOG_Type;


/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif



/* ================================================================================ */
/* ================          struct 'NVIC' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------------  NVIC_ISER  --------------------------------- */
#define NVIC_ISER_BLE_WAKEUP_LP_IRQn_Pos      (0UL)                     /*!< NVIC ISER: BLE_WAKEUP_LP_IRQn (Bit 0)                       */
#define NVIC_ISER_BLE_WAKEUP_LP_IRQn_Msk      (0x1UL)                   /*!< NVIC ISER: BLE_WAKEUP_LP_IRQn (Bitfield-Mask: 0x01)         */
#define NVIC_ISER_BLE_GEN_IRQn_Pos            (1UL)                     /*!< NVIC ISER: BLE_GEN_IRQn (Bit 1)                             */
#define NVIC_ISER_BLE_GEN_IRQn_Msk            (0x2UL)                   /*!< NVIC ISER: BLE_GEN_IRQn (Bitfield-Mask: 0x01)               */
#define NVIC_ISER_FTDF_WAKEUP_IRQn_Pos        (2UL)                     /*!< NVIC ISER: FTDF_WAKEUP_IRQn (Bit 2)                         */
#define NVIC_ISER_FTDF_WAKEUP_IRQn_Msk        (0x4UL)                   /*!< NVIC ISER: FTDF_WAKEUP_IRQn (Bitfield-Mask: 0x01)           */
#define NVIC_ISER_FTDF_GEN_IRQn_Pos           (3UL)                     /*!< NVIC ISER: FTDF_GEN_IRQn (Bit 3)                            */
#define NVIC_ISER_FTDF_GEN_IRQn_Msk           (0x8UL)                   /*!< NVIC ISER: FTDF_GEN_IRQn (Bitfield-Mask: 0x01)              */
#define NVIC_ISER_RFCAL_IRQn_Pos              (4UL)                     /*!< NVIC ISER: RFCAL_IRQn (Bit 4)                               */
#define NVIC_ISER_RFCAL_IRQn_Msk              (0x10UL)                  /*!< NVIC ISER: RFCAL_IRQn (Bitfield-Mask: 0x01)                 */
#define NVIC_ISER_COEX_IRQn_Pos               (5UL)                     /*!< NVIC ISER: COEX_IRQn (Bit 5)                                */
#define NVIC_ISER_COEX_IRQn_Msk               (0x20UL)                  /*!< NVIC ISER: COEX_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISER_CRYPTO_IRQn_Pos             (6UL)                     /*!< NVIC ISER: CRYPTO_IRQn (Bit 6)                              */
#define NVIC_ISER_CRYPTO_IRQn_Msk             (0x40UL)                  /*!< NVIC ISER: CRYPTO_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ISER_MRM_IRQn_Pos                (7UL)                     /*!< NVIC ISER: MRM_IRQn (Bit 7)                                 */
#define NVIC_ISER_MRM_IRQn_Msk                (0x80UL)                  /*!< NVIC ISER: MRM_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISER_UART_IRQn_Pos               (8UL)                     /*!< NVIC ISER: UART_IRQn (Bit 8)                                */
#define NVIC_ISER_UART_IRQn_Msk               (0x100UL)                 /*!< NVIC ISER: UART_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISER_UART2_IRQn_Pos              (9UL)                     /*!< NVIC ISER: UART2_IRQn (Bit 9)                               */
#define NVIC_ISER_UART2_IRQn_Msk              (0x200UL)                 /*!< NVIC ISER: UART2_IRQn (Bitfield-Mask: 0x01)                 */
#define NVIC_ISER_I2C_IRQn_Pos                (10UL)                    /*!< NVIC ISER: I2C_IRQn (Bit 10)                                */
#define NVIC_ISER_I2C_IRQn_Msk                (0x400UL)                 /*!< NVIC ISER: I2C_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISER_I2C2_IRQn_Pos               (11UL)                    /*!< NVIC ISER: I2C2_IRQn (Bit 11)                               */
#define NVIC_ISER_I2C2_IRQn_Msk               (0x800UL)                 /*!< NVIC ISER: I2C2_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISER_SPI_IRQn_Pos                (12UL)                    /*!< NVIC ISER: SPI_IRQn (Bit 12)                                */
#define NVIC_ISER_SPI_IRQn_Msk                (0x1000UL)                /*!< NVIC ISER: SPI_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISER_SPI2_IRQn_Pos               (13UL)                    /*!< NVIC ISER: SPI2_IRQn (Bit 13)                               */
#define NVIC_ISER_SPI2_IRQn_Msk               (0x2000UL)                /*!< NVIC ISER: SPI2_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISER_ADC_IRQn_Pos                (14UL)                    /*!< NVIC ISER: ADC_IRQn (Bit 14)                                */
#define NVIC_ISER_ADC_IRQn_Msk                (0x4000UL)                /*!< NVIC ISER: ADC_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISER_KEYBRD_IRQn_Pos             (15UL)                    /*!< NVIC ISER: KEYBRD_IRQn (Bit 15)                             */
#define NVIC_ISER_KEYBRD_IRQn_Msk             (0x8000UL)                /*!< NVIC ISER: KEYBRD_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ISER_IRGEN_IRQn_Pos              (16UL)                    /*!< NVIC ISER: IRGEN_IRQn (Bit 16)                              */
#define NVIC_ISER_IRGEN_IRQn_Msk              (0x10000UL)               /*!< NVIC ISER: IRGEN_IRQn (Bitfield-Mask: 0x01)                 */
#define NVIC_ISER_WKUP_GPIO_IRQn_Pos          (17UL)                    /*!< NVIC ISER: WKUP_GPIO_IRQn (Bit 17)                          */
#define NVIC_ISER_WKUP_GPIO_IRQn_Msk          (0x20000UL)               /*!< NVIC ISER: WKUP_GPIO_IRQn (Bitfield-Mask: 0x01)             */
#define NVIC_ISER_SWTIM0_IRQn_Pos             (18UL)                    /*!< NVIC ISER: SWTIM0_IRQn (Bit 18)                             */
#define NVIC_ISER_SWTIM0_IRQn_Msk             (0x40000UL)               /*!< NVIC ISER: SWTIM0_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ISER_SWTIM1_IRQn_Pos             (19UL)                    /*!< NVIC ISER: SWTIM1_IRQn (Bit 19)                             */
#define NVIC_ISER_SWTIM1_IRQn_Msk             (0x80000UL)               /*!< NVIC ISER: SWTIM1_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ISER_QUADEC_IRQn_Pos             (20UL)                    /*!< NVIC ISER: QUADEC_IRQn (Bit 20)                             */
#define NVIC_ISER_QUADEC_IRQn_Msk             (0x100000UL)              /*!< NVIC ISER: QUADEC_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ISER_USB_IRQn_Pos                (21UL)                    /*!< NVIC ISER: USB_IRQn (Bit 21)                                */
#define NVIC_ISER_USB_IRQn_Msk                (0x200000UL)              /*!< NVIC ISER: USB_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISER_PCM_IRQn_Pos                (22UL)                    /*!< NVIC ISER: PCM_IRQn (Bit 22)                                */
#define NVIC_ISER_PCM_IRQn_Msk                (0x400000UL)              /*!< NVIC ISER: PCM_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISER_SRC_IN_IRQn_Pos             (23UL)                    /*!< NVIC ISER: SRC_IN_IRQn (Bit 23)                             */
#define NVIC_ISER_SRC_IN_IRQn_Msk             (0x800000UL)              /*!< NVIC ISER: SRC_IN_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ISER_SRC_OUT_IRQn_Pos            (24UL)                    /*!< NVIC ISER: SRC_OUT_IRQn (Bit 24)                            */
#define NVIC_ISER_SRC_OUT_IRQn_Msk            (0x1000000UL)             /*!< NVIC ISER: SRC_OUT_IRQn (Bitfield-Mask: 0x01)               */
#define NVIC_ISER_VBUS_IRQn_Pos               (25UL)                    /*!< NVIC ISER: VBUS_IRQn (Bit 25)                               */
#define NVIC_ISER_VBUS_IRQn_Msk               (0x2000000UL)             /*!< NVIC ISER: VBUS_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISER_DMA_IRQn_Pos                (26UL)                    /*!< NVIC ISER: DMA_IRQn (Bit 26)                                */
#define NVIC_ISER_DMA_IRQn_Msk                (0x4000000UL)             /*!< NVIC ISER: DMA_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ISER_RF_DIAG_IRQn_Pos            (27UL)                    /*!< NVIC ISER: RF_DIAG_IRQn (Bit 27)                            */
#define NVIC_ISER_RF_DIAG_IRQn_Msk            (0x8000000UL)             /*!< NVIC ISER: RF_DIAG_IRQn (Bitfield-Mask: 0x01)               */
#define NVIC_ISER_TRNG_IRQn_Pos               (28UL)                    /*!< NVIC ISER: TRNG_IRQn (Bit 28)                               */
#define NVIC_ISER_TRNG_IRQn_Msk               (0x10000000UL)            /*!< NVIC ISER: TRNG_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISER_DCDC_IRQn_Pos               (29UL)                    /*!< NVIC ISER: DCDC_IRQn (Bit 29)                               */
#define NVIC_ISER_DCDC_IRQn_Msk               (0x20000000UL)            /*!< NVIC ISER: DCDC_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ISER_XTAL16RDY_IRQn_Pos          (30UL)                    /*!< NVIC ISER: XTAL16RDY_IRQn (Bit 30)                          */
#define NVIC_ISER_XTAL16RDY_IRQn_Msk          (0x40000000UL)            /*!< NVIC ISER: XTAL16RDY_IRQn (Bitfield-Mask: 0x01)             */
#define NVIC_ISER_Rsvd__irq__n_Pos            (31UL)                    /*!< NVIC ISER: Rsvd__irq__n (Bit 31)                            */
#define NVIC_ISER_Rsvd__irq__n_Msk            (0x80000000UL)            /*!< NVIC ISER: Rsvd__irq__n (Bitfield-Mask: 0x01)               */

/* ----------------------------------  NVIC_ICER  --------------------------------- */
#define NVIC_ICER_BLE_WAKEUP_LP_IRQn_Pos      (0UL)                     /*!< NVIC ICER: BLE_WAKEUP_LP_IRQn (Bit 0)                       */
#define NVIC_ICER_BLE_WAKEUP_LP_IRQn_Msk      (0x1UL)                   /*!< NVIC ICER: BLE_WAKEUP_LP_IRQn (Bitfield-Mask: 0x01)         */
#define NVIC_ICER_BLE_GEN_IRQn_Pos            (1UL)                     /*!< NVIC ICER: BLE_GEN_IRQn (Bit 1)                             */
#define NVIC_ICER_BLE_GEN_IRQn_Msk            (0x2UL)                   /*!< NVIC ICER: BLE_GEN_IRQn (Bitfield-Mask: 0x01)               */
#define NVIC_ICER_FTDF_WAKEUP_IRQn_Pos        (2UL)                     /*!< NVIC ICER: FTDF_WAKEUP_IRQn (Bit 2)                         */
#define NVIC_ICER_FTDF_WAKEUP_IRQn_Msk        (0x4UL)                   /*!< NVIC ICER: FTDF_WAKEUP_IRQn (Bitfield-Mask: 0x01)           */
#define NVIC_ICER_FTDF_GEN_IRQn_Pos           (3UL)                     /*!< NVIC ICER: FTDF_GEN_IRQn (Bit 3)                            */
#define NVIC_ICER_FTDF_GEN_IRQn_Msk           (0x8UL)                   /*!< NVIC ICER: FTDF_GEN_IRQn (Bitfield-Mask: 0x01)              */
#define NVIC_ICER_RFCAL_IRQn_Pos              (4UL)                     /*!< NVIC ICER: RFCAL_IRQn (Bit 4)                               */
#define NVIC_ICER_RFCAL_IRQn_Msk              (0x10UL)                  /*!< NVIC ICER: RFCAL_IRQn (Bitfield-Mask: 0x01)                 */
#define NVIC_ICER_COEX_IRQn_Pos               (5UL)                     /*!< NVIC ICER: COEX_IRQn (Bit 5)                                */
#define NVIC_ICER_COEX_IRQn_Msk               (0x20UL)                  /*!< NVIC ICER: COEX_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ICER_CRYPTO_IRQn_Pos             (6UL)                     /*!< NVIC ICER: CRYPTO_IRQn (Bit 6)                              */
#define NVIC_ICER_CRYPTO_IRQn_Msk             (0x40UL)                  /*!< NVIC ICER: CRYPTO_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ICER_MRM_IRQn_Pos                (7UL)                     /*!< NVIC ICER: MRM_IRQn (Bit 7)                                 */
#define NVIC_ICER_MRM_IRQn_Msk                (0x80UL)                  /*!< NVIC ICER: MRM_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ICER_UART_IRQn_Pos               (8UL)                     /*!< NVIC ICER: UART_IRQn (Bit 8)                                */
#define NVIC_ICER_UART_IRQn_Msk               (0x100UL)                 /*!< NVIC ICER: UART_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ICER_UART2_IRQn_Pos              (9UL)                     /*!< NVIC ICER: UART2_IRQn (Bit 9)                               */
#define NVIC_ICER_UART2_IRQn_Msk              (0x200UL)                 /*!< NVIC ICER: UART2_IRQn (Bitfield-Mask: 0x01)                 */
#define NVIC_ICER_I2C_IRQn_Pos                (10UL)                    /*!< NVIC ICER: I2C_IRQn (Bit 10)                                */
#define NVIC_ICER_I2C_IRQn_Msk                (0x400UL)                 /*!< NVIC ICER: I2C_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ICER_I2C2_IRQn_Pos               (11UL)                    /*!< NVIC ICER: I2C2_IRQn (Bit 11)                               */
#define NVIC_ICER_I2C2_IRQn_Msk               (0x800UL)                 /*!< NVIC ICER: I2C2_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ICER_SPI_IRQn_Pos                (12UL)                    /*!< NVIC ICER: SPI_IRQn (Bit 12)                                */
#define NVIC_ICER_SPI_IRQn_Msk                (0x1000UL)                /*!< NVIC ICER: SPI_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ICER_SPI2_IRQn_Pos               (13UL)                    /*!< NVIC ICER: SPI2_IRQn (Bit 13)                               */
#define NVIC_ICER_SPI2_IRQn_Msk               (0x2000UL)                /*!< NVIC ICER: SPI2_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ICER_ADC_IRQn_Pos                (14UL)                    /*!< NVIC ICER: ADC_IRQn (Bit 14)                                */
#define NVIC_ICER_ADC_IRQn_Msk                (0x4000UL)                /*!< NVIC ICER: ADC_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ICER_KEYBRD_IRQn_Pos             (15UL)                    /*!< NVIC ICER: KEYBRD_IRQn (Bit 15)                             */
#define NVIC_ICER_KEYBRD_IRQn_Msk             (0x8000UL)                /*!< NVIC ICER: KEYBRD_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ICER_IRGEN_IRQn_Pos              (16UL)                    /*!< NVIC ICER: IRGEN_IRQn (Bit 16)                              */
#define NVIC_ICER_IRGEN_IRQn_Msk              (0x10000UL)               /*!< NVIC ICER: IRGEN_IRQn (Bitfield-Mask: 0x01)                 */
#define NVIC_ICER_WKUP_GPIO_IRQn_Pos          (17UL)                    /*!< NVIC ICER: WKUP_GPIO_IRQn (Bit 17)                          */
#define NVIC_ICER_WKUP_GPIO_IRQn_Msk          (0x20000UL)               /*!< NVIC ICER: WKUP_GPIO_IRQn (Bitfield-Mask: 0x01)             */
#define NVIC_ICER_SWTIM0_IRQn_Pos             (18UL)                    /*!< NVIC ICER: SWTIM0_IRQn (Bit 18)                             */
#define NVIC_ICER_SWTIM0_IRQn_Msk             (0x40000UL)               /*!< NVIC ICER: SWTIM0_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ICER_SWTIM1_IRQn_Pos             (19UL)                    /*!< NVIC ICER: SWTIM1_IRQn (Bit 19)                             */
#define NVIC_ICER_SWTIM1_IRQn_Msk             (0x80000UL)               /*!< NVIC ICER: SWTIM1_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ICER_QUADEC_IRQn_Pos             (20UL)                    /*!< NVIC ICER: QUADEC_IRQn (Bit 20)                             */
#define NVIC_ICER_QUADEC_IRQn_Msk             (0x100000UL)              /*!< NVIC ICER: QUADEC_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ICER_USB_IRQn_Pos                (21UL)                    /*!< NVIC ICER: USB_IRQn (Bit 21)                                */
#define NVIC_ICER_USB_IRQn_Msk                (0x200000UL)              /*!< NVIC ICER: USB_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ICER_PCM_IRQn_Pos                (22UL)                    /*!< NVIC ICER: PCM_IRQn (Bit 22)                                */
#define NVIC_ICER_PCM_IRQn_Msk                (0x400000UL)              /*!< NVIC ICER: PCM_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ICER_SRC_IN_IRQn_Pos             (23UL)                    /*!< NVIC ICER: SRC_IN_IRQn (Bit 23)                             */
#define NVIC_ICER_SRC_IN_IRQn_Msk             (0x800000UL)              /*!< NVIC ICER: SRC_IN_IRQn (Bitfield-Mask: 0x01)                */
#define NVIC_ICER_SRC_OUT_IRQn_Pos            (24UL)                    /*!< NVIC ICER: SRC_OUT_IRQn (Bit 24)                            */
#define NVIC_ICER_SRC_OUT_IRQn_Msk            (0x1000000UL)             /*!< NVIC ICER: SRC_OUT_IRQn (Bitfield-Mask: 0x01)               */
#define NVIC_ICER_VBUS_IRQn_Pos               (25UL)                    /*!< NVIC ICER: VBUS_IRQn (Bit 25)                               */
#define NVIC_ICER_VBUS_IRQn_Msk               (0x2000000UL)             /*!< NVIC ICER: VBUS_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ICER_DMA_IRQn_Pos                (26UL)                    /*!< NVIC ICER: DMA_IRQn (Bit 26)                                */
#define NVIC_ICER_DMA_IRQn_Msk                (0x4000000UL)             /*!< NVIC ICER: DMA_IRQn (Bitfield-Mask: 0x01)                   */
#define NVIC_ICER_RF_DIAG_IRQn_Pos            (27UL)                    /*!< NVIC ICER: RF_DIAG_IRQn (Bit 27)                            */
#define NVIC_ICER_RF_DIAG_IRQn_Msk            (0x8000000UL)             /*!< NVIC ICER: RF_DIAG_IRQn (Bitfield-Mask: 0x01)               */
#define NVIC_ICER_TRNG_IRQn_Pos               (28UL)                    /*!< NVIC ICER: TRNG_IRQn (Bit 28)                               */
#define NVIC_ICER_TRNG_IRQn_Msk               (0x10000000UL)            /*!< NVIC ICER: TRNG_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ICER_DCDC_IRQn_Pos               (29UL)                    /*!< NVIC ICER: DCDC_IRQn (Bit 29)                               */
#define NVIC_ICER_DCDC_IRQn_Msk               (0x20000000UL)            /*!< NVIC ICER: DCDC_IRQn (Bitfield-Mask: 0x01)                  */
#define NVIC_ICER_XTAL16RDY_IRQn_Pos          (30UL)                    /*!< NVIC ICER: XTAL16RDY_IRQn (Bit 30)                          */
#define NVIC_ICER_XTAL16RDY_IRQn_Msk          (0x40000000UL)            /*!< NVIC ICER: XTAL16RDY_IRQn (Bitfield-Mask: 0x01)             */
#define NVIC_ICER_Rsvd__irq__n_Pos            (31UL)                    /*!< NVIC ICER: Rsvd__irq__n (Bit 31)                            */
#define NVIC_ICER_Rsvd__irq__n_Msk            (0x80000000UL)            /*!< NVIC ICER: Rsvd__irq__n (Bitfield-Mask: 0x01)               */

