openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* ---------------------------  AES_HASH_CRYPTO_LEN_REG  -------------------------- */
#define AES_HASH_CRYPTO_LEN_REG_CRYPTO_LEN_Pos (0UL)                    /*!< AES_HASH CRYPTO_LEN_REG: CRYPTO_LEN (Bit 0)                 */
#define AES_HASH_CRYPTO_LEN_REG_CRYPTO_LEN_Msk (0xffffffUL)             /*!< AES_HASH CRYPTO_LEN_REG: CRYPTO_LEN (Bitfield-Mask: 0xffffff) */

/* ------------------------  AES_HASH_CRYPTO_DEST_ADDR_REG  ----------------------- */
#define AES_HASH_CRYPTO_DEST_ADDR_REG_CRYPTO_DEST_ADDR_Pos (0UL)        /*!< AES_HASH CRYPTO_DEST_ADDR_REG: CRYPTO_DEST_ADDR (Bit 0)     */
#define AES_HASH_CRYPTO_DEST_ADDR_REG_CRYPTO_DEST_ADDR_Msk (0xffffffffUL) /*!< AES_HASH CRYPTO_DEST_ADDR_REG: CRYPTO_DEST_ADDR (Bitfield-Mask: 0xffffffff) */

/* -------------------------  AES_HASH_CRYPTO_STATUS_REG  ------------------------- */
#define AES_HASH_CRYPTO_STATUS_REG_CRYPTO_INACTIVE_Pos (0UL)            /*!< AES_HASH CRYPTO_STATUS_REG: CRYPTO_INACTIVE (Bit 0)         */
#define AES_HASH_CRYPTO_STATUS_REG_CRYPTO_INACTIVE_Msk (0x1UL)          /*!< AES_HASH CRYPTO_STATUS_REG: CRYPTO_INACTIVE (Bitfield-Mask: 0x01) */
#define AES_HASH_CRYPTO_STATUS_REG_CRYPTO_WAIT_FOR_IN_Pos (1UL)         /*!< AES_HASH CRYPTO_STATUS_REG: CRYPTO_WAIT_FOR_IN (Bit 1)      */
#define AES_HASH_CRYPTO_STATUS_REG_CRYPTO_WAIT_FOR_IN_Msk (0x2UL)       /*!< AES_HASH CRYPTO_STATUS_REG: CRYPTO_WAIT_FOR_IN (Bitfield-Mask: 0x01) */
#define AES_HASH_CRYPTO_STATUS_REG_CRYPTO_IRQ_ST_Pos (2UL)              /*!< AES_HASH CRYPTO_STATUS_REG: CRYPTO_IRQ_ST (Bit 2)           */
#define AES_HASH_CRYPTO_STATUS_REG_CRYPTO_IRQ_ST_Msk (0x4UL)            /*!< AES_HASH CRYPTO_STATUS_REG: CRYPTO_IRQ_ST (Bitfield-Mask: 0x01) */

/* -------------------------  AES_HASH_CRYPTO_CLRIRQ_REG  ------------------------- */
#define AES_HASH_CRYPTO_CLRIRQ_REG_CRYPTO_CLRIRQ_Pos (0UL)              /*!< AES_HASH CRYPTO_CLRIRQ_REG: CRYPTO_CLRIRQ (Bit 0)           */
#define AES_HASH_CRYPTO_CLRIRQ_REG_CRYPTO_CLRIRQ_Msk (0x1UL)            /*!< AES_HASH CRYPTO_CLRIRQ_REG: CRYPTO_CLRIRQ (Bitfield-Mask: 0x01) */

/* --------------------------  AES_HASH_CRYPTO_MREG0_REG  ------------------------- */
#define AES_HASH_CRYPTO_MREG0_REG_CRYPTO_MREG0_Pos (0UL)                /*!< AES_HASH CRYPTO_MREG0_REG: CRYPTO_MREG0 (Bit 0)             */
#define AES_HASH_CRYPTO_MREG0_REG_CRYPTO_MREG0_Msk (0xffffffffUL)       /*!< AES_HASH CRYPTO_MREG0_REG: CRYPTO_MREG0 (Bitfield-Mask: 0xffffffff) */

/* --------------------------  AES_HASH_CRYPTO_MREG1_REG  ------------------------- */
#define AES_HASH_CRYPTO_MREG1_REG_CRYPTO_MREG1_Pos (0UL)                /*!< AES_HASH CRYPTO_MREG1_REG: CRYPTO_MREG1 (Bit 0)             */
#define AES_HASH_CRYPTO_MREG1_REG_CRYPTO_MREG1_Msk (0xffffffffUL)       /*!< AES_HASH CRYPTO_MREG1_REG: CRYPTO_MREG1 (Bitfield-Mask: 0xffffffff) */

/* --------------------------  AES_HASH_CRYPTO_MREG2_REG  ------------------------- */
#define AES_HASH_CRYPTO_MREG2_REG_CRYPTO_MREG2_Pos (0UL)                /*!< AES_HASH CRYPTO_MREG2_REG: CRYPTO_MREG2 (Bit 0)             */
#define AES_HASH_CRYPTO_MREG2_REG_CRYPTO_MREG2_Msk (0xffffffffUL)       /*!< AES_HASH CRYPTO_MREG2_REG: CRYPTO_MREG2 (Bitfield-Mask: 0xffffffff) */

/* --------------------------  AES_HASH_CRYPTO_MREG3_REG  ------------------------- */
#define AES_HASH_CRYPTO_MREG3_REG_CRYPTO_MREG3_Pos (0UL)                /*!< AES_HASH CRYPTO_MREG3_REG: CRYPTO_MREG3 (Bit 0)             */
#define AES_HASH_CRYPTO_MREG3_REG_CRYPTO_MREG3_Msk (0xffffffffUL)       /*!< AES_HASH CRYPTO_MREG3_REG: CRYPTO_MREG3 (Bitfield-Mask: 0xffffffff) */

/* -------------------------  AES_HASH_CRYPTO_KEYS_START  ------------------------- */
#define AES_HASH_CRYPTO_KEYS_START_CRYPTO_KEY_X_Pos (0UL)               /*!< AES_HASH CRYPTO_KEYS_START: CRYPTO_KEY_X (Bit 0)            */
#define AES_HASH_CRYPTO_KEYS_START_CRYPTO_KEY_X_Msk (0xffffffffUL)      /*!< AES_HASH CRYPTO_KEYS_START: CRYPTO_KEY_X (Bitfield-Mask: 0xffffffff) */


/* ================================================================================ */
/* ================        struct 'ANAMISC' Position & Mask        ================ */
/* ================================================================================ */


/* ----------------------------  ANAMISC_ANA_TEST_REG  ---------------------------- */
#define ANAMISC_ANA_TEST_REG_TEST_STRUCTURE_Pos (0UL)                   /*!< ANAMISC ANA_TEST_REG: TEST_STRUCTURE (Bit 0)                */
#define ANAMISC_ANA_TEST_REG_TEST_STRUCTURE_Msk (0xfUL)                 /*!< ANAMISC ANA_TEST_REG: TEST_STRUCTURE (Bitfield-Mask: 0x0f)  */
#define ANAMISC_ANA_TEST_REG_ACORE_TESTBUS_EN_Pos (4UL)                 /*!< ANAMISC ANA_TEST_REG: ACORE_TESTBUS_EN (Bit 4)              */
#define ANAMISC_ANA_TEST_REG_ACORE_TESTBUS_EN_Msk (0x10UL)              /*!< ANAMISC ANA_TEST_REG: ACORE_TESTBUS_EN (Bitfield-Mask: 0x01) */

/* --------------------------  ANAMISC_CHARGER_CTRL1_REG  ------------------------- */
#define ANAMISC_CHARGER_CTRL1_REG_CHARGE_LEVEL_Pos (0UL)                /*!< ANAMISC CHARGER_CTRL1_REG: CHARGE_LEVEL (Bit 0)             */
#define ANAMISC_CHARGER_CTRL1_REG_CHARGE_LEVEL_Msk (0x1fUL)             /*!< ANAMISC CHARGER_CTRL1_REG: CHARGE_LEVEL (Bitfield-Mask: 0x1f) */
#define ANAMISC_CHARGER_CTRL1_REG_CHARGE_ON_Pos (5UL)                   /*!< ANAMISC CHARGER_CTRL1_REG: CHARGE_ON (Bit 5)                */
#define ANAMISC_CHARGER_CTRL1_REG_CHARGE_ON_Msk (0x20UL)                /*!< ANAMISC CHARGER_CTRL1_REG: CHARGE_ON (Bitfield-Mask: 0x01)  */
#define ANAMISC_CHARGER_CTRL1_REG_NTC_DISABLE_Pos (6UL)                 /*!< ANAMISC CHARGER_CTRL1_REG: NTC_DISABLE (Bit 6)              */
#define ANAMISC_CHARGER_CTRL1_REG_NTC_DISABLE_Msk (0x40UL)              /*!< ANAMISC CHARGER_CTRL1_REG: NTC_DISABLE (Bitfield-Mask: 0x01) */
#define ANAMISC_CHARGER_CTRL1_REG_NTC_LOW_DISABLE_Pos (7UL)             /*!< ANAMISC CHARGER_CTRL1_REG: NTC_LOW_DISABLE (Bit 7)          */
#define ANAMISC_CHARGER_CTRL1_REG_NTC_LOW_DISABLE_Msk (0x80UL)          /*!< ANAMISC CHARGER_CTRL1_REG: NTC_LOW_DISABLE (Bitfield-Mask: 0x01) */
#define ANAMISC_CHARGER_CTRL1_REG_CHARGE_CUR_Pos (8UL)                  /*!< ANAMISC CHARGER_CTRL1_REG: CHARGE_CUR (Bit 8)               */
#define ANAMISC_CHARGER_CTRL1_REG_CHARGE_CUR_Msk (0xf00UL)              /*!< ANAMISC CHARGER_CTRL1_REG: CHARGE_CUR (Bitfield-Mask: 0x0f) */
#define ANAMISC_CHARGER_CTRL1_REG_DIE_TEMP_SET_Pos (12UL)               /*!< ANAMISC CHARGER_CTRL1_REG: DIE_TEMP_SET (Bit 12)            */
#define ANAMISC_CHARGER_CTRL1_REG_DIE_TEMP_SET_Msk (0x3000UL)           /*!< ANAMISC CHARGER_CTRL1_REG: DIE_TEMP_SET (Bitfield-Mask: 0x03) */
#define ANAMISC_CHARGER_CTRL1_REG_DIE_TEMP_DISABLE_Pos (14UL)           /*!< ANAMISC CHARGER_CTRL1_REG: DIE_TEMP_DISABLE (Bit 14)        */
#define ANAMISC_CHARGER_CTRL1_REG_DIE_TEMP_DISABLE_Msk (0x4000UL)       /*!< ANAMISC CHARGER_CTRL1_REG: DIE_TEMP_DISABLE (Bitfield-Mask: 0x01) */

/* --------------------------  ANAMISC_CHARGER_CTRL2_REG  ------------------------- */
#define ANAMISC_CHARGER_CTRL2_REG_CURRENT_GAIN_TRIM_Pos (0UL)           /*!< ANAMISC CHARGER_CTRL2_REG: CURRENT_GAIN_TRIM (Bit 0)        */
#define ANAMISC_CHARGER_CTRL2_REG_CURRENT_GAIN_TRIM_Msk (0xfUL)         /*!< ANAMISC CHARGER_CTRL2_REG: CURRENT_GAIN_TRIM (Bitfield-Mask: 0x0f) */
#define ANAMISC_CHARGER_CTRL2_REG_CHARGER_VFLOAT_ADJ_Pos (4UL)          /*!< ANAMISC CHARGER_CTRL2_REG: CHARGER_VFLOAT_ADJ (Bit 4)       */
#define ANAMISC_CHARGER_CTRL2_REG_CHARGER_VFLOAT_ADJ_Msk (0xf0UL)       /*!< ANAMISC CHARGER_CTRL2_REG: CHARGER_VFLOAT_ADJ (Bitfield-Mask: 0x0f) */
#define ANAMISC_CHARGER_CTRL2_REG_CURRENT_OFFSET_TRIM_Pos (8UL)         /*!< ANAMISC CHARGER_CTRL2_REG: CURRENT_OFFSET_TRIM (Bit 8)      */
#define ANAMISC_CHARGER_CTRL2_REG_CURRENT_OFFSET_TRIM_Msk (0x1f00UL)    /*!< ANAMISC CHARGER_CTRL2_REG: CURRENT_OFFSET_TRIM (Bitfield-Mask: 0x1f) */
#define ANAMISC_CHARGER_CTRL2_REG_CHARGER_TEST_Pos (13UL)               /*!< ANAMISC CHARGER_CTRL2_REG: CHARGER_TEST (Bit 13)            */
#define ANAMISC_CHARGER_CTRL2_REG_CHARGER_TEST_Msk (0xe000UL)           /*!< ANAMISC CHARGER_CTRL2_REG: CHARGER_TEST (Bitfield-Mask: 0x07) */

