openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* ---------------------------  BLE_BLE_DEBUGADDMAX_REG  -------------------------- */
#define BLE_BLE_DEBUGADDMAX_REG_EM_ADDMAX_Pos (0UL)                     /*!< BLE BLE_DEBUGADDMAX_REG: EM_ADDMAX (Bit 0)                  */
#define BLE_BLE_DEBUGADDMAX_REG_EM_ADDMAX_Msk (0xffffUL)                /*!< BLE BLE_DEBUGADDMAX_REG: EM_ADDMAX (Bitfield-Mask: 0xffff)  */
#define BLE_BLE_DEBUGADDMAX_REG_REG_ADDMAX_Pos (16UL)                   /*!< BLE BLE_DEBUGADDMAX_REG: REG_ADDMAX (Bit 16)                */
#define BLE_BLE_DEBUGADDMAX_REG_REG_ADDMAX_Msk (0xffff0000UL)           /*!< BLE BLE_DEBUGADDMAX_REG: REG_ADDMAX (Bitfield-Mask: 0xffff) */

/* ---------------------------  BLE_BLE_DEBUGADDMIN_REG  -------------------------- */
#define BLE_BLE_DEBUGADDMIN_REG_EM_ADDMIN_Pos (0UL)                     /*!< BLE BLE_DEBUGADDMIN_REG: EM_ADDMIN (Bit 0)                  */
#define BLE_BLE_DEBUGADDMIN_REG_EM_ADDMIN_Msk (0xffffUL)                /*!< BLE BLE_DEBUGADDMIN_REG: EM_ADDMIN (Bitfield-Mask: 0xffff)  */
#define BLE_BLE_DEBUGADDMIN_REG_REG_ADDMIN_Pos (16UL)                   /*!< BLE BLE_DEBUGADDMIN_REG: REG_ADDMIN (Bit 16)                */
#define BLE_BLE_DEBUGADDMIN_REG_REG_ADDMIN_Msk (0xffff0000UL)           /*!< BLE BLE_DEBUGADDMIN_REG: REG_ADDMIN (Bitfield-Mask: 0xffff) */

/* --------------------------  BLE_BLE_ERRORTYPESTAT_REG  ------------------------- */
#define BLE_BLE_ERRORTYPESTAT_REG_TXCRYPT_ERROR_Pos (0UL)               /*!< BLE BLE_ERRORTYPESTAT_REG: TXCRYPT_ERROR (Bit 0)            */
#define BLE_BLE_ERRORTYPESTAT_REG_TXCRYPT_ERROR_Msk (0x1UL)             /*!< BLE BLE_ERRORTYPESTAT_REG: TXCRYPT_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_RXCRYPT_ERROR_Pos (1UL)               /*!< BLE BLE_ERRORTYPESTAT_REG: RXCRYPT_ERROR (Bit 1)            */
#define BLE_BLE_ERRORTYPESTAT_REG_RXCRYPT_ERROR_Msk (0x2UL)             /*!< BLE BLE_ERRORTYPESTAT_REG: RXCRYPT_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_PKTCNTL_EMACC_ERROR_Pos (2UL)         /*!< BLE BLE_ERRORTYPESTAT_REG: PKTCNTL_EMACC_ERROR (Bit 2)      */
#define BLE_BLE_ERRORTYPESTAT_REG_PKTCNTL_EMACC_ERROR_Msk (0x4UL)       /*!< BLE BLE_ERRORTYPESTAT_REG: PKTCNTL_EMACC_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_RADIO_EMACC_ERROR_Pos (3UL)           /*!< BLE BLE_ERRORTYPESTAT_REG: RADIO_EMACC_ERROR (Bit 3)        */
#define BLE_BLE_ERRORTYPESTAT_REG_RADIO_EMACC_ERROR_Msk (0x8UL)         /*!< BLE BLE_ERRORTYPESTAT_REG: RADIO_EMACC_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_EVT_SCHDL_EMACC_ERROR_Pos (4UL)       /*!< BLE BLE_ERRORTYPESTAT_REG: EVT_SCHDL_EMACC_ERROR (Bit 4)    */
#define BLE_BLE_ERRORTYPESTAT_REG_EVT_SCHDL_EMACC_ERROR_Msk (0x10UL)    /*!< BLE BLE_ERRORTYPESTAT_REG: EVT_SCHDL_EMACC_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_EVT_SCHDL_ENTRY_ERROR_Pos (5UL)       /*!< BLE BLE_ERRORTYPESTAT_REG: EVT_SCHDL_ENTRY_ERROR (Bit 5)    */
#define BLE_BLE_ERRORTYPESTAT_REG_EVT_SCHDL_ENTRY_ERROR_Msk (0x20UL)    /*!< BLE BLE_ERRORTYPESTAT_REG: EVT_SCHDL_ENTRY_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_EVT_SCHDL_APFM_ERROR_Pos (6UL)        /*!< BLE BLE_ERRORTYPESTAT_REG: EVT_SCHDL_APFM_ERROR (Bit 6)     */
#define BLE_BLE_ERRORTYPESTAT_REG_EVT_SCHDL_APFM_ERROR_Msk (0x40UL)     /*!< BLE BLE_ERRORTYPESTAT_REG: EVT_SCHDL_APFM_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_EVT_CNTL_APFM_ERROR_Pos (7UL)         /*!< BLE BLE_ERRORTYPESTAT_REG: EVT_CNTL_APFM_ERROR (Bit 7)      */
#define BLE_BLE_ERRORTYPESTAT_REG_EVT_CNTL_APFM_ERROR_Msk (0x80UL)      /*!< BLE BLE_ERRORTYPESTAT_REG: EVT_CNTL_APFM_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_WHITELIST_ERROR_Pos (8UL)             /*!< BLE BLE_ERRORTYPESTAT_REG: WHITELIST_ERROR (Bit 8)          */
#define BLE_BLE_ERRORTYPESTAT_REG_WHITELIST_ERROR_Msk (0x100UL)         /*!< BLE BLE_ERRORTYPESTAT_REG: WHITELIST_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_IFS_UNDERRUN_Pos (9UL)                /*!< BLE BLE_ERRORTYPESTAT_REG: IFS_UNDERRUN (Bit 9)             */
#define BLE_BLE_ERRORTYPESTAT_REG_IFS_UNDERRUN_Msk (0x200UL)            /*!< BLE BLE_ERRORTYPESTAT_REG: IFS_UNDERRUN (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_ADV_UNDERRUN_Pos (10UL)               /*!< BLE BLE_ERRORTYPESTAT_REG: ADV_UNDERRUN (Bit 10)            */
#define BLE_BLE_ERRORTYPESTAT_REG_ADV_UNDERRUN_Msk (0x400UL)            /*!< BLE BLE_ERRORTYPESTAT_REG: ADV_UNDERRUN (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_LLCHMAP_ERROR_Pos (11UL)              /*!< BLE BLE_ERRORTYPESTAT_REG: LLCHMAP_ERROR (Bit 11)           */
#define BLE_BLE_ERRORTYPESTAT_REG_LLCHMAP_ERROR_Msk (0x800UL)           /*!< BLE BLE_ERRORTYPESTAT_REG: LLCHMAP_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_CSFORMAT_ERROR_Pos (12UL)             /*!< BLE BLE_ERRORTYPESTAT_REG: CSFORMAT_ERROR (Bit 12)          */
#define BLE_BLE_ERRORTYPESTAT_REG_CSFORMAT_ERROR_Msk (0x1000UL)         /*!< BLE BLE_ERRORTYPESTAT_REG: CSFORMAT_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_TXDESC_EMPTY_ERROR_Pos (13UL)         /*!< BLE BLE_ERRORTYPESTAT_REG: TXDESC_EMPTY_ERROR (Bit 13)      */
#define BLE_BLE_ERRORTYPESTAT_REG_TXDESC_EMPTY_ERROR_Msk (0x2000UL)     /*!< BLE BLE_ERRORTYPESTAT_REG: TXDESC_EMPTY_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_RXDESC_EMPTY_ERROR_Pos (14UL)         /*!< BLE BLE_ERRORTYPESTAT_REG: RXDESC_EMPTY_ERROR (Bit 14)      */
#define BLE_BLE_ERRORTYPESTAT_REG_RXDESC_EMPTY_ERROR_Msk (0x4000UL)     /*!< BLE BLE_ERRORTYPESTAT_REG: RXDESC_EMPTY_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_TXDATA_PTR_ERROR_Pos (15UL)           /*!< BLE BLE_ERRORTYPESTAT_REG: TXDATA_PTR_ERROR (Bit 15)        */
#define BLE_BLE_ERRORTYPESTAT_REG_TXDATA_PTR_ERROR_Msk (0x8000UL)       /*!< BLE BLE_ERRORTYPESTAT_REG: TXDATA_PTR_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_RXDATA_PTR_ERROR_Pos (16UL)           /*!< BLE BLE_ERRORTYPESTAT_REG: RXDATA_PTR_ERROR (Bit 16)        */
#define BLE_BLE_ERRORTYPESTAT_REG_RXDATA_PTR_ERROR_Msk (0x10000UL)      /*!< BLE BLE_ERRORTYPESTAT_REG: RXDATA_PTR_ERROR (Bitfield-Mask: 0x01) */
#define BLE_BLE_ERRORTYPESTAT_REG_CONCEVTIRQ_ERROR_Pos (17UL)           /*!< BLE BLE_ERRORTYPESTAT_REG: CONCEVTIRQ_ERROR (Bit 17)        */
#define BLE_BLE_ERRORTYPESTAT_REG_CONCEVTIRQ_ERROR_Msk (0x20000UL)      /*!< BLE BLE_ERRORTYPESTAT_REG: CONCEVTIRQ_ERROR (Bitfield-Mask: 0x01) */

/* ---------------------------  BLE_BLE_SWPROFILING_REG  -------------------------- */
#define BLE_BLE_SWPROFILING_REG_SWPROFVAL_Pos (0UL)                     /*!< BLE BLE_SWPROFILING_REG: SWPROFVAL (Bit 0)                  */
#define BLE_BLE_SWPROFILING_REG_SWPROFVAL_Msk (0xffffffffUL)            /*!< BLE BLE_SWPROFILING_REG: SWPROFVAL (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  BLE_BLE_RADIOCNTL1_REG  --------------------------- */
#define BLE_BLE_RADIOCNTL1_REG_XRFSEL_Pos     (16UL)                    /*!< BLE BLE_RADIOCNTL1_REG: XRFSEL (Bit 16)                     */
#define BLE_BLE_RADIOCNTL1_REG_XRFSEL_Msk     (0x1f0000UL)              /*!< BLE BLE_RADIOCNTL1_REG: XRFSEL (Bitfield-Mask: 0x1f)        */

/* --------------------------  BLE_BLE_RADIOPWRUPDN_REG  -------------------------- */
#define BLE_BLE_RADIOPWRUPDN_REG_TXPWRUP_Pos  (0UL)                     /*!< BLE BLE_RADIOPWRUPDN_REG: TXPWRUP (Bit 0)                   */
#define BLE_BLE_RADIOPWRUPDN_REG_TXPWRUP_Msk  (0xffUL)                  /*!< BLE BLE_RADIOPWRUPDN_REG: TXPWRUP (Bitfield-Mask: 0xff)     */
#define BLE_BLE_RADIOPWRUPDN_REG_TXPWRDN_Pos  (8UL)                     /*!< BLE BLE_RADIOPWRUPDN_REG: TXPWRDN (Bit 8)                   */
#define BLE_BLE_RADIOPWRUPDN_REG_TXPWRDN_Msk  (0xf00UL)                 /*!< BLE BLE_RADIOPWRUPDN_REG: TXPWRDN (Bitfield-Mask: 0x0f)     */
#define BLE_BLE_RADIOPWRUPDN_REG_RXPWRUP_Pos  (16UL)                    /*!< BLE BLE_RADIOPWRUPDN_REG: RXPWRUP (Bit 16)                  */
#define BLE_BLE_RADIOPWRUPDN_REG_RXPWRUP_Msk  (0xff0000UL)              /*!< BLE BLE_RADIOPWRUPDN_REG: RXPWRUP (Bitfield-Mask: 0xff)     */
#define BLE_BLE_RADIOPWRUPDN_REG_RTRIP_DELAY_Pos (24UL)                 /*!< BLE BLE_RADIOPWRUPDN_REG: RTRIP_DELAY (Bit 24)              */
#define BLE_BLE_RADIOPWRUPDN_REG_RTRIP_DELAY_Msk (0x7f000000UL)         /*!< BLE BLE_RADIOPWRUPDN_REG: RTRIP_DELAY (Bitfield-Mask: 0x7f) */

/* ----------------------------  BLE_BLE_ADVCHMAP_REG  ---------------------------- */
#define BLE_BLE_ADVCHMAP_REG_ADVCHMAP_Pos     (0UL)                     /*!< BLE BLE_ADVCHMAP_REG: ADVCHMAP (Bit 0)                      */
#define BLE_BLE_ADVCHMAP_REG_ADVCHMAP_Msk     (0x7UL)                   /*!< BLE BLE_ADVCHMAP_REG: ADVCHMAP (Bitfield-Mask: 0x07)        */

/* -----------------------------  BLE_BLE_ADVTIM_REG  ----------------------------- */
#define BLE_BLE_ADVTIM_REG_ADVINT_Pos         (0UL)                     /*!< BLE BLE_ADVTIM_REG: ADVINT (Bit 0)                          */
#define BLE_BLE_ADVTIM_REG_ADVINT_Msk         (0x3fffUL)                /*!< BLE BLE_ADVTIM_REG: ADVINT (Bitfield-Mask: 0x3fff)          */

/* ---------------------------  BLE_BLE_ACTSCANSTAT_REG  -------------------------- */
#define BLE_BLE_ACTSCANSTAT_REG_UPPERLIMIT_Pos (0UL)                    /*!< BLE BLE_ACTSCANSTAT_REG: UPPERLIMIT (Bit 0)                 */
#define BLE_BLE_ACTSCANSTAT_REG_UPPERLIMIT_Msk (0x1ffUL)                /*!< BLE BLE_ACTSCANSTAT_REG: UPPERLIMIT (Bitfield-Mask: 0x1ff)  */
#define BLE_BLE_ACTSCANSTAT_REG_BACKOFF_Pos   (16UL)                    /*!< BLE BLE_ACTSCANSTAT_REG: BACKOFF (Bit 16)                   */
#define BLE_BLE_ACTSCANSTAT_REG_BACKOFF_Msk   (0x1ff0000UL)             /*!< BLE BLE_ACTSCANSTAT_REG: BACKOFF (Bitfield-Mask: 0x1ff)     */

/* ---------------------------  BLE_BLE_WLPUBADDPTR_REG  -------------------------- */
#define BLE_BLE_WLPUBADDPTR_REG_WLPUBADDPTR_Pos (0UL)                   /*!< BLE BLE_WLPUBADDPTR_REG: WLPUBADDPTR (Bit 0)                */
#define BLE_BLE_WLPUBADDPTR_REG_WLPUBADDPTR_Msk (0xffffUL)              /*!< BLE BLE_WLPUBADDPTR_REG: WLPUBADDPTR (Bitfield-Mask: 0xffff) */

/* --------------------------  BLE_BLE_WLPRIVADDPTR_REG  -------------------------- */
#define BLE_BLE_WLPRIVADDPTR_REG_WLPRIVADDPTR_Pos (0UL)                 /*!< BLE BLE_WLPRIVADDPTR_REG: WLPRIVADDPTR (Bit 0)              */
#define BLE_BLE_WLPRIVADDPTR_REG_WLPRIVADDPTR_Msk (0xffffUL)            /*!< BLE BLE_WLPRIVADDPTR_REG: WLPRIVADDPTR (Bitfield-Mask: 0xffff) */

/* -----------------------------  BLE_BLE_WLNBDEV_REG  ---------------------------- */
#define BLE_BLE_WLNBDEV_REG_NBPUBDEV_Pos      (0UL)                     /*!< BLE BLE_WLNBDEV_REG: NBPUBDEV (Bit 0)                       */
#define BLE_BLE_WLNBDEV_REG_NBPUBDEV_Msk      (0xffUL)                  /*!< BLE BLE_WLNBDEV_REG: NBPUBDEV (Bitfield-Mask: 0xff)         */
#define BLE_BLE_WLNBDEV_REG_NBPRIVDEV_Pos     (8UL)                     /*!< BLE BLE_WLNBDEV_REG: NBPRIVDEV (Bit 8)                      */
#define BLE_BLE_WLNBDEV_REG_NBPRIVDEV_Msk     (0xff00UL)                /*!< BLE BLE_WLNBDEV_REG: NBPRIVDEV (Bitfield-Mask: 0xff)        */

/* -----------------------------  BLE_BLE_AESCNTL_REG  ---------------------------- */
#define BLE_BLE_AESCNTL_REG_AES_START_Pos     (0UL)                     /*!< BLE BLE_AESCNTL_REG: AES_START (Bit 0)                      */
#define BLE_BLE_AESCNTL_REG_AES_START_Msk     (0x1UL)                   /*!< BLE BLE_AESCNTL_REG: AES_START (Bitfield-Mask: 0x01)        */
#define BLE_BLE_AESCNTL_REG_AES_MODE_Pos      (1UL)                     /*!< BLE BLE_AESCNTL_REG: AES_MODE (Bit 1)                       */
#define BLE_BLE_AESCNTL_REG_AES_MODE_Msk      (0x2UL)                   /*!< BLE BLE_AESCNTL_REG: AES_MODE (Bitfield-Mask: 0x01)         */

/* ---------------------------  BLE_BLE_AESKEY31_0_REG  --------------------------- */
#define BLE_BLE_AESKEY31_0_REG_AESKEY31_0_Pos (0UL)                     /*!< BLE BLE_AESKEY31_0_REG: AESKEY31_0 (Bit 0)                  */
#define BLE_BLE_AESKEY31_0_REG_AESKEY31_0_Msk (0xffffffffUL)            /*!< BLE BLE_AESKEY31_0_REG: AESKEY31_0 (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  BLE_BLE_AESKEY63_32_REG  -------------------------- */
#define BLE_BLE_AESKEY63_32_REG_AESKEY63_32_Pos (0UL)                   /*!< BLE BLE_AESKEY63_32_REG: AESKEY63_32 (Bit 0)                */
#define BLE_BLE_AESKEY63_32_REG_AESKEY63_32_Msk (0xffffffffUL)          /*!< BLE BLE_AESKEY63_32_REG: AESKEY63_32 (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  BLE_BLE_AESKEY95_64_REG  -------------------------- */
#define BLE_BLE_AESKEY95_64_REG_AESKEY95_64_Pos (0UL)                   /*!< BLE BLE_AESKEY95_64_REG: AESKEY95_64 (Bit 0)                */
#define BLE_BLE_AESKEY95_64_REG_AESKEY95_64_Msk (0xffffffffUL)          /*!< BLE BLE_AESKEY95_64_REG: AESKEY95_64 (Bitfield-Mask: 0xffffffff) */

/* --------------------------  BLE_BLE_AESKEY127_96_REG  -------------------------- */
#define BLE_BLE_AESKEY127_96_REG_AESKEY127_96_Pos (0UL)                 /*!< BLE BLE_AESKEY127_96_REG: AESKEY127_96 (Bit 0)              */
#define BLE_BLE_AESKEY127_96_REG_AESKEY127_96_Msk (0xffffffffUL)        /*!< BLE BLE_AESKEY127_96_REG: AESKEY127_96 (Bitfield-Mask: 0xffffffff) */

/* -----------------------------  BLE_BLE_AESPTR_REG  ----------------------------- */
#define BLE_BLE_AESPTR_REG_AESPTR_Pos         (0UL)                     /*!< BLE BLE_AESPTR_REG: AESPTR (Bit 0)                          */
#define BLE_BLE_AESPTR_REG_AESPTR_Msk         (0xffffUL)                /*!< BLE BLE_AESPTR_REG: AESPTR (Bitfield-Mask: 0xffff)          */

/* ----------------------------  BLE_BLE_TXMICVAL_REG  ---------------------------- */
#define BLE_BLE_TXMICVAL_REG_TXMICVAL_Pos     (0UL)                     /*!< BLE BLE_TXMICVAL_REG: TXMICVAL (Bit 0)                      */
#define BLE_BLE_TXMICVAL_REG_TXMICVAL_Msk     (0xffffffffUL)            /*!< BLE BLE_TXMICVAL_REG: TXMICVAL (Bitfield-Mask: 0xffffffff)  */

/* ----------------------------  BLE_BLE_RXMICVAL_REG  ---------------------------- */
#define BLE_BLE_RXMICVAL_REG_RXMICVAL_Pos     (0UL)                     /*!< BLE BLE_RXMICVAL_REG: RXMICVAL (Bit 0)                      */
#define BLE_BLE_RXMICVAL_REG_RXMICVAL_Msk     (0xffffffffUL)            /*!< BLE BLE_RXMICVAL_REG: RXMICVAL (Bitfield-Mask: 0xffffffff)  */

/* ---------------------------  BLE_BLE_RFTESTCNTL_REG  --------------------------- */
#define BLE_BLE_RFTESTCNTL_REG_TXLENGTH_Pos   (0UL)                     /*!< BLE BLE_RFTESTCNTL_REG: TXLENGTH (Bit 0)                    */
#define BLE_BLE_RFTESTCNTL_REG_TXLENGTH_Msk   (0x1ffUL)                 /*!< BLE BLE_RFTESTCNTL_REG: TXLENGTH (Bitfield-Mask: 0x1ff)     */
#define BLE_BLE_RFTESTCNTL_REG_TXPKTCNTEN_Pos (11UL)                    /*!< BLE BLE_RFTESTCNTL_REG: TXPKTCNTEN (Bit 11)                 */
#define BLE_BLE_RFTESTCNTL_REG_TXPKTCNTEN_Msk (0x800UL)                 /*!< BLE BLE_RFTESTCNTL_REG: TXPKTCNTEN (Bitfield-Mask: 0x01)    */
#define BLE_BLE_RFTESTCNTL_REG_TXPLDSRC_Pos   (12UL)                    /*!< BLE BLE_RFTESTCNTL_REG: TXPLDSRC (Bit 12)                   */
#define BLE_BLE_RFTESTCNTL_REG_TXPLDSRC_Msk   (0x1000UL)                /*!< BLE BLE_RFTESTCNTL_REG: TXPLDSRC (Bitfield-Mask: 0x01)      */
#define BLE_BLE_RFTESTCNTL_REG_PRBSTYPE_Pos   (13UL)                    /*!< BLE BLE_RFTESTCNTL_REG: PRBSTYPE (Bit 13)                   */
#define BLE_BLE_RFTESTCNTL_REG_PRBSTYPE_Msk   (0x2000UL)                /*!< BLE BLE_RFTESTCNTL_REG: PRBSTYPE (Bitfield-Mask: 0x01)      */
#define BLE_BLE_RFTESTCNTL_REG_TXLENGTHSRC_Pos (14UL)                   /*!< BLE BLE_RFTESTCNTL_REG: TXLENGTHSRC (Bit 14)                */
#define BLE_BLE_RFTESTCNTL_REG_TXLENGTHSRC_Msk (0x4000UL)               /*!< BLE BLE_RFTESTCNTL_REG: TXLENGTHSRC (Bitfield-Mask: 0x01)   */
#define BLE_BLE_RFTESTCNTL_REG_INFINITETX_Pos (15UL)                    /*!< BLE BLE_RFTESTCNTL_REG: INFINITETX (Bit 15)                 */
#define BLE_BLE_RFTESTCNTL_REG_INFINITETX_Msk (0x8000UL)                /*!< BLE BLE_RFTESTCNTL_REG: INFINITETX (Bitfield-Mask: 0x01)    */
#define BLE_BLE_RFTESTCNTL_REG_RXPKTCNTEN_Pos (27UL)                    /*!< BLE BLE_RFTESTCNTL_REG: RXPKTCNTEN (Bit 27)                 */
#define BLE_BLE_RFTESTCNTL_REG_RXPKTCNTEN_Msk (0x8000000UL)             /*!< BLE BLE_RFTESTCNTL_REG: RXPKTCNTEN (Bitfield-Mask: 0x01)    */
#define BLE_BLE_RFTESTCNTL_REG_INFINITERX_Pos (31UL)                    /*!< BLE BLE_RFTESTCNTL_REG: INFINITERX (Bit 31)                 */
#define BLE_BLE_RFTESTCNTL_REG_INFINITERX_Msk (0x80000000UL)            /*!< BLE BLE_RFTESTCNTL_REG: INFINITERX (Bitfield-Mask: 0x01)    */

/* --------------------------  BLE_BLE_RFTESTTXSTAT_REG  -------------------------- */
#define BLE_BLE_RFTESTTXSTAT_REG_TXPKTCNT_Pos (0UL)                     /*!< BLE BLE_RFTESTTXSTAT_REG: TXPKTCNT (Bit 0)                  */
#define BLE_BLE_RFTESTTXSTAT_REG_TXPKTCNT_Msk (0xffffffffUL)            /*!< BLE BLE_RFTESTTXSTAT_REG: TXPKTCNT (Bitfield-Mask: 0xffffffff) */

