openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* -----------------------------  COEX_COEX_STAT_REG  ----------------------------- */
#define COEX_COEX_STAT_REG_COEX_DECISION_PTR_Pos (0UL)                  /*!< COEX COEX_STAT_REG: COEX_DECISION_PTR (Bit 0)               */
#define COEX_COEX_STAT_REG_COEX_DECISION_PTR_Msk (0x1fUL)               /*!< COEX COEX_STAT_REG: COEX_DECISION_PTR (Bitfield-Mask: 0x1f) */
#define COEX_COEX_STAT_REG_COEX_DECISION_Pos  (5UL)                     /*!< COEX COEX_STAT_REG: COEX_DECISION (Bit 5)                   */
#define COEX_COEX_STAT_REG_COEX_DECISION_Msk  (0x60UL)                  /*!< COEX COEX_STAT_REG: COEX_DECISION (Bitfield-Mask: 0x03)     */
#define COEX_COEX_STAT_REG_COEX_DECISION_CLOSING_Pos (7UL)              /*!< COEX COEX_STAT_REG: COEX_DECISION_CLOSING (Bit 7)           */
#define COEX_COEX_STAT_REG_COEX_DECISION_CLOSING_Msk (0x80UL)           /*!< COEX COEX_STAT_REG: COEX_DECISION_CLOSING (Bitfield-Mask: 0x01) */
#define COEX_COEX_STAT_REG_SMART_ACT_Pos      (8UL)                     /*!< COEX COEX_STAT_REG: SMART_ACT (Bit 8)                       */
#define COEX_COEX_STAT_REG_SMART_ACT_Msk      (0x100UL)                 /*!< COEX COEX_STAT_REG: SMART_ACT (Bitfield-Mask: 0x01)         */
#define COEX_COEX_STAT_REG_SMART_PRI_Pos      (9UL)                     /*!< COEX COEX_STAT_REG: SMART_PRI (Bit 9)                       */
#define COEX_COEX_STAT_REG_SMART_PRI_Msk      (0x200UL)                 /*!< COEX COEX_STAT_REG: SMART_PRI (Bitfield-Mask: 0x01)         */
#define COEX_COEX_STAT_REG_EXT_ACT0_Pos       (10UL)                    /*!< COEX COEX_STAT_REG: EXT_ACT0 (Bit 10)                       */
#define COEX_COEX_STAT_REG_EXT_ACT0_Msk       (0x400UL)                 /*!< COEX COEX_STAT_REG: EXT_ACT0 (Bitfield-Mask: 0x01)          */
#define COEX_COEX_STAT_REG_EXT_ACT1_Pos       (11UL)                    /*!< COEX COEX_STAT_REG: EXT_ACT1 (Bit 11)                       */
#define COEX_COEX_STAT_REG_EXT_ACT1_Msk       (0x800UL)                 /*!< COEX COEX_STAT_REG: EXT_ACT1 (Bitfield-Mask: 0x01)          */
#define COEX_COEX_STAT_REG_COEX_RADIO_BUSY_Pos (12UL)                   /*!< COEX COEX_STAT_REG: COEX_RADIO_BUSY (Bit 12)                */
#define COEX_COEX_STAT_REG_COEX_RADIO_BUSY_Msk (0x1000UL)               /*!< COEX COEX_STAT_REG: COEX_RADIO_BUSY (Bitfield-Mask: 0x01)   */
#define COEX_COEX_STAT_REG_IGNORE_EXT_STAT_Pos (13UL)                   /*!< COEX COEX_STAT_REG: IGNORE_EXT_STAT (Bit 13)                */
#define COEX_COEX_STAT_REG_IGNORE_EXT_STAT_Msk (0x2000UL)               /*!< COEX COEX_STAT_REG: IGNORE_EXT_STAT (Bitfield-Mask: 0x01)   */
#define COEX_COEX_STAT_REG_IGNORE_FTDF_STAT_Pos (14UL)                  /*!< COEX COEX_STAT_REG: IGNORE_FTDF_STAT (Bit 14)               */
#define COEX_COEX_STAT_REG_IGNORE_FTDF_STAT_Msk (0x4000UL)              /*!< COEX COEX_STAT_REG: IGNORE_FTDF_STAT (Bitfield-Mask: 0x01)  */
#define COEX_COEX_STAT_REG_IGNORE_BLE_STAT_Pos (15UL)                   /*!< COEX COEX_STAT_REG: IGNORE_BLE_STAT (Bit 15)                */
#define COEX_COEX_STAT_REG_IGNORE_BLE_STAT_Msk (0x8000UL)               /*!< COEX COEX_STAT_REG: IGNORE_BLE_STAT (Bitfield-Mask: 0x01)   */

/* ---------------------------  COEX_COEX_INT_MASK_REG  --------------------------- */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_MASK_Pos (0UL)                  /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_MASK (Bit 0)               */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_MASK_Msk (0x1UL)                /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_MASK (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_SMART_ACT_R_Pos (1UL)        /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_SMART_ACT_R (Bit 1)     */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_SMART_ACT_R_Msk (0x2UL)      /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_SMART_ACT_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_SMART_ACT_F_Pos (2UL)        /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_SMART_ACT_F (Bit 2)     */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_SMART_ACT_F_Msk (0x4UL)      /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_SMART_ACT_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_SMART_PRI_R_Pos (3UL)        /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_SMART_PRI_R (Bit 3)     */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_SMART_PRI_R_Msk (0x8UL)      /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_SMART_PRI_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_SMART_PRI_F_Pos (4UL)        /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_SMART_PRI_F (Bit 4)     */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_SMART_PRI_F_Msk (0x10UL)     /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_SMART_PRI_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_EXT_ACT_R_Pos (5UL)          /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_EXT_ACT_R (Bit 5)       */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_EXT_ACT_R_Msk (0x20UL)       /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_EXT_ACT_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_EXT_ACT_F_Pos (6UL)          /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_EXT_ACT_F (Bit 6)       */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_EXT_ACT_F_Msk (0x40UL)       /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_EXT_ACT_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_FTDF_ACTIVE_R_Pos (7UL)      /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_FTDF_ACTIVE_R (Bit 7)   */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_FTDF_ACTIVE_R_Msk (0x80UL)   /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_FTDF_ACTIVE_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_FTDF_ACTIVE_F_Pos (8UL)      /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_FTDF_ACTIVE_F (Bit 8)   */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_FTDF_ACTIVE_F_Msk (0x100UL)  /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_FTDF_ACTIVE_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_BLE_ACTIVE_R_Pos (9UL)       /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_BLE_ACTIVE_R (Bit 9)    */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_BLE_ACTIVE_R_Msk (0x200UL)   /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_BLE_ACTIVE_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_BLE_ACTIVE_F_Pos (10UL)      /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_BLE_ACTIVE_F (Bit 10)   */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_BLE_ACTIVE_F_Msk (0x400UL)   /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_BLE_ACTIVE_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_RADIO_BUSY_R_Pos (11UL)      /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_RADIO_BUSY_R (Bit 11)   */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_RADIO_BUSY_R_Msk (0x800UL)   /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_RADIO_BUSY_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_RADIO_BUSY_F_Pos (12UL)      /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_RADIO_BUSY_F (Bit 12)   */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_RADIO_BUSY_F_Msk (0x1000UL)  /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_RADIO_BUSY_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_CLOSING_BRK_Pos (13UL)       /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_CLOSING_BRK (Bit 13)    */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_CLOSING_BRK_Msk (0x2000UL)   /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_CLOSING_BRK (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_START_MID_Pos (14UL)         /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_START_MID (Bit 14)      */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_START_MID_Msk (0x4000UL)     /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_START_MID (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_DECISION_SW_Pos (15UL)       /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_DECISION_SW (Bit 15)    */
#define COEX_COEX_INT_MASK_REG_COEX_IRQ_ON_DECISION_SW_Msk (0x8000UL)   /*!< COEX COEX_INT_MASK_REG: COEX_IRQ_ON_DECISION_SW (Bitfield-Mask: 0x01) */

/* ---------------------------  COEX_COEX_INT_STAT_REG  --------------------------- */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_STAT_Pos (0UL)                  /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_STAT (Bit 0)               */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_STAT_Msk (0x1UL)                /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_STAT (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_SMART_ACT_R_Pos (1UL)        /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_SMART_ACT_R (Bit 1)     */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_SMART_ACT_R_Msk (0x2UL)      /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_SMART_ACT_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_SMART_ACT_F_Pos (2UL)        /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_SMART_ACT_F (Bit 2)     */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_SMART_ACT_F_Msk (0x4UL)      /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_SMART_ACT_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_SMART_PRI_R_Pos (3UL)        /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_SMART_PRI_R (Bit 3)     */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_SMART_PRI_R_Msk (0x8UL)      /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_SMART_PRI_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_SMART_PRI_F_Pos (4UL)        /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_SMART_PRI_F (Bit 4)     */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_SMART_PRI_F_Msk (0x10UL)     /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_SMART_PRI_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_EXT_ACT_R_Pos (5UL)          /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_EXT_ACT_R (Bit 5)       */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_EXT_ACT_R_Msk (0x20UL)       /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_EXT_ACT_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_EXT_ACT_F_Pos (6UL)          /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_EXT_ACT_F (Bit 6)       */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_EXT_ACT_F_Msk (0x40UL)       /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_EXT_ACT_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_FTDF_ACTIVE_R_Pos (7UL)      /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_FTDF_ACTIVE_R (Bit 7)   */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_FTDF_ACTIVE_R_Msk (0x80UL)   /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_FTDF_ACTIVE_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_FTDF_ACTIVE_F_Pos (8UL)      /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_FTDF_ACTIVE_F (Bit 8)   */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_FTDF_ACTIVE_F_Msk (0x100UL)  /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_FTDF_ACTIVE_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_BLE_ACTIVE_R_Pos (9UL)       /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_BLE_ACTIVE_R (Bit 9)    */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_BLE_ACTIVE_R_Msk (0x200UL)   /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_BLE_ACTIVE_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_BLE_ACTIVE_F_Pos (10UL)      /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_BLE_ACTIVE_F (Bit 10)   */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_BLE_ACTIVE_F_Msk (0x400UL)   /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_BLE_ACTIVE_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_RADIO_BUSY_R_Pos (11UL)      /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_RADIO_BUSY_R (Bit 11)   */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_RADIO_BUSY_R_Msk (0x800UL)   /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_RADIO_BUSY_R (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_RADIO_BUSY_F_Pos (12UL)      /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_RADIO_BUSY_F (Bit 12)   */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_RADIO_BUSY_F_Msk (0x1000UL)  /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_RADIO_BUSY_F (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_CLOSING_BRK_Pos (13UL)       /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_CLOSING_BRK (Bit 13)    */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_CLOSING_BRK_Msk (0x2000UL)   /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_CLOSING_BRK (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_START_MID_Pos (14UL)         /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_START_MID (Bit 14)      */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_START_MID_Msk (0x4000UL)     /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_START_MID (Bitfield-Mask: 0x01) */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_DECISION_SW_Pos (15UL)       /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_DECISION_SW (Bit 15)    */
#define COEX_COEX_INT_STAT_REG_COEX_IRQ_ON_DECISION_SW_Msk (0x8000UL)   /*!< COEX COEX_INT_STAT_REG: COEX_IRQ_ON_DECISION_SW (Bitfield-Mask: 0x01) */

/* ----------------------------  COEX_COEX_BLE_PTI_REG  --------------------------- */
#define COEX_COEX_BLE_PTI_REG_COEX_BLE_PTI_Pos (0UL)                    /*!< COEX COEX_BLE_PTI_REG: COEX_BLE_PTI (Bit 0)                 */
#define COEX_COEX_BLE_PTI_REG_COEX_BLE_PTI_Msk (0x7UL)                  /*!< COEX COEX_BLE_PTI_REG: COEX_BLE_PTI (Bitfield-Mask: 0x07)   */

/* ---------------------------  COEX_COEX_FTDF_PTI_REG  --------------------------- */
#define COEX_COEX_FTDF_PTI_REG_COEX_FTDF_PTI_Pos (0UL)                  /*!< COEX COEX_FTDF_PTI_REG: COEX_FTDF_PTI (Bit 0)               */
#define COEX_COEX_FTDF_PTI_REG_COEX_FTDF_PTI_Msk (0x7UL)                /*!< COEX COEX_FTDF_PTI_REG: COEX_FTDF_PTI (Bitfield-Mask: 0x07) */

