openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* ---------------------------  CRG_TOP_CLK_RCX20K_REG  --------------------------- */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_TRIM_Pos (0UL)                    /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_TRIM (Bit 0)                 */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_TRIM_Msk (0xfUL)                  /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_TRIM (Bitfield-Mask: 0x0f)   */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_NTC_Pos (4UL)                     /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_NTC (Bit 4)                  */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_NTC_Msk (0xf0UL)                  /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_NTC (Bitfield-Mask: 0x0f)    */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_BIAS_Pos (8UL)                    /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_BIAS (Bit 8)                 */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_BIAS_Msk (0x300UL)                /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_BIAS (Bitfield-Mask: 0x03)   */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_LOWF_Pos (10UL)                   /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_LOWF (Bit 10)                */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_LOWF_Msk (0x400UL)                /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_LOWF (Bitfield-Mask: 0x01)   */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_ENABLE_Pos (11UL)                 /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_ENABLE (Bit 11)              */
#define CRG_TOP_CLK_RCX20K_REG_RCX20K_ENABLE_Msk (0x800UL)              /*!< CRG_TOP CLK_RCX20K_REG: RCX20K_ENABLE (Bitfield-Mask: 0x01) */

/* -----------------------------  CRG_TOP_BANDGAP_REG  ---------------------------- */
#define CRG_TOP_BANDGAP_REG_BGR_TRIM_Pos      (0UL)                     /*!< CRG_TOP BANDGAP_REG: BGR_TRIM (Bit 0)                       */
#define CRG_TOP_BANDGAP_REG_BGR_TRIM_Msk      (0x1fUL)                  /*!< CRG_TOP BANDGAP_REG: BGR_TRIM (Bitfield-Mask: 0x1f)         */
#define CRG_TOP_BANDGAP_REG_BGR_ITRIM_Pos     (5UL)                     /*!< CRG_TOP BANDGAP_REG: BGR_ITRIM (Bit 5)                      */
#define CRG_TOP_BANDGAP_REG_BGR_ITRIM_Msk     (0x3e0UL)                 /*!< CRG_TOP BANDGAP_REG: BGR_ITRIM (Bitfield-Mask: 0x1f)        */
#define CRG_TOP_BANDGAP_REG_LDO_SLEEP_TRIM_Pos (10UL)                   /*!< CRG_TOP BANDGAP_REG: LDO_SLEEP_TRIM (Bit 10)                */
#define CRG_TOP_BANDGAP_REG_LDO_SLEEP_TRIM_Msk (0x3c00UL)               /*!< CRG_TOP BANDGAP_REG: LDO_SLEEP_TRIM (Bitfield-Mask: 0x0f)   */
#define CRG_TOP_BANDGAP_REG_BYPASS_COLD_BOOT_DISABLE_Pos (14UL)         /*!< CRG_TOP BANDGAP_REG: BYPASS_COLD_BOOT_DISABLE (Bit 14)      */
#define CRG_TOP_BANDGAP_REG_BYPASS_COLD_BOOT_DISABLE_Msk (0x4000UL)     /*!< CRG_TOP BANDGAP_REG: BYPASS_COLD_BOOT_DISABLE (Bitfield-Mask: 0x01) */

/* ---------------------------  CRG_TOP_ANA_STATUS_REG  --------------------------- */
#define CRG_TOP_ANA_STATUS_REG_LDO_RADIO_OK_Pos (0UL)                   /*!< CRG_TOP ANA_STATUS_REG: LDO_RADIO_OK (Bit 0)                */
#define CRG_TOP_ANA_STATUS_REG_LDO_RADIO_OK_Msk (0x1UL)                 /*!< CRG_TOP ANA_STATUS_REG: LDO_RADIO_OK (Bitfield-Mask: 0x01)  */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBAT_OK_Pos (1UL)                   /*!< CRG_TOP ANA_STATUS_REG: COMP_VBAT_OK (Bit 1)                */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBAT_OK_Msk (0x2UL)                 /*!< CRG_TOP ANA_STATUS_REG: COMP_VBAT_OK (Bitfield-Mask: 0x01)  */
#define CRG_TOP_ANA_STATUS_REG_VBUS_AVAILABLE_Pos (2UL)                 /*!< CRG_TOP ANA_STATUS_REG: VBUS_AVAILABLE (Bit 2)              */
#define CRG_TOP_ANA_STATUS_REG_VBUS_AVAILABLE_Msk (0x4UL)               /*!< CRG_TOP ANA_STATUS_REG: VBUS_AVAILABLE (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_NEWBAT_Pos     (3UL)                     /*!< CRG_TOP ANA_STATUS_REG: NEWBAT (Bit 3)                      */
#define CRG_TOP_ANA_STATUS_REG_NEWBAT_Msk     (0x8UL)                   /*!< CRG_TOP ANA_STATUS_REG: NEWBAT (Bitfield-Mask: 0x01)        */
#define CRG_TOP_ANA_STATUS_REG_LDO_SUPPLY_VBAT_OK_Pos (4UL)             /*!< CRG_TOP ANA_STATUS_REG: LDO_SUPPLY_VBAT_OK (Bit 4)          */
#define CRG_TOP_ANA_STATUS_REG_LDO_SUPPLY_VBAT_OK_Msk (0x10UL)          /*!< CRG_TOP ANA_STATUS_REG: LDO_SUPPLY_VBAT_OK (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_LDO_SUPPLY_USB_OK_Pos (5UL)              /*!< CRG_TOP ANA_STATUS_REG: LDO_SUPPLY_USB_OK (Bit 5)           */
#define CRG_TOP_ANA_STATUS_REG_LDO_SUPPLY_USB_OK_Msk (0x20UL)           /*!< CRG_TOP ANA_STATUS_REG: LDO_SUPPLY_USB_OK (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_BANDGAP_OK_Pos (6UL)                     /*!< CRG_TOP ANA_STATUS_REG: BANDGAP_OK (Bit 6)                  */
#define CRG_TOP_ANA_STATUS_REG_BANDGAP_OK_Msk (0x40UL)                  /*!< CRG_TOP ANA_STATUS_REG: BANDGAP_OK (Bitfield-Mask: 0x01)    */
#define CRG_TOP_ANA_STATUS_REG_COMP_VDD_HIGH_Pos (7UL)                  /*!< CRG_TOP ANA_STATUS_REG: COMP_VDD_HIGH (Bit 7)               */
#define CRG_TOP_ANA_STATUS_REG_COMP_VDD_HIGH_Msk (0x80UL)               /*!< CRG_TOP ANA_STATUS_REG: COMP_VDD_HIGH (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_LDO_CORE_OK_Pos (8UL)                    /*!< CRG_TOP ANA_STATUS_REG: LDO_CORE_OK (Bit 8)                 */
#define CRG_TOP_ANA_STATUS_REG_LDO_CORE_OK_Msk (0x100UL)                /*!< CRG_TOP ANA_STATUS_REG: LDO_CORE_OK (Bitfield-Mask: 0x01)   */
#define CRG_TOP_ANA_STATUS_REG_LDO_1V8_PA_OK_Pos (9UL)                  /*!< CRG_TOP ANA_STATUS_REG: LDO_1V8_PA_OK (Bit 9)               */
#define CRG_TOP_ANA_STATUS_REG_LDO_1V8_PA_OK_Msk (0x200UL)              /*!< CRG_TOP ANA_STATUS_REG: LDO_1V8_PA_OK (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_LDO_1V8_FLASH_OK_Pos (10UL)              /*!< CRG_TOP ANA_STATUS_REG: LDO_1V8_FLASH_OK (Bit 10)           */
#define CRG_TOP_ANA_STATUS_REG_LDO_1V8_FLASH_OK_Msk (0x400UL)           /*!< CRG_TOP ANA_STATUS_REG: LDO_1V8_FLASH_OK (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBUS_HIGH_Pos (11UL)                /*!< CRG_TOP ANA_STATUS_REG: COMP_VBUS_HIGH (Bit 11)             */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBUS_HIGH_Msk (0x800UL)             /*!< CRG_TOP ANA_STATUS_REG: COMP_VBUS_HIGH (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBUS_LOW_Pos (12UL)                 /*!< CRG_TOP ANA_STATUS_REG: COMP_VBUS_LOW (Bit 12)              */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBUS_LOW_Msk (0x1000UL)             /*!< CRG_TOP ANA_STATUS_REG: COMP_VBUS_LOW (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_COMP_V33_HIGH_Pos (13UL)                 /*!< CRG_TOP ANA_STATUS_REG: COMP_V33_HIGH (Bit 13)              */
#define CRG_TOP_ANA_STATUS_REG_COMP_V33_HIGH_Msk (0x2000UL)             /*!< CRG_TOP ANA_STATUS_REG: COMP_V33_HIGH (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_COMP_1V8_FLASH_HIGH_Pos (14UL)           /*!< CRG_TOP ANA_STATUS_REG: COMP_1V8_FLASH_HIGH (Bit 14)        */
#define CRG_TOP_ANA_STATUS_REG_COMP_1V8_FLASH_HIGH_Msk (0x4000UL)       /*!< CRG_TOP ANA_STATUS_REG: COMP_1V8_FLASH_HIGH (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_COMP_1V8_PA_HIGH_Pos (15UL)              /*!< CRG_TOP ANA_STATUS_REG: COMP_1V8_PA_HIGH (Bit 15)           */
#define CRG_TOP_ANA_STATUS_REG_COMP_1V8_PA_HIGH_Msk (0x8000UL)          /*!< CRG_TOP ANA_STATUS_REG: COMP_1V8_PA_HIGH (Bitfield-Mask: 0x01) */

