openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* ----------------------------  DCDC_DCDC_TRIM_3_REG  ---------------------------- */
#define DCDC_DCDC_TRIM_3_REG_DCDC_V18P_TRIM_N_Pos (0UL)                 /*!< DCDC DCDC_TRIM_3_REG: DCDC_V18P_TRIM_N (Bit 0)              */
#define DCDC_DCDC_TRIM_3_REG_DCDC_V18P_TRIM_N_Msk (0x3fUL)              /*!< DCDC DCDC_TRIM_3_REG: DCDC_V18P_TRIM_N (Bitfield-Mask: 0x3f) */
#define DCDC_DCDC_TRIM_3_REG_DCDC_V18P_TRIM_P_Pos (6UL)                 /*!< DCDC DCDC_TRIM_3_REG: DCDC_V18P_TRIM_P (Bit 6)              */
#define DCDC_DCDC_TRIM_3_REG_DCDC_V18P_TRIM_P_Msk (0xfc0UL)             /*!< DCDC DCDC_TRIM_3_REG: DCDC_V18P_TRIM_P (Bitfield-Mask: 0x3f) */

/* --------------------------  DCDC_DCDC_IRQ_STATUS_REG  -------------------------- */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_V14_TIMEOUT_IRQ_STATUS_Pos (0UL)  /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_V14_TIMEOUT_IRQ_STATUS (Bit 0) */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_V14_TIMEOUT_IRQ_STATUS_Msk (0x1UL) /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_V14_TIMEOUT_IRQ_STATUS (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_V18_TIMEOUT_IRQ_STATUS_Pos (1UL)  /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_V18_TIMEOUT_IRQ_STATUS (Bit 1) */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_V18_TIMEOUT_IRQ_STATUS_Msk (0x2UL) /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_V18_TIMEOUT_IRQ_STATUS (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_VDD_TIMEOUT_IRQ_STATUS_Pos (2UL)  /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_VDD_TIMEOUT_IRQ_STATUS (Bit 2) */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_VDD_TIMEOUT_IRQ_STATUS_Msk (0x4UL) /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_VDD_TIMEOUT_IRQ_STATUS (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_V18P_TIMEOUT_IRQ_STATUS_Pos (3UL) /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_V18P_TIMEOUT_IRQ_STATUS (Bit 3) */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_V18P_TIMEOUT_IRQ_STATUS_Msk (0x8UL) /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_V18P_TIMEOUT_IRQ_STATUS (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_BROWN_OUT_IRQ_STATUS_Pos (4UL)    /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_BROWN_OUT_IRQ_STATUS (Bit 4) */
#define DCDC_DCDC_IRQ_STATUS_REG_DCDC_BROWN_OUT_IRQ_STATUS_Msk (0x10UL) /*!< DCDC DCDC_IRQ_STATUS_REG: DCDC_BROWN_OUT_IRQ_STATUS (Bitfield-Mask: 0x01) */

/* ---------------------------  DCDC_DCDC_IRQ_CLEAR_REG  -------------------------- */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_V14_TIMEOUT_IRQ_CLEAR_Pos (0UL)    /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_V14_TIMEOUT_IRQ_CLEAR (Bit 0) */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_V14_TIMEOUT_IRQ_CLEAR_Msk (0x1UL)  /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_V14_TIMEOUT_IRQ_CLEAR (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_V18_TIMEOUT_IRQ_CLEAR_Pos (1UL)    /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_V18_TIMEOUT_IRQ_CLEAR (Bit 1) */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_V18_TIMEOUT_IRQ_CLEAR_Msk (0x2UL)  /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_V18_TIMEOUT_IRQ_CLEAR (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_VDD_TIMEOUT_IRQ_CLEAR_Pos (2UL)    /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_VDD_TIMEOUT_IRQ_CLEAR (Bit 2) */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_VDD_TIMEOUT_IRQ_CLEAR_Msk (0x4UL)  /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_VDD_TIMEOUT_IRQ_CLEAR (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_V18P_TIMEOUT_IRQ_CLEAR_Pos (3UL)   /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_V18P_TIMEOUT_IRQ_CLEAR (Bit 3) */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_V18P_TIMEOUT_IRQ_CLEAR_Msk (0x8UL) /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_V18P_TIMEOUT_IRQ_CLEAR (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_BROWN_OUT_IRQ_CLEAR_Pos (4UL)      /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_BROWN_OUT_IRQ_CLEAR (Bit 4)   */
#define DCDC_DCDC_IRQ_CLEAR_REG_DCDC_BROWN_OUT_IRQ_CLEAR_Msk (0x10UL)   /*!< DCDC DCDC_IRQ_CLEAR_REG: DCDC_BROWN_OUT_IRQ_CLEAR (Bitfield-Mask: 0x01) */

/* ---------------------------  DCDC_DCDC_IRQ_MASK_REG  --------------------------- */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_V14_TIMEOUT_IRQ_MASK_Pos (0UL)      /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_V14_TIMEOUT_IRQ_MASK (Bit 0)   */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_V14_TIMEOUT_IRQ_MASK_Msk (0x1UL)    /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_V14_TIMEOUT_IRQ_MASK (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_V18_TIMEOUT_IRQ_MASK_Pos (1UL)      /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_V18_TIMEOUT_IRQ_MASK (Bit 1)   */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_V18_TIMEOUT_IRQ_MASK_Msk (0x2UL)    /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_V18_TIMEOUT_IRQ_MASK (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_VDD_TIMEOUT_IRQ_MASK_Pos (2UL)      /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_VDD_TIMEOUT_IRQ_MASK (Bit 2)   */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_VDD_TIMEOUT_IRQ_MASK_Msk (0x4UL)    /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_VDD_TIMEOUT_IRQ_MASK (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_V18P_TIMEOUT_IRQ_MASK_Pos (3UL)     /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_V18P_TIMEOUT_IRQ_MASK (Bit 3)  */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_V18P_TIMEOUT_IRQ_MASK_Msk (0x8UL)   /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_V18P_TIMEOUT_IRQ_MASK (Bitfield-Mask: 0x01) */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_BROWN_OUT_IRQ_MASK_Pos (4UL)        /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_BROWN_OUT_IRQ_MASK (Bit 4)     */
#define DCDC_DCDC_IRQ_MASK_REG_DCDC_BROWN_OUT_IRQ_MASK_Msk (0x10UL)     /*!< DCDC DCDC_IRQ_MASK_REG: DCDC_BROWN_OUT_IRQ_MASK (Bitfield-Mask: 0x01) */


/* ================================================================================ */
/* ================          struct 'DEM' Position & Mask          ================ */
/* ================================================================================ */


/* -----------------------------  DEM_RF_DEM_CTRL_REG  ---------------------------- */
#define DEM_RF_DEM_CTRL_REG_RXDATA_INV_Pos    (0UL)                     /*!< DEM RF_DEM_CTRL_REG: RXDATA_INV (Bit 0)                     */
#define DEM_RF_DEM_CTRL_REG_RXDATA_INV_Msk    (0x1UL)                   /*!< DEM RF_DEM_CTRL_REG: RXDATA_INV (Bitfield-Mask: 0x01)       */
#define DEM_RF_DEM_CTRL_REG_DEM_HSI_POL_Pos   (1UL)                     /*!< DEM RF_DEM_CTRL_REG: DEM_HSI_POL (Bit 1)                    */
#define DEM_RF_DEM_CTRL_REG_DEM_HSI_POL_Msk   (0x2UL)                   /*!< DEM RF_DEM_CTRL_REG: DEM_HSI_POL (Bitfield-Mask: 0x01)      */
#define DEM_RF_DEM_CTRL_REG_MATCH0101_TH_Pos  (2UL)                     /*!< DEM RF_DEM_CTRL_REG: MATCH0101_TH (Bit 2)                   */
#define DEM_RF_DEM_CTRL_REG_MATCH0101_TH_Msk  (0x3cUL)                  /*!< DEM RF_DEM_CTRL_REG: MATCH0101_TH (Bitfield-Mask: 0x0f)     */
#define DEM_RF_DEM_CTRL_REG_EQUAL_EN_Pos      (6UL)                     /*!< DEM RF_DEM_CTRL_REG: EQUAL_EN (Bit 6)                       */
#define DEM_RF_DEM_CTRL_REG_EQUAL_EN_Msk      (0x40UL)                  /*!< DEM RF_DEM_CTRL_REG: EQUAL_EN (Bitfield-Mask: 0x01)         */
#define DEM_RF_DEM_CTRL_REG_BLE_DDC_EN_Pos    (7UL)                     /*!< DEM RF_DEM_CTRL_REG: BLE_DDC_EN (Bit 7)                     */
#define DEM_RF_DEM_CTRL_REG_BLE_DDC_EN_Msk    (0x80UL)                  /*!< DEM RF_DEM_CTRL_REG: BLE_DDC_EN (Bitfield-Mask: 0x01)       */
#define DEM_RF_DEM_CTRL_REG_IQCORR_EN_Pos     (8UL)                     /*!< DEM RF_DEM_CTRL_REG: IQCORR_EN (Bit 8)                      */
#define DEM_RF_DEM_CTRL_REG_IQCORR_EN_Msk     (0x100UL)                 /*!< DEM RF_DEM_CTRL_REG: IQCORR_EN (Bitfield-Mask: 0x01)        */

/* ----------------------------  DEM_RF_AGC_LUT_01_REG  --------------------------- */
#define DEM_RF_AGC_LUT_01_REG_VGA2_GAIN0_Pos  (0UL)                     /*!< DEM RF_AGC_LUT_01_REG: VGA2_GAIN0 (Bit 0)                   */
#define DEM_RF_AGC_LUT_01_REG_VGA2_GAIN0_Msk  (0x7UL)                   /*!< DEM RF_AGC_LUT_01_REG: VGA2_GAIN0 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_01_REG_VGA1_GAIN0_Pos  (3UL)                     /*!< DEM RF_AGC_LUT_01_REG: VGA1_GAIN0 (Bit 3)                   */
#define DEM_RF_AGC_LUT_01_REG_VGA1_GAIN0_Msk  (0x38UL)                  /*!< DEM RF_AGC_LUT_01_REG: VGA1_GAIN0 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_01_REG_LNA_GAIN0_Pos   (6UL)                     /*!< DEM RF_AGC_LUT_01_REG: LNA_GAIN0 (Bit 6)                    */
#define DEM_RF_AGC_LUT_01_REG_LNA_GAIN0_Msk   (0xc0UL)                  /*!< DEM RF_AGC_LUT_01_REG: LNA_GAIN0 (Bitfield-Mask: 0x03)      */
#define DEM_RF_AGC_LUT_01_REG_VGA2_GAIN1_Pos  (8UL)                     /*!< DEM RF_AGC_LUT_01_REG: VGA2_GAIN1 (Bit 8)                   */
#define DEM_RF_AGC_LUT_01_REG_VGA2_GAIN1_Msk  (0x700UL)                 /*!< DEM RF_AGC_LUT_01_REG: VGA2_GAIN1 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_01_REG_VGA1_GAIN1_Pos  (11UL)                    /*!< DEM RF_AGC_LUT_01_REG: VGA1_GAIN1 (Bit 11)                  */
#define DEM_RF_AGC_LUT_01_REG_VGA1_GAIN1_Msk  (0x3800UL)                /*!< DEM RF_AGC_LUT_01_REG: VGA1_GAIN1 (Bitfield-Mask: 0x07)     */
#define DEM_RF_AGC_LUT_01_REG_LNA_GAIN1_Pos   (14UL)                    /*!< DEM RF_AGC_LUT_01_REG: LNA_GAIN1 (Bit 14)                   */
#define DEM_RF_AGC_LUT_01_REG_LNA_GAIN1_Msk   (0xc000UL)                /*!< DEM RF_AGC_LUT_01_REG: LNA_GAIN1 (Bitfield-Mask: 0x03)      */

