openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* --------------------------  FTDF_FTDF_REL_NAME_0_REG  -------------------------- */
#define FTDF_FTDF_REL_NAME_0_REG_REL_NAME_Pos (0UL)                     /*!< FTDF FTDF_REL_NAME_0_REG: REL_NAME (Bit 0)                  */
#define FTDF_FTDF_REL_NAME_0_REG_REL_NAME_Msk (0xffffffffUL)            /*!< FTDF FTDF_REL_NAME_0_REG: REL_NAME (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_REL_NAME_1_REG  -------------------------- */
#define FTDF_FTDF_REL_NAME_1_REG_REL_NAME_Pos (0UL)                     /*!< FTDF FTDF_REL_NAME_1_REG: REL_NAME (Bit 0)                  */
#define FTDF_FTDF_REL_NAME_1_REG_REL_NAME_Msk (0xffffffffUL)            /*!< FTDF FTDF_REL_NAME_1_REG: REL_NAME (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_REL_NAME_2_REG  -------------------------- */
#define FTDF_FTDF_REL_NAME_2_REG_REL_NAME_Pos (0UL)                     /*!< FTDF FTDF_REL_NAME_2_REG: REL_NAME (Bit 0)                  */
#define FTDF_FTDF_REL_NAME_2_REG_REL_NAME_Msk (0xffffffffUL)            /*!< FTDF FTDF_REL_NAME_2_REG: REL_NAME (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_REL_NAME_3_REG  -------------------------- */
#define FTDF_FTDF_REL_NAME_3_REG_REL_NAME_Pos (0UL)                     /*!< FTDF FTDF_REL_NAME_3_REG: REL_NAME (Bit 0)                  */
#define FTDF_FTDF_REL_NAME_3_REG_REL_NAME_Msk (0xffffffffUL)            /*!< FTDF FTDF_REL_NAME_3_REG: REL_NAME (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_BUILDTIME_0_REG  ------------------------- */
#define FTDF_FTDF_BUILDTIME_0_REG_BUILDTIME_Pos (0UL)                   /*!< FTDF FTDF_BUILDTIME_0_REG: BUILDTIME (Bit 0)                */
#define FTDF_FTDF_BUILDTIME_0_REG_BUILDTIME_Msk (0xffffffffUL)          /*!< FTDF FTDF_BUILDTIME_0_REG: BUILDTIME (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_BUILDTIME_1_REG  ------------------------- */
#define FTDF_FTDF_BUILDTIME_1_REG_BUILDTIME_Pos (0UL)                   /*!< FTDF FTDF_BUILDTIME_1_REG: BUILDTIME (Bit 0)                */
#define FTDF_FTDF_BUILDTIME_1_REG_BUILDTIME_Msk (0xffffffffUL)          /*!< FTDF FTDF_BUILDTIME_1_REG: BUILDTIME (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_BUILDTIME_2_REG  ------------------------- */
#define FTDF_FTDF_BUILDTIME_2_REG_BUILDTIME_Pos (0UL)                   /*!< FTDF FTDF_BUILDTIME_2_REG: BUILDTIME (Bit 0)                */
#define FTDF_FTDF_BUILDTIME_2_REG_BUILDTIME_Msk (0xffffffffUL)          /*!< FTDF FTDF_BUILDTIME_2_REG: BUILDTIME (Bitfield-Mask: 0xffffffff) */

/* --------------------------  FTDF_FTDF_BUILDTIME_3_REG  ------------------------- */
#define FTDF_FTDF_BUILDTIME_3_REG_BUILDTIME_Pos (0UL)                   /*!< FTDF FTDF_BUILDTIME_3_REG: BUILDTIME (Bit 0)                */
#define FTDF_FTDF_BUILDTIME_3_REG_BUILDTIME_Msk (0xffffffffUL)          /*!< FTDF FTDF_BUILDTIME_3_REG: BUILDTIME (Bitfield-Mask: 0xffffffff) */

/* ------------------------  FTDF_FTDF_GLOB_CONTROL_0_REG  ------------------------ */
#define FTDF_FTDF_GLOB_CONTROL_0_REG_ISPANCOORDINATOR_Pos (1UL)         /*!< FTDF FTDF_GLOB_CONTROL_0_REG: ISPANCOORDINATOR (Bit 1)      */
#define FTDF_FTDF_GLOB_CONTROL_0_REG_ISPANCOORDINATOR_Msk (0x2UL)       /*!< FTDF FTDF_GLOB_CONTROL_0_REG: ISPANCOORDINATOR (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_GLOB_CONTROL_0_REG_RX_DMA_REQ_Pos (2UL)               /*!< FTDF FTDF_GLOB_CONTROL_0_REG: RX_DMA_REQ (Bit 2)            */
#define FTDF_FTDF_GLOB_CONTROL_0_REG_RX_DMA_REQ_Msk (0x4UL)             /*!< FTDF FTDF_GLOB_CONTROL_0_REG: RX_DMA_REQ (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_GLOB_CONTROL_0_REG_TX_DMA_REQ_Pos (3UL)               /*!< FTDF FTDF_GLOB_CONTROL_0_REG: TX_DMA_REQ (Bit 3)            */
#define FTDF_FTDF_GLOB_CONTROL_0_REG_TX_DMA_REQ_Msk (0x8UL)             /*!< FTDF FTDF_GLOB_CONTROL_0_REG: TX_DMA_REQ (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_GLOB_CONTROL_0_REG_MACSIMPLEADDRESS_Pos (8UL)         /*!< FTDF FTDF_GLOB_CONTROL_0_REG: MACSIMPLEADDRESS (Bit 8)      */
#define FTDF_FTDF_GLOB_CONTROL_0_REG_MACSIMPLEADDRESS_Msk (0xff00UL)    /*!< FTDF FTDF_GLOB_CONTROL_0_REG: MACSIMPLEADDRESS (Bitfield-Mask: 0xff) */
#define FTDF_FTDF_GLOB_CONTROL_0_REG_MACLEENABLED_Pos (17UL)            /*!< FTDF FTDF_GLOB_CONTROL_0_REG: MACLEENABLED (Bit 17)         */
#define FTDF_FTDF_GLOB_CONTROL_0_REG_MACLEENABLED_Msk (0x20000UL)       /*!< FTDF FTDF_GLOB_CONTROL_0_REG: MACLEENABLED (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_GLOB_CONTROL_0_REG_MACTSCHENABLED_Pos (18UL)          /*!< FTDF FTDF_GLOB_CONTROL_0_REG: MACTSCHENABLED (Bit 18)       */
#define FTDF_FTDF_GLOB_CONTROL_0_REG_MACTSCHENABLED_Msk (0x40000UL)     /*!< FTDF FTDF_GLOB_CONTROL_0_REG: MACTSCHENABLED (Bitfield-Mask: 0x01) */

/* ------------------------  FTDF_FTDF_GLOB_CONTROL_1_REG  ------------------------ */
#define FTDF_FTDF_GLOB_CONTROL_1_REG_MACPANID_Pos (0UL)                 /*!< FTDF FTDF_GLOB_CONTROL_1_REG: MACPANID (Bit 0)              */
#define FTDF_FTDF_GLOB_CONTROL_1_REG_MACPANID_Msk (0xffffUL)            /*!< FTDF FTDF_GLOB_CONTROL_1_REG: MACPANID (Bitfield-Mask: 0xffff) */
#define FTDF_FTDF_GLOB_CONTROL_1_REG_MACSHORTADDRESS_Pos (16UL)         /*!< FTDF FTDF_GLOB_CONTROL_1_REG: MACSHORTADDRESS (Bit 16)      */
#define FTDF_FTDF_GLOB_CONTROL_1_REG_MACSHORTADDRESS_Msk (0xffff0000UL) /*!< FTDF FTDF_GLOB_CONTROL_1_REG: MACSHORTADDRESS (Bitfield-Mask: 0xffff) */

/* ------------------------  FTDF_FTDF_GLOB_CONTROL_2_REG  ------------------------ */
#define FTDF_FTDF_GLOB_CONTROL_2_REG_AEXTENDEDADDRESS_L_Pos (0UL)       /*!< FTDF FTDF_GLOB_CONTROL_2_REG: AEXTENDEDADDRESS_L (Bit 0)    */
#define FTDF_FTDF_GLOB_CONTROL_2_REG_AEXTENDEDADDRESS_L_Msk (0xffffffffUL) /*!< FTDF FTDF_GLOB_CONTROL_2_REG: AEXTENDEDADDRESS_L (Bitfield-Mask: 0xffffffff) */

/* ------------------------  FTDF_FTDF_GLOB_CONTROL_3_REG  ------------------------ */
#define FTDF_FTDF_GLOB_CONTROL_3_REG_AEXTENDEDADDRESS_H_Pos (0UL)       /*!< FTDF FTDF_GLOB_CONTROL_3_REG: AEXTENDEDADDRESS_H (Bit 0)    */
#define FTDF_FTDF_GLOB_CONTROL_3_REG_AEXTENDEDADDRESS_H_Msk (0xffffffffUL) /*!< FTDF FTDF_GLOB_CONTROL_3_REG: AEXTENDEDADDRESS_H (Bitfield-Mask: 0xffffffff) */

/* ------------------------  FTDF_FTDF_LMAC_CONTROL_0_REG  ------------------------ */
#define FTDF_FTDF_LMAC_CONTROL_0_REG_RXONDURATION_Pos (1UL)             /*!< FTDF FTDF_LMAC_CONTROL_0_REG: RXONDURATION (Bit 1)          */
#define FTDF_FTDF_LMAC_CONTROL_0_REG_RXONDURATION_Msk (0x1fffffeUL)     /*!< FTDF FTDF_LMAC_CONTROL_0_REG: RXONDURATION (Bitfield-Mask: 0xffffff) */
#define FTDF_FTDF_LMAC_CONTROL_0_REG_RXALWAYSON_Pos (25UL)              /*!< FTDF FTDF_LMAC_CONTROL_0_REG: RXALWAYSON (Bit 25)           */
#define FTDF_FTDF_LMAC_CONTROL_0_REG_RXALWAYSON_Msk (0x2000000UL)       /*!< FTDF FTDF_LMAC_CONTROL_0_REG: RXALWAYSON (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_LMAC_CONTROL_0_REG_PTI_Pos  (27UL)                    /*!< FTDF FTDF_LMAC_CONTROL_0_REG: PTI (Bit 27)                  */
#define FTDF_FTDF_LMAC_CONTROL_0_REG_PTI_Msk  (0x78000000UL)            /*!< FTDF FTDF_LMAC_CONTROL_0_REG: PTI (Bitfield-Mask: 0x0f)     */
#define FTDF_FTDF_LMAC_CONTROL_0_REG_KEEP_PHY_EN_Pos (31UL)             /*!< FTDF FTDF_LMAC_CONTROL_0_REG: KEEP_PHY_EN (Bit 31)          */
#define FTDF_FTDF_LMAC_CONTROL_0_REG_KEEP_PHY_EN_Msk (0x80000000UL)     /*!< FTDF FTDF_LMAC_CONTROL_0_REG: KEEP_PHY_EN (Bitfield-Mask: 0x01) */

/* ------------------------  FTDF_FTDF_TXPIPEPROPDELAY_REG  ----------------------- */
#define FTDF_FTDF_TXPIPEPROPDELAY_REG_TXPIPEPROPDELAY_Pos (0UL)         /*!< FTDF FTDF_TXPIPEPROPDELAY_REG: TXPIPEPROPDELAY (Bit 0)      */
#define FTDF_FTDF_TXPIPEPROPDELAY_REG_TXPIPEPROPDELAY_Msk (0xffUL)      /*!< FTDF FTDF_TXPIPEPROPDELAY_REG: TXPIPEPROPDELAY (Bitfield-Mask: 0xff) */

/* ----------------------  FTDF_FTDF_MACACKWAITDURATION_REG  ---------------------- */
#define FTDF_FTDF_MACACKWAITDURATION_REG_MACACKWAITDURATION_Pos (0UL)   /*!< FTDF FTDF_MACACKWAITDURATION_REG: MACACKWAITDURATION (Bit 0) */
#define FTDF_FTDF_MACACKWAITDURATION_REG_MACACKWAITDURATION_Msk (0xffUL) /*!< FTDF FTDF_MACACKWAITDURATION_REG: MACACKWAITDURATION (Bitfield-Mask: 0xff) */

/* ---------------------  FTDF_FTDF_MACENHACKWAITDURATION_REG  -------------------- */
#define FTDF_FTDF_MACENHACKWAITDURATION_REG_MACENHACKWAITDURATION_Pos (0UL) /*!< FTDF FTDF_MACENHACKWAITDURATION_REG: MACENHACKWAITDURATION (Bit 0) */
#define FTDF_FTDF_MACENHACKWAITDURATION_REG_MACENHACKWAITDURATION_Msk (0xffffUL) /*!< FTDF FTDF_MACENHACKWAITDURATION_REG: MACENHACKWAITDURATION (Bitfield-Mask: 0xffff) */

/* ------------------------  FTDF_FTDF_LMAC_CONTROL_1_REG  ------------------------ */
#define FTDF_FTDF_LMAC_CONTROL_1_REG_PHYRXATTR_DEM_PTI_Pos (0UL)        /*!< FTDF FTDF_LMAC_CONTROL_1_REG: PHYRXATTR_DEM_PTI (Bit 0)     */
#define FTDF_FTDF_LMAC_CONTROL_1_REG_PHYRXATTR_DEM_PTI_Msk (0xfUL)      /*!< FTDF FTDF_LMAC_CONTROL_1_REG: PHYRXATTR_DEM_PTI (Bitfield-Mask: 0x0f) */
#define FTDF_FTDF_LMAC_CONTROL_1_REG_PHYRXATTR_CN_Pos (4UL)             /*!< FTDF FTDF_LMAC_CONTROL_1_REG: PHYRXATTR_CN (Bit 4)          */
#define FTDF_FTDF_LMAC_CONTROL_1_REG_PHYRXATTR_CN_Msk (0xf0UL)          /*!< FTDF FTDF_LMAC_CONTROL_1_REG: PHYRXATTR_CN (Bitfield-Mask: 0x0f) */
#define FTDF_FTDF_LMAC_CONTROL_1_REG_PHYRXATTR_CALCAP_Pos (8UL)         /*!< FTDF FTDF_LMAC_CONTROL_1_REG: PHYRXATTR_CALCAP (Bit 8)      */
#define FTDF_FTDF_LMAC_CONTROL_1_REG_PHYRXATTR_CALCAP_Msk (0xf00UL)     /*!< FTDF FTDF_LMAC_CONTROL_1_REG: PHYRXATTR_CALCAP (Bitfield-Mask: 0x0f) */
#define FTDF_FTDF_LMAC_CONTROL_1_REG_PHYRXATTR_RF_GPIO_PINS_Pos (12UL)  /*!< FTDF FTDF_LMAC_CONTROL_1_REG: PHYRXATTR_RF_GPIO_PINS (Bit 12) */
#define FTDF_FTDF_LMAC_CONTROL_1_REG_PHYRXATTR_RF_GPIO_PINS_Msk (0x7000UL) /*!< FTDF FTDF_LMAC_CONTROL_1_REG: PHYRXATTR_RF_GPIO_PINS (Bitfield-Mask: 0x07) */
#define FTDF_FTDF_LMAC_CONTROL_1_REG_PHYRXATTR_HSI_Pos (15UL)           /*!< FTDF FTDF_LMAC_CONTROL_1_REG: PHYRXATTR_HSI (Bit 15)        */
#define FTDF_FTDF_LMAC_CONTROL_1_REG_PHYRXATTR_HSI_Msk (0x8000UL)       /*!< FTDF FTDF_LMAC_CONTROL_1_REG: PHYRXATTR_HSI (Bitfield-Mask: 0x01) */

/* ------------------------  FTDF_FTDF_LMAC_CONTROL_2_REG  ------------------------ */
#define FTDF_FTDF_LMAC_CONTROL_2_REG_EDSCANENABLE_Pos (0UL)             /*!< FTDF FTDF_LMAC_CONTROL_2_REG: EDSCANENABLE (Bit 0)          */
#define FTDF_FTDF_LMAC_CONTROL_2_REG_EDSCANENABLE_Msk (0x1UL)           /*!< FTDF FTDF_LMAC_CONTROL_2_REG: EDSCANENABLE (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_LMAC_CONTROL_2_REG_EDSCANDURATION_Pos (8UL)           /*!< FTDF FTDF_LMAC_CONTROL_2_REG: EDSCANDURATION (Bit 8)        */
#define FTDF_FTDF_LMAC_CONTROL_2_REG_EDSCANDURATION_Msk (0xffffff00UL)  /*!< FTDF FTDF_LMAC_CONTROL_2_REG: EDSCANDURATION (Bitfield-Mask: 0xffffff) */

/* ------------------------  FTDF_FTDF_LMAC_CONTROL_3_REG  ------------------------ */
#define FTDF_FTDF_LMAC_CONTROL_3_REG_MACMAXFRAMETOTALWAITTIME_Pos (0UL) /*!< FTDF FTDF_LMAC_CONTROL_3_REG: MACMAXFRAMETOTALWAITTIME (Bit 0) */
#define FTDF_FTDF_LMAC_CONTROL_3_REG_MACMAXFRAMETOTALWAITTIME_Msk (0xffffUL) /*!< FTDF FTDF_LMAC_CONTROL_3_REG: MACMAXFRAMETOTALWAITTIME (Bitfield-Mask: 0xffff) */
#define FTDF_FTDF_LMAC_CONTROL_3_REG_CCAIDLEWAIT_Pos (16UL)             /*!< FTDF FTDF_LMAC_CONTROL_3_REG: CCAIDLEWAIT (Bit 16)          */
#define FTDF_FTDF_LMAC_CONTROL_3_REG_CCAIDLEWAIT_Msk (0xff0000UL)       /*!< FTDF FTDF_LMAC_CONTROL_3_REG: CCAIDLEWAIT (Bitfield-Mask: 0xff) */

/* ------------------------  FTDF_FTDF_LMAC_CONTROL_OS_REG  ----------------------- */
#define FTDF_FTDF_LMAC_CONTROL_OS_REG_GETGENERATORVAL_Pos (0UL)         /*!< FTDF FTDF_LMAC_CONTROL_OS_REG: GETGENERATORVAL (Bit 0)      */
#define FTDF_FTDF_LMAC_CONTROL_OS_REG_GETGENERATORVAL_Msk (0x1UL)       /*!< FTDF FTDF_LMAC_CONTROL_OS_REG: GETGENERATORVAL (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_LMAC_CONTROL_OS_REG_RXENABLE_Pos (1UL)                /*!< FTDF FTDF_LMAC_CONTROL_OS_REG: RXENABLE (Bit 1)             */
#define FTDF_FTDF_LMAC_CONTROL_OS_REG_RXENABLE_Msk (0x2UL)              /*!< FTDF FTDF_LMAC_CONTROL_OS_REG: RXENABLE (Bitfield-Mask: 0x01) */
#define FTDF_FTDF_LMAC_CONTROL_OS_REG_SINGLECCA_Pos (2UL)               /*!< FTDF FTDF_LMAC_CONTROL_OS_REG: SINGLECCA (Bit 2)            */
#define FTDF_FTDF_LMAC_CONTROL_OS_REG_SINGLECCA_Msk (0x4UL)             /*!< FTDF FTDF_LMAC_CONTROL_OS_REG: SINGLECCA (Bitfield-Mask: 0x01) */

