openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* ---------------------------  FTDF_FTDF_TXBYTE_M_REG  --------------------------- */
#define FTDF_FTDF_TXBYTE_M_REG_TXBYTE_M_Pos   (0UL)                     /*!< FTDF FTDF_TXBYTE_M_REG: TXBYTE_M (Bit 0)                    */
#define FTDF_FTDF_TXBYTE_M_REG_TXBYTE_M_Msk   (0x1UL)                   /*!< FTDF FTDF_TXBYTE_M_REG: TXBYTE_M (Bitfield-Mask: 0x01)      */
#define FTDF_FTDF_TXBYTE_M_REG_TX_LAST_SYMBOL_M_Pos (1UL)               /*!< FTDF FTDF_TXBYTE_M_REG: TX_LAST_SYMBOL_M (Bit 1)            */
#define FTDF_FTDF_TXBYTE_M_REG_TX_LAST_SYMBOL_M_Msk (0x2UL)             /*!< FTDF FTDF_TXBYTE_M_REG: TX_LAST_SYMBOL_M (Bitfield-Mask: 0x01) */

/* --------------------------  FTDF_FTDF_TX_FLAG_S_0_REG  ------------------------- */
#define FTDF_FTDF_TX_FLAG_S_0_REG_TX_FLAG_STAT_Pos (0UL)                /*!< FTDF FTDF_TX_FLAG_S_0_REG: TX_FLAG_STAT (Bit 0)             */
#define FTDF_FTDF_TX_FLAG_S_0_REG_TX_FLAG_STAT_Msk (0x1UL)              /*!< FTDF FTDF_TX_FLAG_S_0_REG: TX_FLAG_STAT (Bitfield-Mask: 0x01) */

/* -----------------------  FTDF_FTDF_TX_FLAG_CLEAR_E_0_REG  ---------------------- */
#define FTDF_FTDF_TX_FLAG_CLEAR_E_0_REG_TX_FLAG_CLEAR_E_Pos (0UL)       /*!< FTDF FTDF_TX_FLAG_CLEAR_E_0_REG: TX_FLAG_CLEAR_E (Bit 0)    */
#define FTDF_FTDF_TX_FLAG_CLEAR_E_0_REG_TX_FLAG_CLEAR_E_Msk (0x1UL)     /*!< FTDF FTDF_TX_FLAG_CLEAR_E_0_REG: TX_FLAG_CLEAR_E (Bitfield-Mask: 0x01) */

/* -----------------------  FTDF_FTDF_TX_FLAG_CLEAR_M_0_REG  ---------------------- */
#define FTDF_FTDF_TX_FLAG_CLEAR_M_0_REG_TX_FLAG_CLEAR_M_Pos (0UL)       /*!< FTDF FTDF_TX_FLAG_CLEAR_M_0_REG: TX_FLAG_CLEAR_M (Bit 0)    */
#define FTDF_FTDF_TX_FLAG_CLEAR_M_0_REG_TX_FLAG_CLEAR_M_Msk (0x1UL)     /*!< FTDF FTDF_TX_FLAG_CLEAR_M_0_REG: TX_FLAG_CLEAR_M (Bitfield-Mask: 0x01) */

/* -------------------------  FTDF_FTDF_TX_PRIORITY_0_REG  ------------------------ */
#define FTDF_FTDF_TX_PRIORITY_0_REG_TX_PRIORITY_Pos (0UL)               /*!< FTDF FTDF_TX_PRIORITY_0_REG: TX_PRIORITY (Bit 0)            */
#define FTDF_FTDF_TX_PRIORITY_0_REG_TX_PRIORITY_Msk (0xfUL)             /*!< FTDF FTDF_TX_PRIORITY_0_REG: TX_PRIORITY (Bitfield-Mask: 0x0f) */
#define FTDF_FTDF_TX_PRIORITY_0_REG_ISWAKEUP_Pos (4UL)                  /*!< FTDF FTDF_TX_PRIORITY_0_REG: ISWAKEUP (Bit 4)               */
#define FTDF_FTDF_TX_PRIORITY_0_REG_ISWAKEUP_Msk (0x10UL)               /*!< FTDF FTDF_TX_PRIORITY_0_REG: ISWAKEUP (Bitfield-Mask: 0x01) */

/* --------------------------  FTDF_FTDF_TX_FLAG_S_1_REG  ------------------------- */
#define FTDF_FTDF_TX_FLAG_S_1_REG_TX_FLAG_STAT_Pos (0UL)                /*!< FTDF FTDF_TX_FLAG_S_1_REG: TX_FLAG_STAT (Bit 0)             */
#define FTDF_FTDF_TX_FLAG_S_1_REG_TX_FLAG_STAT_Msk (0x1UL)              /*!< FTDF FTDF_TX_FLAG_S_1_REG: TX_FLAG_STAT (Bitfield-Mask: 0x01) */

/* -----------------------  FTDF_FTDF_TX_FLAG_CLEAR_E_1_REG  ---------------------- */
#define FTDF_FTDF_TX_FLAG_CLEAR_E_1_REG_TX_FLAG_CLEAR_E_Pos (0UL)       /*!< FTDF FTDF_TX_FLAG_CLEAR_E_1_REG: TX_FLAG_CLEAR_E (Bit 0)    */
#define FTDF_FTDF_TX_FLAG_CLEAR_E_1_REG_TX_FLAG_CLEAR_E_Msk (0x1UL)     /*!< FTDF FTDF_TX_FLAG_CLEAR_E_1_REG: TX_FLAG_CLEAR_E (Bitfield-Mask: 0x01) */

/* -----------------------  FTDF_FTDF_TX_FLAG_CLEAR_M_1_REG  ---------------------- */
#define FTDF_FTDF_TX_FLAG_CLEAR_M_1_REG_TX_FLAG_CLEAR_M_Pos (0UL)       /*!< FTDF FTDF_TX_FLAG_CLEAR_M_1_REG: TX_FLAG_CLEAR_M (Bit 0)    */
#define FTDF_FTDF_TX_FLAG_CLEAR_M_1_REG_TX_FLAG_CLEAR_M_Msk (0x1UL)     /*!< FTDF FTDF_TX_FLAG_CLEAR_M_1_REG: TX_FLAG_CLEAR_M (Bitfield-Mask: 0x01) */

/* -------------------------  FTDF_FTDF_TX_PRIORITY_1_REG  ------------------------ */
#define FTDF_FTDF_TX_PRIORITY_1_REG_TX_PRIORITY_Pos (0UL)               /*!< FTDF FTDF_TX_PRIORITY_1_REG: TX_PRIORITY (Bit 0)            */
#define FTDF_FTDF_TX_PRIORITY_1_REG_TX_PRIORITY_Msk (0xfUL)             /*!< FTDF FTDF_TX_PRIORITY_1_REG: TX_PRIORITY (Bitfield-Mask: 0x0f) */
#define FTDF_FTDF_TX_PRIORITY_1_REG_ISWAKEUP_Pos (4UL)                  /*!< FTDF FTDF_TX_PRIORITY_1_REG: ISWAKEUP (Bit 4)               */
#define FTDF_FTDF_TX_PRIORITY_1_REG_ISWAKEUP_Msk (0x10UL)               /*!< FTDF FTDF_TX_PRIORITY_1_REG: ISWAKEUP (Bitfield-Mask: 0x01) */

/* --------------------------  FTDF_FTDF_TX_FLAG_S_2_REG  ------------------------- */
#define FTDF_FTDF_TX_FLAG_S_2_REG_TX_FLAG_STAT_Pos (0UL)                /*!< FTDF FTDF_TX_FLAG_S_2_REG: TX_FLAG_STAT (Bit 0)             */
#define FTDF_FTDF_TX_FLAG_S_2_REG_TX_FLAG_STAT_Msk (0x1UL)              /*!< FTDF FTDF_TX_FLAG_S_2_REG: TX_FLAG_STAT (Bitfield-Mask: 0x01) */

/* -----------------------  FTDF_FTDF_TX_FLAG_CLEAR_E_2_REG  ---------------------- */
#define FTDF_FTDF_TX_FLAG_CLEAR_E_2_REG_TX_FLAG_CLEAR_E_Pos (0UL)       /*!< FTDF FTDF_TX_FLAG_CLEAR_E_2_REG: TX_FLAG_CLEAR_E (Bit 0)    */
#define FTDF_FTDF_TX_FLAG_CLEAR_E_2_REG_TX_FLAG_CLEAR_E_Msk (0x1UL)     /*!< FTDF FTDF_TX_FLAG_CLEAR_E_2_REG: TX_FLAG_CLEAR_E (Bitfield-Mask: 0x01) */

/* -----------------------  FTDF_FTDF_TX_FLAG_CLEAR_M_2_REG  ---------------------- */
#define FTDF_FTDF_TX_FLAG_CLEAR_M_2_REG_TX_FLAG_CLEAR_M_Pos (0UL)       /*!< FTDF FTDF_TX_FLAG_CLEAR_M_2_REG: TX_FLAG_CLEAR_M (Bit 0)    */
#define FTDF_FTDF_TX_FLAG_CLEAR_M_2_REG_TX_FLAG_CLEAR_M_Msk (0x1UL)     /*!< FTDF FTDF_TX_FLAG_CLEAR_M_2_REG: TX_FLAG_CLEAR_M (Bitfield-Mask: 0x01) */

/* -------------------------  FTDF_FTDF_TX_PRIORITY_2_REG  ------------------------ */
#define FTDF_FTDF_TX_PRIORITY_2_REG_TX_PRIORITY_Pos (0UL)               /*!< FTDF FTDF_TX_PRIORITY_2_REG: TX_PRIORITY (Bit 0)            */
#define FTDF_FTDF_TX_PRIORITY_2_REG_TX_PRIORITY_Msk (0xfUL)             /*!< FTDF FTDF_TX_PRIORITY_2_REG: TX_PRIORITY (Bitfield-Mask: 0x0f) */
#define FTDF_FTDF_TX_PRIORITY_2_REG_ISWAKEUP_Pos (4UL)                  /*!< FTDF FTDF_TX_PRIORITY_2_REG: ISWAKEUP (Bit 4)               */
#define FTDF_FTDF_TX_PRIORITY_2_REG_ISWAKEUP_Msk (0x10UL)               /*!< FTDF FTDF_TX_PRIORITY_2_REG: ISWAKEUP (Bitfield-Mask: 0x01) */

/* --------------------------  FTDF_FTDF_TX_FLAG_S_3_REG  ------------------------- */
#define FTDF_FTDF_TX_FLAG_S_3_REG_TX_FLAG_STAT_Pos (0UL)                /*!< FTDF FTDF_TX_FLAG_S_3_REG: TX_FLAG_STAT (Bit 0)             */
#define FTDF_FTDF_TX_FLAG_S_3_REG_TX_FLAG_STAT_Msk (0x1UL)              /*!< FTDF FTDF_TX_FLAG_S_3_REG: TX_FLAG_STAT (Bitfield-Mask: 0x01) */

/* -----------------------  FTDF_FTDF_TX_FLAG_CLEAR_E_3_REG  ---------------------- */
#define FTDF_FTDF_TX_FLAG_CLEAR_E_3_REG_TX_FLAG_CLEAR_E_Pos (0UL)       /*!< FTDF FTDF_TX_FLAG_CLEAR_E_3_REG: TX_FLAG_CLEAR_E (Bit 0)    */
#define FTDF_FTDF_TX_FLAG_CLEAR_E_3_REG_TX_FLAG_CLEAR_E_Msk (0x1UL)     /*!< FTDF FTDF_TX_FLAG_CLEAR_E_3_REG: TX_FLAG_CLEAR_E (Bitfield-Mask: 0x01) */

/* -----------------------  FTDF_FTDF_TX_FLAG_CLEAR_M_3_REG  ---------------------- */
#define FTDF_FTDF_TX_FLAG_CLEAR_M_3_REG_TX_FLAG_CLEAR_M_Pos (0UL)       /*!< FTDF FTDF_TX_FLAG_CLEAR_M_3_REG: TX_FLAG_CLEAR_M (Bit 0)    */
#define FTDF_FTDF_TX_FLAG_CLEAR_M_3_REG_TX_FLAG_CLEAR_M_Msk (0x1UL)     /*!< FTDF FTDF_TX_FLAG_CLEAR_M_3_REG: TX_FLAG_CLEAR_M (Bitfield-Mask: 0x01) */

/* -------------------------  FTDF_FTDF_TX_PRIORITY_3_REG  ------------------------ */
#define FTDF_FTDF_TX_PRIORITY_3_REG_TX_PRIORITY_Pos (0UL)               /*!< FTDF FTDF_TX_PRIORITY_3_REG: TX_PRIORITY (Bit 0)            */
#define FTDF_FTDF_TX_PRIORITY_3_REG_TX_PRIORITY_Msk (0xfUL)             /*!< FTDF FTDF_TX_PRIORITY_3_REG: TX_PRIORITY (Bitfield-Mask: 0x0f) */
#define FTDF_FTDF_TX_PRIORITY_3_REG_ISWAKEUP_Pos (4UL)                  /*!< FTDF FTDF_TX_PRIORITY_3_REG: ISWAKEUP (Bit 4)               */
#define FTDF_FTDF_TX_PRIORITY_3_REG_ISWAKEUP_Msk (0x10UL)               /*!< FTDF FTDF_TX_PRIORITY_3_REG: ISWAKEUP (Bitfield-Mask: 0x01) */

/* ---------------------------  FTDF_FTDF_TX_SET_OS_REG  -------------------------- */
#define FTDF_FTDF_TX_SET_OS_REG_TX_FLAG_SET_Pos (0UL)                   /*!< FTDF FTDF_TX_SET_OS_REG: TX_FLAG_SET (Bit 0)                */
#define FTDF_FTDF_TX_SET_OS_REG_TX_FLAG_SET_Msk (0xfUL)                 /*!< FTDF FTDF_TX_SET_OS_REG: TX_FLAG_SET (Bitfield-Mask: 0x0f)  */

/* --------------------------  FTDF_FTDF_TX_CLEAR_OS_REG  ------------------------- */
#define FTDF_FTDF_TX_CLEAR_OS_REG_TX_FLAG_CLEAR_Pos (0UL)               /*!< FTDF FTDF_TX_CLEAR_OS_REG: TX_FLAG_CLEAR (Bit 0)            */
#define FTDF_FTDF_TX_CLEAR_OS_REG_TX_FLAG_CLEAR_Msk (0xfUL)             /*!< FTDF FTDF_TX_CLEAR_OS_REG: TX_FLAG_CLEAR (Bitfield-Mask: 0x0f) */

