openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* ----------------------------  GPADC_GP_ADC_OFFP_REG  --------------------------- */
#define GPADC_GP_ADC_OFFP_REG_GP_ADC_OFFP_Pos (0UL)                     /*!< GPADC GP_ADC_OFFP_REG: GP_ADC_OFFP (Bit 0)                  */
#define GPADC_GP_ADC_OFFP_REG_GP_ADC_OFFP_Msk (0x3ffUL)                 /*!< GPADC GP_ADC_OFFP_REG: GP_ADC_OFFP (Bitfield-Mask: 0x3ff)   */

/* ----------------------------  GPADC_GP_ADC_OFFN_REG  --------------------------- */
#define GPADC_GP_ADC_OFFN_REG_GP_ADC_OFFN_Pos (0UL)                     /*!< GPADC GP_ADC_OFFN_REG: GP_ADC_OFFN (Bit 0)                  */
#define GPADC_GP_ADC_OFFN_REG_GP_ADC_OFFN_Msk (0x3ffUL)                 /*!< GPADC GP_ADC_OFFN_REG: GP_ADC_OFFN (Bitfield-Mask: 0x3ff)   */

/* -------------------------  GPADC_GP_ADC_CLEAR_INT_REG  ------------------------- */
#define GPADC_GP_ADC_CLEAR_INT_REG_GP_ADC_CLR_INT_Pos (0UL)             /*!< GPADC GP_ADC_CLEAR_INT_REG: GP_ADC_CLR_INT (Bit 0)          */
#define GPADC_GP_ADC_CLEAR_INT_REG_GP_ADC_CLR_INT_Msk (0xffffUL)        /*!< GPADC GP_ADC_CLEAR_INT_REG: GP_ADC_CLR_INT (Bitfield-Mask: 0xffff) */

/* ---------------------------  GPADC_GP_ADC_RESULT_REG  -------------------------- */
#define GPADC_GP_ADC_RESULT_REG_GP_ADC_VAL_Pos (0UL)                    /*!< GPADC GP_ADC_RESULT_REG: GP_ADC_VAL (Bit 0)                 */
#define GPADC_GP_ADC_RESULT_REG_GP_ADC_VAL_Msk (0xffffUL)               /*!< GPADC GP_ADC_RESULT_REG: GP_ADC_VAL (Bitfield-Mask: 0xffff) */


/* ================================================================================ */
/* ================          struct 'GPIO' Position & Mask         ================ */
/* ================================================================================ */


/* ------------------------------  GPIO_P0_DATA_REG  ------------------------------ */
#define GPIO_P0_DATA_REG_P0_DATA_Pos          (0UL)                     /*!< GPIO P0_DATA_REG: P0_DATA (Bit 0)                           */
#define GPIO_P0_DATA_REG_P0_DATA_Msk          (0xffUL)                  /*!< GPIO P0_DATA_REG: P0_DATA (Bitfield-Mask: 0xff)             */

/* ------------------------------  GPIO_P1_DATA_REG  ------------------------------ */
#define GPIO_P1_DATA_REG_P1_DATA_Pos          (0UL)                     /*!< GPIO P1_DATA_REG: P1_DATA (Bit 0)                           */
#define GPIO_P1_DATA_REG_P1_DATA_Msk          (0xffUL)                  /*!< GPIO P1_DATA_REG: P1_DATA (Bitfield-Mask: 0xff)             */

/* ------------------------------  GPIO_P2_DATA_REG  ------------------------------ */
#define GPIO_P2_DATA_REG_P2_DATA_Pos          (0UL)                     /*!< GPIO P2_DATA_REG: P2_DATA (Bit 0)                           */
#define GPIO_P2_DATA_REG_P2_DATA_Msk          (0x1fUL)                  /*!< GPIO P2_DATA_REG: P2_DATA (Bitfield-Mask: 0x1f)             */

/* ------------------------------  GPIO_P3_DATA_REG  ------------------------------ */
#define GPIO_P3_DATA_REG_P3_DATA_Pos          (0UL)                     /*!< GPIO P3_DATA_REG: P3_DATA (Bit 0)                           */
#define GPIO_P3_DATA_REG_P3_DATA_Msk          (0xffUL)                  /*!< GPIO P3_DATA_REG: P3_DATA (Bitfield-Mask: 0xff)             */

/* ------------------------------  GPIO_P4_DATA_REG  ------------------------------ */
#define GPIO_P4_DATA_REG_P4_DATA_Pos          (0UL)                     /*!< GPIO P4_DATA_REG: P4_DATA (Bit 0)                           */
#define GPIO_P4_DATA_REG_P4_DATA_Msk          (0xffUL)                  /*!< GPIO P4_DATA_REG: P4_DATA (Bitfield-Mask: 0xff)             */

/* ----------------------------  GPIO_P0_SET_DATA_REG  ---------------------------- */
#define GPIO_P0_SET_DATA_REG_P0_SET_Pos       (0UL)                     /*!< GPIO P0_SET_DATA_REG: P0_SET (Bit 0)                        */
#define GPIO_P0_SET_DATA_REG_P0_SET_Msk       (0xffUL)                  /*!< GPIO P0_SET_DATA_REG: P0_SET (Bitfield-Mask: 0xff)          */

/* ----------------------------  GPIO_P1_SET_DATA_REG  ---------------------------- */
#define GPIO_P1_SET_DATA_REG_P1_SET_Pos       (0UL)                     /*!< GPIO P1_SET_DATA_REG: P1_SET (Bit 0)                        */
#define GPIO_P1_SET_DATA_REG_P1_SET_Msk       (0xffUL)                  /*!< GPIO P1_SET_DATA_REG: P1_SET (Bitfield-Mask: 0xff)          */

/* ----------------------------  GPIO_P2_SET_DATA_REG  ---------------------------- */
#define GPIO_P2_SET_DATA_REG_P2_SET_Pos       (0UL)                     /*!< GPIO P2_SET_DATA_REG: P2_SET (Bit 0)                        */
#define GPIO_P2_SET_DATA_REG_P2_SET_Msk       (0x1fUL)                  /*!< GPIO P2_SET_DATA_REG: P2_SET (Bitfield-Mask: 0x1f)          */

/* ----------------------------  GPIO_P3_SET_DATA_REG  ---------------------------- */
#define GPIO_P3_SET_DATA_REG_P3_SET_Pos       (0UL)                     /*!< GPIO P3_SET_DATA_REG: P3_SET (Bit 0)                        */
#define GPIO_P3_SET_DATA_REG_P3_SET_Msk       (0xffUL)                  /*!< GPIO P3_SET_DATA_REG: P3_SET (Bitfield-Mask: 0xff)          */

/* ----------------------------  GPIO_P4_SET_DATA_REG  ---------------------------- */
#define GPIO_P4_SET_DATA_REG_P4_SET_Pos       (0UL)                     /*!< GPIO P4_SET_DATA_REG: P4_SET (Bit 0)                        */
#define GPIO_P4_SET_DATA_REG_P4_SET_Msk       (0xffUL)                  /*!< GPIO P4_SET_DATA_REG: P4_SET (Bitfield-Mask: 0xff)          */

/* ---------------------------  GPIO_P0_RESET_DATA_REG  --------------------------- */
#define GPIO_P0_RESET_DATA_REG_P0_RESET_Pos   (0UL)                     /*!< GPIO P0_RESET_DATA_REG: P0_RESET (Bit 0)                    */
#define GPIO_P0_RESET_DATA_REG_P0_RESET_Msk   (0xffUL)                  /*!< GPIO P0_RESET_DATA_REG: P0_RESET (Bitfield-Mask: 0xff)      */

/* ---------------------------  GPIO_P1_RESET_DATA_REG  --------------------------- */
#define GPIO_P1_RESET_DATA_REG_P1_RESET_Pos   (0UL)                     /*!< GPIO P1_RESET_DATA_REG: P1_RESET (Bit 0)                    */
#define GPIO_P1_RESET_DATA_REG_P1_RESET_Msk   (0xffUL)                  /*!< GPIO P1_RESET_DATA_REG: P1_RESET (Bitfield-Mask: 0xff)      */

/* ---------------------------  GPIO_P2_RESET_DATA_REG  --------------------------- */
#define GPIO_P2_RESET_DATA_REG_P2_RESET_Pos   (0UL)                     /*!< GPIO P2_RESET_DATA_REG: P2_RESET (Bit 0)                    */
#define GPIO_P2_RESET_DATA_REG_P2_RESET_Msk   (0x1fUL)                  /*!< GPIO P2_RESET_DATA_REG: P2_RESET (Bitfield-Mask: 0x1f)      */

/* ---------------------------  GPIO_P3_RESET_DATA_REG  --------------------------- */
#define GPIO_P3_RESET_DATA_REG_P3_RESET_Pos   (0UL)                     /*!< GPIO P3_RESET_DATA_REG: P3_RESET (Bit 0)                    */
#define GPIO_P3_RESET_DATA_REG_P3_RESET_Msk   (0xffUL)                  /*!< GPIO P3_RESET_DATA_REG: P3_RESET (Bitfield-Mask: 0xff)      */

/* ---------------------------  GPIO_P4_RESET_DATA_REG  --------------------------- */
#define GPIO_P4_RESET_DATA_REG_P4_RESET_Pos   (0UL)                     /*!< GPIO P4_RESET_DATA_REG: P4_RESET (Bit 0)                    */
#define GPIO_P4_RESET_DATA_REG_P4_RESET_Msk   (0xffUL)                  /*!< GPIO P4_RESET_DATA_REG: P4_RESET (Bitfield-Mask: 0xff)      */

/* ------------------------------  GPIO_P00_MODE_REG  ----------------------------- */
#define GPIO_P00_MODE_REG_PID_Pos             (0UL)                     /*!< GPIO P00_MODE_REG: PID (Bit 0)                              */
#define GPIO_P00_MODE_REG_PID_Msk             (0x3fUL)                  /*!< GPIO P00_MODE_REG: PID (Bitfield-Mask: 0x3f)                */
#define GPIO_P00_MODE_REG_PUPD_Pos            (8UL)                     /*!< GPIO P00_MODE_REG: PUPD (Bit 8)                             */
#define GPIO_P00_MODE_REG_PUPD_Msk            (0x300UL)                 /*!< GPIO P00_MODE_REG: PUPD (Bitfield-Mask: 0x03)               */
#define GPIO_P00_MODE_REG_PPOD_Pos            (10UL)                    /*!< GPIO P00_MODE_REG: PPOD (Bit 10)                            */
#define GPIO_P00_MODE_REG_PPOD_Msk            (0x400UL)                 /*!< GPIO P00_MODE_REG: PPOD (Bitfield-Mask: 0x01)               */

