openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* -----------------------------  GPIO_TEST_CTRL2_REG  ---------------------------- */
#define GPIO_TEST_CTRL2_REG_ANA_TESTMUX_CTRL_Pos (0UL)                  /*!< GPIO TEST_CTRL2_REG: ANA_TESTMUX_CTRL (Bit 0)               */
#define GPIO_TEST_CTRL2_REG_ANA_TESTMUX_CTRL_Msk (0xfUL)                /*!< GPIO TEST_CTRL2_REG: ANA_TESTMUX_CTRL (Bitfield-Mask: 0x0f) */
#define GPIO_TEST_CTRL2_REG_RF_IN_TESTMUX_CTRL_Pos (8UL)                /*!< GPIO TEST_CTRL2_REG: RF_IN_TESTMUX_CTRL (Bit 8)             */
#define GPIO_TEST_CTRL2_REG_RF_IN_TESTMUX_CTRL_Msk (0x300UL)            /*!< GPIO TEST_CTRL2_REG: RF_IN_TESTMUX_CTRL (Bitfield-Mask: 0x03) */

/* -----------------------------  GPIO_TEST_CTRL3_REG  ---------------------------- */
#define GPIO_TEST_CTRL3_REG_RF_TEST_OUT_SEL_Pos (0UL)                   /*!< GPIO TEST_CTRL3_REG: RF_TEST_OUT_SEL (Bit 0)                */
#define GPIO_TEST_CTRL3_REG_RF_TEST_OUT_SEL_Msk (0x3fUL)                /*!< GPIO TEST_CTRL3_REG: RF_TEST_OUT_SEL (Bitfield-Mask: 0x3f)  */
#define GPIO_TEST_CTRL3_REG_USBCOMP_TEST_Pos  (6UL)                     /*!< GPIO TEST_CTRL3_REG: USBCOMP_TEST (Bit 6)                   */
#define GPIO_TEST_CTRL3_REG_USBCOMP_TEST_Msk  (0x40UL)                  /*!< GPIO TEST_CTRL3_REG: USBCOMP_TEST (Bitfield-Mask: 0x01)     */
#define GPIO_TEST_CTRL3_REG_RF_TEST_OUT_PARAM_Pos (8UL)                 /*!< GPIO TEST_CTRL3_REG: RF_TEST_OUT_PARAM (Bit 8)              */
#define GPIO_TEST_CTRL3_REG_RF_TEST_OUT_PARAM_Msk (0xff00UL)            /*!< GPIO TEST_CTRL3_REG: RF_TEST_OUT_PARAM (Bitfield-Mask: 0xff) */

/* -----------------------------  GPIO_TEST_CTRL4_REG  ---------------------------- */
#define GPIO_TEST_CTRL4_REG_RF_TEST_IN_SEL_Pos (0UL)                    /*!< GPIO TEST_CTRL4_REG: RF_TEST_IN_SEL (Bit 0)                 */
#define GPIO_TEST_CTRL4_REG_RF_TEST_IN_SEL_Msk (0x7UL)                  /*!< GPIO TEST_CTRL4_REG: RF_TEST_IN_SEL (Bitfield-Mask: 0x07)   */
#define GPIO_TEST_CTRL4_REG_RF_TEST_IN_PARAM_Pos (8UL)                  /*!< GPIO TEST_CTRL4_REG: RF_TEST_IN_PARAM (Bit 8)               */
#define GPIO_TEST_CTRL4_REG_RF_TEST_IN_PARAM_Msk (0xff00UL)             /*!< GPIO TEST_CTRL4_REG: RF_TEST_IN_PARAM (Bitfield-Mask: 0xff) */

/* -----------------------------  GPIO_TEST_CTRL5_REG  ---------------------------- */
#define GPIO_TEST_CTRL5_REG_TEST_BUS_TO_AVS_Pos (0UL)                   /*!< GPIO TEST_CTRL5_REG: TEST_BUS_TO_AVS (Bit 0)                */
#define GPIO_TEST_CTRL5_REG_TEST_BUS_TO_AVS_Msk (0x1UL)                 /*!< GPIO TEST_CTRL5_REG: TEST_BUS_TO_AVS (Bitfield-Mask: 0x01)  */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_1V4_Pos  (1UL)                     /*!< GPIO TEST_CTRL5_REG: TEST_LDO_1V4 (Bit 1)                   */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_1V4_Msk  (0x2UL)                   /*!< GPIO TEST_CTRL5_REG: TEST_LDO_1V4 (Bitfield-Mask: 0x01)     */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_1V8_FLASH_Pos (2UL)                /*!< GPIO TEST_CTRL5_REG: TEST_LDO_1V8_FLASH (Bit 2)             */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_1V8_FLASH_Msk (0x4UL)              /*!< GPIO TEST_CTRL5_REG: TEST_LDO_1V8_FLASH (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_CORE_Pos (3UL)                     /*!< GPIO TEST_CTRL5_REG: TEST_LDO_CORE (Bit 3)                  */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_CORE_Msk (0x8UL)                   /*!< GPIO TEST_CTRL5_REG: TEST_LDO_CORE (Bitfield-Mask: 0x01)    */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_1V8_PA_Pos (4UL)                   /*!< GPIO TEST_CTRL5_REG: TEST_LDO_1V8_PA (Bit 4)                */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_1V8_PA_Msk (0x10UL)                /*!< GPIO TEST_CTRL5_REG: TEST_LDO_1V8_PA (Bitfield-Mask: 0x01)  */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_ADC_Pos  (5UL)                     /*!< GPIO TEST_CTRL5_REG: TEST_LDO_ADC (Bit 5)                   */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_ADC_Msk  (0x20UL)                  /*!< GPIO TEST_CTRL5_REG: TEST_LDO_ADC (Bitfield-Mask: 0x01)     */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_PLL_Pos  (6UL)                     /*!< GPIO TEST_CTRL5_REG: TEST_LDO_PLL (Bit 6)                   */
#define GPIO_TEST_CTRL5_REG_TEST_LDO_PLL_Msk  (0x40UL)                  /*!< GPIO TEST_CTRL5_REG: TEST_LDO_PLL (Bitfield-Mask: 0x01)     */
#define GPIO_TEST_CTRL5_REG_TEST_BANDGAP_I_TEST_Pos (7UL)               /*!< GPIO TEST_CTRL5_REG: TEST_BANDGAP_I_TEST (Bit 7)            */
#define GPIO_TEST_CTRL5_REG_TEST_BANDGAP_I_TEST_Msk (0x80UL)            /*!< GPIO TEST_CTRL5_REG: TEST_BANDGAP_I_TEST (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL5_REG_TEST_SIMO_BUCK_Pos (8UL)                    /*!< GPIO TEST_CTRL5_REG: TEST_SIMO_BUCK (Bit 8)                 */
#define GPIO_TEST_CTRL5_REG_TEST_SIMO_BUCK_Msk (0x100UL)                /*!< GPIO TEST_CTRL5_REG: TEST_SIMO_BUCK (Bitfield-Mask: 0x01)   */
#define GPIO_TEST_CTRL5_REG_TEST_BOD_VREF_OUT_Pos (9UL)                 /*!< GPIO TEST_CTRL5_REG: TEST_BOD_VREF_OUT (Bit 9)              */
#define GPIO_TEST_CTRL5_REG_TEST_BOD_VREF_OUT_Msk (0x200UL)             /*!< GPIO TEST_CTRL5_REG: TEST_BOD_VREF_OUT (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL5_REG_TEST_BOD_VREF_IN_Pos (10UL)                 /*!< GPIO TEST_CTRL5_REG: TEST_BOD_VREF_IN (Bit 10)              */
#define GPIO_TEST_CTRL5_REG_TEST_BOD_VREF_IN_Msk (0x400UL)              /*!< GPIO TEST_CTRL5_REG: TEST_BOD_VREF_IN (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL5_REG_TEST_I_DCDC_FILT_Pos (11UL)                 /*!< GPIO TEST_CTRL5_REG: TEST_I_DCDC_FILT (Bit 11)              */
#define GPIO_TEST_CTRL5_REG_TEST_I_DCDC_FILT_Msk (0x800UL)              /*!< GPIO TEST_CTRL5_REG: TEST_I_DCDC_FILT (Bitfield-Mask: 0x01) */
#define GPIO_TEST_CTRL5_REG_TEST_VCONT_A_Pos  (12UL)                    /*!< GPIO TEST_CTRL5_REG: TEST_VCONT_A (Bit 12)                  */
#define GPIO_TEST_CTRL5_REG_TEST_VCONT_A_Msk  (0x1000UL)                /*!< GPIO TEST_CTRL5_REG: TEST_VCONT_A (Bitfield-Mask: 0x01)     */
#define GPIO_TEST_CTRL5_REG_TEST_VREF_1V2_A_Pos (13UL)                  /*!< GPIO TEST_CTRL5_REG: TEST_VREF_1V2_A (Bit 13)               */
#define GPIO_TEST_CTRL5_REG_TEST_VREF_1V2_A_Msk (0x2000UL)              /*!< GPIO TEST_CTRL5_REG: TEST_VREF_1V2_A (Bitfield-Mask: 0x01)  */


/* ================================================================================ */
/* ================         struct 'GPREG' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------  GPREG_SET_FREEZE_REG  ---------------------------- */
#define GPREG_SET_FREEZE_REG_FRZ_WKUPTIM_Pos  (0UL)                     /*!< GPREG SET_FREEZE_REG: FRZ_WKUPTIM (Bit 0)                   */
#define GPREG_SET_FREEZE_REG_FRZ_WKUPTIM_Msk  (0x1UL)                   /*!< GPREG SET_FREEZE_REG: FRZ_WKUPTIM (Bitfield-Mask: 0x01)     */
#define GPREG_SET_FREEZE_REG_FRZ_SWTIM0_Pos   (1UL)                     /*!< GPREG SET_FREEZE_REG: FRZ_SWTIM0 (Bit 1)                    */
#define GPREG_SET_FREEZE_REG_FRZ_SWTIM0_Msk   (0x2UL)                   /*!< GPREG SET_FREEZE_REG: FRZ_SWTIM0 (Bitfield-Mask: 0x01)      */
#define GPREG_SET_FREEZE_REG_FRZ_BLETIM_Pos   (2UL)                     /*!< GPREG SET_FREEZE_REG: FRZ_BLETIM (Bit 2)                    */
#define GPREG_SET_FREEZE_REG_FRZ_BLETIM_Msk   (0x4UL)                   /*!< GPREG SET_FREEZE_REG: FRZ_BLETIM (Bitfield-Mask: 0x01)      */
#define GPREG_SET_FREEZE_REG_FRZ_WDOG_Pos     (3UL)                     /*!< GPREG SET_FREEZE_REG: FRZ_WDOG (Bit 3)                      */
#define GPREG_SET_FREEZE_REG_FRZ_WDOG_Msk     (0x8UL)                   /*!< GPREG SET_FREEZE_REG: FRZ_WDOG (Bitfield-Mask: 0x01)        */
#define GPREG_SET_FREEZE_REG_FRZ_USB_Pos      (4UL)                     /*!< GPREG SET_FREEZE_REG: FRZ_USB (Bit 4)                       */
#define GPREG_SET_FREEZE_REG_FRZ_USB_Msk      (0x10UL)                  /*!< GPREG SET_FREEZE_REG: FRZ_USB (Bitfield-Mask: 0x01)         */
#define GPREG_SET_FREEZE_REG_FRZ_DMA_Pos      (5UL)                     /*!< GPREG SET_FREEZE_REG: FRZ_DMA (Bit 5)                       */
#define GPREG_SET_FREEZE_REG_FRZ_DMA_Msk      (0x20UL)                  /*!< GPREG SET_FREEZE_REG: FRZ_DMA (Bitfield-Mask: 0x01)         */
#define GPREG_SET_FREEZE_REG_FRZ_SWTIM1_Pos   (6UL)                     /*!< GPREG SET_FREEZE_REG: FRZ_SWTIM1 (Bit 6)                    */
#define GPREG_SET_FREEZE_REG_FRZ_SWTIM1_Msk   (0x40UL)                  /*!< GPREG SET_FREEZE_REG: FRZ_SWTIM1 (Bitfield-Mask: 0x01)      */
#define GPREG_SET_FREEZE_REG_FRZ_SWTIM2_Pos   (7UL)                     /*!< GPREG SET_FREEZE_REG: FRZ_SWTIM2 (Bit 7)                    */
#define GPREG_SET_FREEZE_REG_FRZ_SWTIM2_Msk   (0x80UL)                  /*!< GPREG SET_FREEZE_REG: FRZ_SWTIM2 (Bitfield-Mask: 0x01)      */

/* ---------------------------  GPREG_RESET_FREEZE_REG  --------------------------- */
#define GPREG_RESET_FREEZE_REG_FRZ_WKUPTIM_Pos (0UL)                    /*!< GPREG RESET_FREEZE_REG: FRZ_WKUPTIM (Bit 0)                 */
#define GPREG_RESET_FREEZE_REG_FRZ_WKUPTIM_Msk (0x1UL)                  /*!< GPREG RESET_FREEZE_REG: FRZ_WKUPTIM (Bitfield-Mask: 0x01)   */
#define GPREG_RESET_FREEZE_REG_FRZ_SWTIM0_Pos (1UL)                     /*!< GPREG RESET_FREEZE_REG: FRZ_SWTIM0 (Bit 1)                  */
#define GPREG_RESET_FREEZE_REG_FRZ_SWTIM0_Msk (0x2UL)                   /*!< GPREG RESET_FREEZE_REG: FRZ_SWTIM0 (Bitfield-Mask: 0x01)    */
#define GPREG_RESET_FREEZE_REG_FRZ_BLETIM_Pos (2UL)                     /*!< GPREG RESET_FREEZE_REG: FRZ_BLETIM (Bit 2)                  */
#define GPREG_RESET_FREEZE_REG_FRZ_BLETIM_Msk (0x4UL)                   /*!< GPREG RESET_FREEZE_REG: FRZ_BLETIM (Bitfield-Mask: 0x01)    */
#define GPREG_RESET_FREEZE_REG_FRZ_WDOG_Pos   (3UL)                     /*!< GPREG RESET_FREEZE_REG: FRZ_WDOG (Bit 3)                    */
#define GPREG_RESET_FREEZE_REG_FRZ_WDOG_Msk   (0x8UL)                   /*!< GPREG RESET_FREEZE_REG: FRZ_WDOG (Bitfield-Mask: 0x01)      */
#define GPREG_RESET_FREEZE_REG_FRZ_USB_Pos    (4UL)                     /*!< GPREG RESET_FREEZE_REG: FRZ_USB (Bit 4)                     */
#define GPREG_RESET_FREEZE_REG_FRZ_USB_Msk    (0x10UL)                  /*!< GPREG RESET_FREEZE_REG: FRZ_USB (Bitfield-Mask: 0x01)       */
#define GPREG_RESET_FREEZE_REG_FRZ_DMA_Pos    (5UL)                     /*!< GPREG RESET_FREEZE_REG: FRZ_DMA (Bit 5)                     */
#define GPREG_RESET_FREEZE_REG_FRZ_DMA_Msk    (0x20UL)                  /*!< GPREG RESET_FREEZE_REG: FRZ_DMA (Bitfield-Mask: 0x01)       */
#define GPREG_RESET_FREEZE_REG_FRZ_SWTIM1_Pos (6UL)                     /*!< GPREG RESET_FREEZE_REG: FRZ_SWTIM1 (Bit 6)                  */
#define GPREG_RESET_FREEZE_REG_FRZ_SWTIM1_Msk (0x40UL)                  /*!< GPREG RESET_FREEZE_REG: FRZ_SWTIM1 (Bitfield-Mask: 0x01)    */
#define GPREG_RESET_FREEZE_REG_FRZ_SWTIM2_Pos (7UL)                     /*!< GPREG RESET_FREEZE_REG: FRZ_SWTIM2 (Bit 7)                  */
#define GPREG_RESET_FREEZE_REG_FRZ_SWTIM2_Msk (0x80UL)                  /*!< GPREG RESET_FREEZE_REG: FRZ_SWTIM2 (Bitfield-Mask: 0x01)    */

/* -------------------------------  GPREG_DEBUG_REG  ------------------------------ */
#define GPREG_DEBUG_REG_DEBUGS_FREEZE_EN_Pos  (0UL)                     /*!< GPREG DEBUG_REG: DEBUGS_FREEZE_EN (Bit 0)                   */
#define GPREG_DEBUG_REG_DEBUGS_FREEZE_EN_Msk  (0x1UL)                   /*!< GPREG DEBUG_REG: DEBUGS_FREEZE_EN (Bitfield-Mask: 0x01)     */

/* -----------------------------  GPREG_GP_STATUS_REG  ---------------------------- */
#define GPREG_GP_STATUS_REG_CAL_PHASE_Pos     (0UL)                     /*!< GPREG GP_STATUS_REG: CAL_PHASE (Bit 0)                      */
#define GPREG_GP_STATUS_REG_CAL_PHASE_Msk     (0x1UL)                   /*!< GPREG GP_STATUS_REG: CAL_PHASE (Bitfield-Mask: 0x01)        */

/* ----------------------------  GPREG_GP_CONTROL_REG  ---------------------------- */
#define GPREG_GP_CONTROL_REG_BLE_WAKEUP_REQ_Pos (0UL)                   /*!< GPREG GP_CONTROL_REG: BLE_WAKEUP_REQ (Bit 0)                */
#define GPREG_GP_CONTROL_REG_BLE_WAKEUP_REQ_Msk (0x1UL)                 /*!< GPREG GP_CONTROL_REG: BLE_WAKEUP_REQ (Bitfield-Mask: 0x01)  */
#define GPREG_GP_CONTROL_REG_BLE_H2H_BRIDGE_BYPASS_Pos (1UL)            /*!< GPREG GP_CONTROL_REG: BLE_H2H_BRIDGE_BYPASS (Bit 1)         */
#define GPREG_GP_CONTROL_REG_BLE_H2H_BRIDGE_BYPASS_Msk (0x2UL)          /*!< GPREG GP_CONTROL_REG: BLE_H2H_BRIDGE_BYPASS (Bitfield-Mask: 0x01) */
#define GPREG_GP_CONTROL_REG_BLE_WAKEUP_LP_IRQ_Pos (2UL)                /*!< GPREG GP_CONTROL_REG: BLE_WAKEUP_LP_IRQ (Bit 2)             */
#define GPREG_GP_CONTROL_REG_BLE_WAKEUP_LP_IRQ_Msk (0x4UL)              /*!< GPREG GP_CONTROL_REG: BLE_WAKEUP_LP_IRQ (Bitfield-Mask: 0x01) */
#define GPREG_GP_CONTROL_REG_BLE_DEEPSLDUR_MONITOR_Pos (8UL)            /*!< GPREG GP_CONTROL_REG: BLE_DEEPSLDUR_MONITOR (Bit 8)         */
#define GPREG_GP_CONTROL_REG_BLE_DEEPSLDUR_MONITOR_Msk (0xff00UL)       /*!< GPREG GP_CONTROL_REG: BLE_DEEPSLDUR_MONITOR (Bitfield-Mask: 0xff) */

/* ---------------------------  GPREG_ECC_BASE_ADDR_REG  -------------------------- */
#define GPREG_ECC_BASE_ADDR_REG_ECC_BASE_ADDR_Pos (0UL)                 /*!< GPREG ECC_BASE_ADDR_REG: ECC_BASE_ADDR (Bit 0)              */
#define GPREG_ECC_BASE_ADDR_REG_ECC_BASE_ADDR_Msk (0x7fUL)              /*!< GPREG ECC_BASE_ADDR_REG: ECC_BASE_ADDR (Bitfield-Mask: 0x7f) */

/* ----------------------------  GPREG_LED_CONTROL_REG  --------------------------- */
#define GPREG_LED_CONTROL_REG_LED1_SRC_SEL_Pos (0UL)                    /*!< GPREG LED_CONTROL_REG: LED1_SRC_SEL (Bit 0)                 */
#define GPREG_LED_CONTROL_REG_LED1_SRC_SEL_Msk (0x1UL)                  /*!< GPREG LED_CONTROL_REG: LED1_SRC_SEL (Bitfield-Mask: 0x01)   */
#define GPREG_LED_CONTROL_REG_LED2_SRC_SEL_Pos (1UL)                    /*!< GPREG LED_CONTROL_REG: LED2_SRC_SEL (Bit 1)                 */
#define GPREG_LED_CONTROL_REG_LED2_SRC_SEL_Msk (0x2UL)                  /*!< GPREG LED_CONTROL_REG: LED2_SRC_SEL (Bitfield-Mask: 0x01)   */
#define GPREG_LED_CONTROL_REG_LED3_SRC_SEL_Pos (2UL)                    /*!< GPREG LED_CONTROL_REG: LED3_SRC_SEL (Bit 2)                 */
#define GPREG_LED_CONTROL_REG_LED3_SRC_SEL_Msk (0x4UL)                  /*!< GPREG LED_CONTROL_REG: LED3_SRC_SEL (Bitfield-Mask: 0x01)   */
#define GPREG_LED_CONTROL_REG_LED1_EN_Pos     (3UL)                     /*!< GPREG LED_CONTROL_REG: LED1_EN (Bit 3)                      */
#define GPREG_LED_CONTROL_REG_LED1_EN_Msk     (0x8UL)                   /*!< GPREG LED_CONTROL_REG: LED1_EN (Bitfield-Mask: 0x01)        */
#define GPREG_LED_CONTROL_REG_LED2_EN_Pos     (4UL)                     /*!< GPREG LED_CONTROL_REG: LED2_EN (Bit 4)                      */
#define GPREG_LED_CONTROL_REG_LED2_EN_Msk     (0x10UL)                  /*!< GPREG LED_CONTROL_REG: LED2_EN (Bitfield-Mask: 0x01)        */
#define GPREG_LED_CONTROL_REG_LED3_EN_Pos     (5UL)                     /*!< GPREG LED_CONTROL_REG: LED3_EN (Bit 5)                      */
#define GPREG_LED_CONTROL_REG_LED3_EN_Msk     (0x20UL)                  /*!< GPREG LED_CONTROL_REG: LED3_EN (Bitfield-Mask: 0x01)        */

/* ---------------------------  GPREG_PLL_SYS_CTRL1_REG  -------------------------- */
#define GPREG_PLL_SYS_CTRL1_REG_PLL_EN_Pos    (0UL)                     /*!< GPREG PLL_SYS_CTRL1_REG: PLL_EN (Bit 0)                     */
#define GPREG_PLL_SYS_CTRL1_REG_PLL_EN_Msk    (0x1UL)                   /*!< GPREG PLL_SYS_CTRL1_REG: PLL_EN (Bitfield-Mask: 0x01)       */
#define GPREG_PLL_SYS_CTRL1_REG_LDO_PLL_ENABLE_Pos (1UL)                /*!< GPREG PLL_SYS_CTRL1_REG: LDO_PLL_ENABLE (Bit 1)             */
#define GPREG_PLL_SYS_CTRL1_REG_LDO_PLL_ENABLE_Msk (0x2UL)              /*!< GPREG PLL_SYS_CTRL1_REG: LDO_PLL_ENABLE (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_CTRL1_REG_LDO_PLL_VREF_HOLD_Pos (2UL)             /*!< GPREG PLL_SYS_CTRL1_REG: LDO_PLL_VREF_HOLD (Bit 2)          */
#define GPREG_PLL_SYS_CTRL1_REG_LDO_PLL_VREF_HOLD_Msk (0x4UL)           /*!< GPREG PLL_SYS_CTRL1_REG: LDO_PLL_VREF_HOLD (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_CTRL1_REG_PLL_R_DIV_Pos (8UL)                     /*!< GPREG PLL_SYS_CTRL1_REG: PLL_R_DIV (Bit 8)                  */
#define GPREG_PLL_SYS_CTRL1_REG_PLL_R_DIV_Msk (0x7f00UL)                /*!< GPREG PLL_SYS_CTRL1_REG: PLL_R_DIV (Bitfield-Mask: 0x7f)    */

/* ---------------------------  GPREG_PLL_SYS_CTRL2_REG  -------------------------- */
#define GPREG_PLL_SYS_CTRL2_REG_PLL_N_DIV_Pos (0UL)                     /*!< GPREG PLL_SYS_CTRL2_REG: PLL_N_DIV (Bit 0)                  */
#define GPREG_PLL_SYS_CTRL2_REG_PLL_N_DIV_Msk (0x7fUL)                  /*!< GPREG PLL_SYS_CTRL2_REG: PLL_N_DIV (Bitfield-Mask: 0x7f)    */
#define GPREG_PLL_SYS_CTRL2_REG_PLL_DEL_SEL_Pos (12UL)                  /*!< GPREG PLL_SYS_CTRL2_REG: PLL_DEL_SEL (Bit 12)               */
#define GPREG_PLL_SYS_CTRL2_REG_PLL_DEL_SEL_Msk (0x3000UL)              /*!< GPREG PLL_SYS_CTRL2_REG: PLL_DEL_SEL (Bitfield-Mask: 0x03)  */
#define GPREG_PLL_SYS_CTRL2_REG_PLL_SEL_MIN_CUR_INT_Pos (14UL)          /*!< GPREG PLL_SYS_CTRL2_REG: PLL_SEL_MIN_CUR_INT (Bit 14)       */
#define GPREG_PLL_SYS_CTRL2_REG_PLL_SEL_MIN_CUR_INT_Msk (0x4000UL)      /*!< GPREG PLL_SYS_CTRL2_REG: PLL_SEL_MIN_CUR_INT (Bitfield-Mask: 0x01) */

/* ---------------------------  GPREG_PLL_SYS_CTRL3_REG  -------------------------- */
#define GPREG_PLL_SYS_CTRL3_REG_PLL_ICP_SEL_Pos (0UL)                   /*!< GPREG PLL_SYS_CTRL3_REG: PLL_ICP_SEL (Bit 0)                */
#define GPREG_PLL_SYS_CTRL3_REG_PLL_ICP_SEL_Msk (0x1fUL)                /*!< GPREG PLL_SYS_CTRL3_REG: PLL_ICP_SEL (Bitfield-Mask: 0x1f)  */
#define GPREG_PLL_SYS_CTRL3_REG_PLL_START_DEL_Pos (10UL)                /*!< GPREG PLL_SYS_CTRL3_REG: PLL_START_DEL (Bit 10)             */
#define GPREG_PLL_SYS_CTRL3_REG_PLL_START_DEL_Msk (0x7c00UL)            /*!< GPREG PLL_SYS_CTRL3_REG: PLL_START_DEL (Bitfield-Mask: 0x1f) */
#define GPREG_PLL_SYS_CTRL3_REG_PLL_RECALIB_Pos (15UL)                  /*!< GPREG PLL_SYS_CTRL3_REG: PLL_RECALIB (Bit 15)               */
#define GPREG_PLL_SYS_CTRL3_REG_PLL_RECALIB_Msk (0x8000UL)              /*!< GPREG PLL_SYS_CTRL3_REG: PLL_RECALIB (Bitfield-Mask: 0x01)  */

/* --------------------------  GPREG_PLL_SYS_STATUS_REG  -------------------------- */
#define GPREG_PLL_SYS_STATUS_REG_PLL_LOCK_FINE_Pos (0UL)                /*!< GPREG PLL_SYS_STATUS_REG: PLL_LOCK_FINE (Bit 0)             */
#define GPREG_PLL_SYS_STATUS_REG_PLL_LOCK_FINE_Msk (0x1UL)              /*!< GPREG PLL_SYS_STATUS_REG: PLL_LOCK_FINE (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_STATUS_REG_LDO_PLL_OK_Pos (1UL)                   /*!< GPREG PLL_SYS_STATUS_REG: LDO_PLL_OK (Bit 1)                */
#define GPREG_PLL_SYS_STATUS_REG_LDO_PLL_OK_Msk (0x2UL)                 /*!< GPREG PLL_SYS_STATUS_REG: LDO_PLL_OK (Bitfield-Mask: 0x01)  */
#define GPREG_PLL_SYS_STATUS_REG_PLL_PLL_BEST_MIN_CUR_Pos (5UL)         /*!< GPREG PLL_SYS_STATUS_REG: PLL_PLL_BEST_MIN_CUR (Bit 5)      */
#define GPREG_PLL_SYS_STATUS_REG_PLL_PLL_BEST_MIN_CUR_Msk (0x7e0UL)     /*!< GPREG PLL_SYS_STATUS_REG: PLL_PLL_BEST_MIN_CUR (Bitfield-Mask: 0x3f) */
#define GPREG_PLL_SYS_STATUS_REG_PLL_CALIBR_END_Pos (11UL)              /*!< GPREG PLL_SYS_STATUS_REG: PLL_CALIBR_END (Bit 11)           */
#define GPREG_PLL_SYS_STATUS_REG_PLL_CALIBR_END_Msk (0x800UL)           /*!< GPREG PLL_SYS_STATUS_REG: PLL_CALIBR_END (Bitfield-Mask: 0x01) */

/* ---------------------------  GPREG_PLL_SYS_TEST_REG  --------------------------- */
#define GPREG_PLL_SYS_TEST_REG_PLL_DIS_LOOPFILT_Pos (0UL)               /*!< GPREG PLL_SYS_TEST_REG: PLL_DIS_LOOPFILT (Bit 0)            */
#define GPREG_PLL_SYS_TEST_REG_PLL_DIS_LOOPFILT_Msk (0x1UL)             /*!< GPREG PLL_SYS_TEST_REG: PLL_DIS_LOOPFILT (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_TEST_REG_PLL_MIN_CURRENT_Pos (1UL)                /*!< GPREG PLL_SYS_TEST_REG: PLL_MIN_CURRENT (Bit 1)             */
#define GPREG_PLL_SYS_TEST_REG_PLL_MIN_CURRENT_Msk (0x7eUL)             /*!< GPREG PLL_SYS_TEST_REG: PLL_MIN_CURRENT (Bitfield-Mask: 0x3f) */
#define GPREG_PLL_SYS_TEST_REG_PLL_TEST_VCTR_Pos (7UL)                  /*!< GPREG PLL_SYS_TEST_REG: PLL_TEST_VCTR (Bit 7)               */
#define GPREG_PLL_SYS_TEST_REG_PLL_TEST_VCTR_Msk (0x80UL)               /*!< GPREG PLL_SYS_TEST_REG: PLL_TEST_VCTR (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_TEST_REG_PLL_OPEN_LOOP_Pos (8UL)                  /*!< GPREG PLL_SYS_TEST_REG: PLL_OPEN_LOOP (Bit 8)               */
#define GPREG_PLL_SYS_TEST_REG_PLL_OPEN_LOOP_Msk (0x100UL)              /*!< GPREG PLL_SYS_TEST_REG: PLL_OPEN_LOOP (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_TEST_REG_PLL_CHANGE_Pos (9UL)                     /*!< GPREG PLL_SYS_TEST_REG: PLL_CHANGE (Bit 9)                  */
#define GPREG_PLL_SYS_TEST_REG_PLL_CHANGE_Msk (0x200UL)                 /*!< GPREG PLL_SYS_TEST_REG: PLL_CHANGE (Bitfield-Mask: 0x01)    */
#define GPREG_PLL_SYS_TEST_REG_PLL_SEL_N_DIV_TEST_Pos (10UL)            /*!< GPREG PLL_SYS_TEST_REG: PLL_SEL_N_DIV_TEST (Bit 10)         */
#define GPREG_PLL_SYS_TEST_REG_PLL_SEL_N_DIV_TEST_Msk (0x400UL)         /*!< GPREG PLL_SYS_TEST_REG: PLL_SEL_N_DIV_TEST (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_TEST_REG_PLL_SEL_R_DIV_TEST_Pos (11UL)            /*!< GPREG PLL_SYS_TEST_REG: PLL_SEL_R_DIV_TEST (Bit 11)         */
#define GPREG_PLL_SYS_TEST_REG_PLL_SEL_R_DIV_TEST_Msk (0x800UL)         /*!< GPREG PLL_SYS_TEST_REG: PLL_SEL_R_DIV_TEST (Bitfield-Mask: 0x01) */
#define GPREG_PLL_SYS_TEST_REG_PLL_LOCK_DET_RES_CNT_Pos (13UL)          /*!< GPREG PLL_SYS_TEST_REG: PLL_LOCK_DET_RES_CNT (Bit 13)       */
#define GPREG_PLL_SYS_TEST_REG_PLL_LOCK_DET_RES_CNT_Msk (0xe000UL)      /*!< GPREG PLL_SYS_TEST_REG: PLL_LOCK_DET_RES_CNT (Bitfield-Mask: 0x07) */


/* ================================================================================ */
/* ================          struct 'I2C' Position & Mask          ================ */
/* ================================================================================ */


/* -------------------------------  I2C_I2C_CON_REG  ------------------------------ */
#define I2C_I2C_CON_REG_I2C_MASTER_MODE_Pos   (0UL)                     /*!< I2C I2C_CON_REG: I2C_MASTER_MODE (Bit 0)                    */
#define I2C_I2C_CON_REG_I2C_MASTER_MODE_Msk   (0x1UL)                   /*!< I2C I2C_CON_REG: I2C_MASTER_MODE (Bitfield-Mask: 0x01)      */
#define I2C_I2C_CON_REG_I2C_SPEED_Pos         (1UL)                     /*!< I2C I2C_CON_REG: I2C_SPEED (Bit 1)                          */
#define I2C_I2C_CON_REG_I2C_SPEED_Msk         (0x6UL)                   /*!< I2C I2C_CON_REG: I2C_SPEED (Bitfield-Mask: 0x03)            */
#define I2C_I2C_CON_REG_I2C_10BITADDR_SLAVE_Pos (3UL)                   /*!< I2C I2C_CON_REG: I2C_10BITADDR_SLAVE (Bit 3)                */
#define I2C_I2C_CON_REG_I2C_10BITADDR_SLAVE_Msk (0x8UL)                 /*!< I2C I2C_CON_REG: I2C_10BITADDR_SLAVE (Bitfield-Mask: 0x01)  */
#define I2C_I2C_CON_REG_I2C_10BITADDR_MASTER_Pos (4UL)                  /*!< I2C I2C_CON_REG: I2C_10BITADDR_MASTER (Bit 4)               */
#define I2C_I2C_CON_REG_I2C_10BITADDR_MASTER_Msk (0x10UL)               /*!< I2C I2C_CON_REG: I2C_10BITADDR_MASTER (Bitfield-Mask: 0x01) */
#define I2C_I2C_CON_REG_I2C_RESTART_EN_Pos    (5UL)                     /*!< I2C I2C_CON_REG: I2C_RESTART_EN (Bit 5)                     */
#define I2C_I2C_CON_REG_I2C_RESTART_EN_Msk    (0x20UL)                  /*!< I2C I2C_CON_REG: I2C_RESTART_EN (Bitfield-Mask: 0x01)       */
#define I2C_I2C_CON_REG_I2C_SLAVE_DISABLE_Pos (6UL)                     /*!< I2C I2C_CON_REG: I2C_SLAVE_DISABLE (Bit 6)                  */
#define I2C_I2C_CON_REG_I2C_SLAVE_DISABLE_Msk (0x40UL)                  /*!< I2C I2C_CON_REG: I2C_SLAVE_DISABLE (Bitfield-Mask: 0x01)    */

