openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* --------------------------  I2C_I2C_RAW_INTR_STAT_REG  ------------------------- */
#define I2C_I2C_RAW_INTR_STAT_REG_RX_UNDER_Pos (0UL)                    /*!< I2C I2C_RAW_INTR_STAT_REG: RX_UNDER (Bit 0)                 */
#define I2C_I2C_RAW_INTR_STAT_REG_RX_UNDER_Msk (0x1UL)                  /*!< I2C I2C_RAW_INTR_STAT_REG: RX_UNDER (Bitfield-Mask: 0x01)   */
#define I2C_I2C_RAW_INTR_STAT_REG_RX_OVER_Pos (1UL)                     /*!< I2C I2C_RAW_INTR_STAT_REG: RX_OVER (Bit 1)                  */
#define I2C_I2C_RAW_INTR_STAT_REG_RX_OVER_Msk (0x2UL)                   /*!< I2C I2C_RAW_INTR_STAT_REG: RX_OVER (Bitfield-Mask: 0x01)    */
#define I2C_I2C_RAW_INTR_STAT_REG_RX_FULL_Pos (2UL)                     /*!< I2C I2C_RAW_INTR_STAT_REG: RX_FULL (Bit 2)                  */
#define I2C_I2C_RAW_INTR_STAT_REG_RX_FULL_Msk (0x4UL)                   /*!< I2C I2C_RAW_INTR_STAT_REG: RX_FULL (Bitfield-Mask: 0x01)    */
#define I2C_I2C_RAW_INTR_STAT_REG_TX_OVER_Pos (3UL)                     /*!< I2C I2C_RAW_INTR_STAT_REG: TX_OVER (Bit 3)                  */
#define I2C_I2C_RAW_INTR_STAT_REG_TX_OVER_Msk (0x8UL)                   /*!< I2C I2C_RAW_INTR_STAT_REG: TX_OVER (Bitfield-Mask: 0x01)    */
#define I2C_I2C_RAW_INTR_STAT_REG_TX_EMPTY_Pos (4UL)                    /*!< I2C I2C_RAW_INTR_STAT_REG: TX_EMPTY (Bit 4)                 */
#define I2C_I2C_RAW_INTR_STAT_REG_TX_EMPTY_Msk (0x10UL)                 /*!< I2C I2C_RAW_INTR_STAT_REG: TX_EMPTY (Bitfield-Mask: 0x01)   */
#define I2C_I2C_RAW_INTR_STAT_REG_RD_REQ_Pos  (5UL)                     /*!< I2C I2C_RAW_INTR_STAT_REG: RD_REQ (Bit 5)                   */
#define I2C_I2C_RAW_INTR_STAT_REG_RD_REQ_Msk  (0x20UL)                  /*!< I2C I2C_RAW_INTR_STAT_REG: RD_REQ (Bitfield-Mask: 0x01)     */
#define I2C_I2C_RAW_INTR_STAT_REG_TX_ABRT_Pos (6UL)                     /*!< I2C I2C_RAW_INTR_STAT_REG: TX_ABRT (Bit 6)                  */
#define I2C_I2C_RAW_INTR_STAT_REG_TX_ABRT_Msk (0x40UL)                  /*!< I2C I2C_RAW_INTR_STAT_REG: TX_ABRT (Bitfield-Mask: 0x01)    */
#define I2C_I2C_RAW_INTR_STAT_REG_RX_DONE_Pos (7UL)                     /*!< I2C I2C_RAW_INTR_STAT_REG: RX_DONE (Bit 7)                  */
#define I2C_I2C_RAW_INTR_STAT_REG_RX_DONE_Msk (0x80UL)                  /*!< I2C I2C_RAW_INTR_STAT_REG: RX_DONE (Bitfield-Mask: 0x01)    */
#define I2C_I2C_RAW_INTR_STAT_REG_ACTIVITY_Pos (8UL)                    /*!< I2C I2C_RAW_INTR_STAT_REG: ACTIVITY (Bit 8)                 */
#define I2C_I2C_RAW_INTR_STAT_REG_ACTIVITY_Msk (0x100UL)                /*!< I2C I2C_RAW_INTR_STAT_REG: ACTIVITY (Bitfield-Mask: 0x01)   */
#define I2C_I2C_RAW_INTR_STAT_REG_STOP_DET_Pos (9UL)                    /*!< I2C I2C_RAW_INTR_STAT_REG: STOP_DET (Bit 9)                 */
#define I2C_I2C_RAW_INTR_STAT_REG_STOP_DET_Msk (0x200UL)                /*!< I2C I2C_RAW_INTR_STAT_REG: STOP_DET (Bitfield-Mask: 0x01)   */
#define I2C_I2C_RAW_INTR_STAT_REG_START_DET_Pos (10UL)                  /*!< I2C I2C_RAW_INTR_STAT_REG: START_DET (Bit 10)               */
#define I2C_I2C_RAW_INTR_STAT_REG_START_DET_Msk (0x400UL)               /*!< I2C I2C_RAW_INTR_STAT_REG: START_DET (Bitfield-Mask: 0x01)  */
#define I2C_I2C_RAW_INTR_STAT_REG_GEN_CALL_Pos (11UL)                   /*!< I2C I2C_RAW_INTR_STAT_REG: GEN_CALL (Bit 11)                */
#define I2C_I2C_RAW_INTR_STAT_REG_GEN_CALL_Msk (0x800UL)                /*!< I2C I2C_RAW_INTR_STAT_REG: GEN_CALL (Bitfield-Mask: 0x01)   */

/* ------------------------------  I2C_I2C_RX_TL_REG  ----------------------------- */
#define I2C_I2C_RX_TL_REG_RX_TL_Pos           (0UL)                     /*!< I2C I2C_RX_TL_REG: RX_TL (Bit 0)                            */
#define I2C_I2C_RX_TL_REG_RX_TL_Msk           (0x1fUL)                  /*!< I2C I2C_RX_TL_REG: RX_TL (Bitfield-Mask: 0x1f)              */

/* ------------------------------  I2C_I2C_TX_TL_REG  ----------------------------- */
#define I2C_I2C_TX_TL_REG_RX_TL_Pos           (0UL)                     /*!< I2C I2C_TX_TL_REG: RX_TL (Bit 0)                            */
#define I2C_I2C_TX_TL_REG_RX_TL_Msk           (0x1fUL)                  /*!< I2C I2C_TX_TL_REG: RX_TL (Bitfield-Mask: 0x1f)              */

/* ----------------------------  I2C_I2C_CLR_INTR_REG  ---------------------------- */
#define I2C_I2C_CLR_INTR_REG_CLR_INTR_Pos     (0UL)                     /*!< I2C I2C_CLR_INTR_REG: CLR_INTR (Bit 0)                      */
#define I2C_I2C_CLR_INTR_REG_CLR_INTR_Msk     (0x1UL)                   /*!< I2C I2C_CLR_INTR_REG: CLR_INTR (Bitfield-Mask: 0x01)        */

/* --------------------------  I2C_I2C_CLR_RX_UNDER_REG  -------------------------- */
#define I2C_I2C_CLR_RX_UNDER_REG_CLR_RX_UNDER_Pos (0UL)                 /*!< I2C I2C_CLR_RX_UNDER_REG: CLR_RX_UNDER (Bit 0)              */
#define I2C_I2C_CLR_RX_UNDER_REG_CLR_RX_UNDER_Msk (0x1UL)               /*!< I2C I2C_CLR_RX_UNDER_REG: CLR_RX_UNDER (Bitfield-Mask: 0x01) */

/* ---------------------------  I2C_I2C_CLR_RX_OVER_REG  -------------------------- */
#define I2C_I2C_CLR_RX_OVER_REG_CLR_RX_OVER_Pos (0UL)                   /*!< I2C I2C_CLR_RX_OVER_REG: CLR_RX_OVER (Bit 0)                */
#define I2C_I2C_CLR_RX_OVER_REG_CLR_RX_OVER_Msk (0x1UL)                 /*!< I2C I2C_CLR_RX_OVER_REG: CLR_RX_OVER (Bitfield-Mask: 0x01)  */

/* ---------------------------  I2C_I2C_CLR_TX_OVER_REG  -------------------------- */
#define I2C_I2C_CLR_TX_OVER_REG_CLR_TX_OVER_Pos (0UL)                   /*!< I2C I2C_CLR_TX_OVER_REG: CLR_TX_OVER (Bit 0)                */
#define I2C_I2C_CLR_TX_OVER_REG_CLR_TX_OVER_Msk (0x1UL)                 /*!< I2C I2C_CLR_TX_OVER_REG: CLR_TX_OVER (Bitfield-Mask: 0x01)  */

/* ---------------------------  I2C_I2C_CLR_RD_REQ_REG  --------------------------- */
#define I2C_I2C_CLR_RD_REQ_REG_CLR_RD_REQ_Pos (0UL)                     /*!< I2C I2C_CLR_RD_REQ_REG: CLR_RD_REQ (Bit 0)                  */
#define I2C_I2C_CLR_RD_REQ_REG_CLR_RD_REQ_Msk (0x1UL)                   /*!< I2C I2C_CLR_RD_REQ_REG: CLR_RD_REQ (Bitfield-Mask: 0x01)    */

/* ---------------------------  I2C_I2C_CLR_TX_ABRT_REG  -------------------------- */
#define I2C_I2C_CLR_TX_ABRT_REG_CLR_TX_ABRT_Pos (0UL)                   /*!< I2C I2C_CLR_TX_ABRT_REG: CLR_TX_ABRT (Bit 0)                */
#define I2C_I2C_CLR_TX_ABRT_REG_CLR_TX_ABRT_Msk (0x1UL)                 /*!< I2C I2C_CLR_TX_ABRT_REG: CLR_TX_ABRT (Bitfield-Mask: 0x01)  */

/* ---------------------------  I2C_I2C_CLR_RX_DONE_REG  -------------------------- */
#define I2C_I2C_CLR_RX_DONE_REG_CLR_RX_DONE_Pos (0UL)                   /*!< I2C I2C_CLR_RX_DONE_REG: CLR_RX_DONE (Bit 0)                */
#define I2C_I2C_CLR_RX_DONE_REG_CLR_RX_DONE_Msk (0x1UL)                 /*!< I2C I2C_CLR_RX_DONE_REG: CLR_RX_DONE (Bitfield-Mask: 0x01)  */

/* --------------------------  I2C_I2C_CLR_ACTIVITY_REG  -------------------------- */
#define I2C_I2C_CLR_ACTIVITY_REG_CLR_ACTIVITY_Pos (0UL)                 /*!< I2C I2C_CLR_ACTIVITY_REG: CLR_ACTIVITY (Bit 0)              */
#define I2C_I2C_CLR_ACTIVITY_REG_CLR_ACTIVITY_Msk (0x1UL)               /*!< I2C I2C_CLR_ACTIVITY_REG: CLR_ACTIVITY (Bitfield-Mask: 0x01) */

/* --------------------------  I2C_I2C_CLR_STOP_DET_REG  -------------------------- */
#define I2C_I2C_CLR_STOP_DET_REG_CLR_ACTIVITY_Pos (0UL)                 /*!< I2C I2C_CLR_STOP_DET_REG: CLR_ACTIVITY (Bit 0)              */
#define I2C_I2C_CLR_STOP_DET_REG_CLR_ACTIVITY_Msk (0x1UL)               /*!< I2C I2C_CLR_STOP_DET_REG: CLR_ACTIVITY (Bitfield-Mask: 0x01) */

