openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* --------------------------  I2C_I2C_CLR_START_DET_REG  ------------------------- */
#define I2C_I2C_CLR_START_DET_REG_CLR_START_DET_Pos (0UL)               /*!< I2C I2C_CLR_START_DET_REG: CLR_START_DET (Bit 0)            */
#define I2C_I2C_CLR_START_DET_REG_CLR_START_DET_Msk (0x1UL)             /*!< I2C I2C_CLR_START_DET_REG: CLR_START_DET (Bitfield-Mask: 0x01) */

/* --------------------------  I2C_I2C_CLR_GEN_CALL_REG  -------------------------- */
#define I2C_I2C_CLR_GEN_CALL_REG_CLR_GEN_CALL_Pos (0UL)                 /*!< I2C I2C_CLR_GEN_CALL_REG: CLR_GEN_CALL (Bit 0)              */
#define I2C_I2C_CLR_GEN_CALL_REG_CLR_GEN_CALL_Msk (0x1UL)               /*!< I2C I2C_CLR_GEN_CALL_REG: CLR_GEN_CALL (Bitfield-Mask: 0x01) */

/* -----------------------------  I2C_I2C_ENABLE_REG  ----------------------------- */
#define I2C_I2C_ENABLE_REG_CTRL_ENABLE_Pos    (0UL)                     /*!< I2C I2C_ENABLE_REG: CTRL_ENABLE (Bit 0)                     */
#define I2C_I2C_ENABLE_REG_CTRL_ENABLE_Msk    (0x1UL)                   /*!< I2C I2C_ENABLE_REG: CTRL_ENABLE (Bitfield-Mask: 0x01)       */

/* -----------------------------  I2C_I2C_STATUS_REG  ----------------------------- */
#define I2C_I2C_STATUS_REG_I2C_ACTIVITY_Pos   (0UL)                     /*!< I2C I2C_STATUS_REG: I2C_ACTIVITY (Bit 0)                    */
#define I2C_I2C_STATUS_REG_I2C_ACTIVITY_Msk   (0x1UL)                   /*!< I2C I2C_STATUS_REG: I2C_ACTIVITY (Bitfield-Mask: 0x01)      */
#define I2C_I2C_STATUS_REG_TFNF_Pos           (1UL)                     /*!< I2C I2C_STATUS_REG: TFNF (Bit 1)                            */
#define I2C_I2C_STATUS_REG_TFNF_Msk           (0x2UL)                   /*!< I2C I2C_STATUS_REG: TFNF (Bitfield-Mask: 0x01)              */
#define I2C_I2C_STATUS_REG_TFE_Pos            (2UL)                     /*!< I2C I2C_STATUS_REG: TFE (Bit 2)                             */
#define I2C_I2C_STATUS_REG_TFE_Msk            (0x4UL)                   /*!< I2C I2C_STATUS_REG: TFE (Bitfield-Mask: 0x01)               */
#define I2C_I2C_STATUS_REG_RFNE_Pos           (3UL)                     /*!< I2C I2C_STATUS_REG: RFNE (Bit 3)                            */
#define I2C_I2C_STATUS_REG_RFNE_Msk           (0x8UL)                   /*!< I2C I2C_STATUS_REG: RFNE (Bitfield-Mask: 0x01)              */
#define I2C_I2C_STATUS_REG_RFF_Pos            (4UL)                     /*!< I2C I2C_STATUS_REG: RFF (Bit 4)                             */
#define I2C_I2C_STATUS_REG_RFF_Msk            (0x10UL)                  /*!< I2C I2C_STATUS_REG: RFF (Bitfield-Mask: 0x01)               */
#define I2C_I2C_STATUS_REG_MST_ACTIVITY_Pos   (5UL)                     /*!< I2C I2C_STATUS_REG: MST_ACTIVITY (Bit 5)                    */
#define I2C_I2C_STATUS_REG_MST_ACTIVITY_Msk   (0x20UL)                  /*!< I2C I2C_STATUS_REG: MST_ACTIVITY (Bitfield-Mask: 0x01)      */
#define I2C_I2C_STATUS_REG_SLV_ACTIVITY_Pos   (6UL)                     /*!< I2C I2C_STATUS_REG: SLV_ACTIVITY (Bit 6)                    */
#define I2C_I2C_STATUS_REG_SLV_ACTIVITY_Msk   (0x40UL)                  /*!< I2C I2C_STATUS_REG: SLV_ACTIVITY (Bitfield-Mask: 0x01)      */

/* ------------------------------  I2C_I2C_TXFLR_REG  ----------------------------- */
#define I2C_I2C_TXFLR_REG_TXFLR_Pos           (0UL)                     /*!< I2C I2C_TXFLR_REG: TXFLR (Bit 0)                            */
#define I2C_I2C_TXFLR_REG_TXFLR_Msk           (0x3fUL)                  /*!< I2C I2C_TXFLR_REG: TXFLR (Bitfield-Mask: 0x3f)              */

/* ------------------------------  I2C_I2C_RXFLR_REG  ----------------------------- */
#define I2C_I2C_RXFLR_REG_RXFLR_Pos           (0UL)                     /*!< I2C I2C_RXFLR_REG: RXFLR (Bit 0)                            */
#define I2C_I2C_RXFLR_REG_RXFLR_Msk           (0x3fUL)                  /*!< I2C I2C_RXFLR_REG: RXFLR (Bitfield-Mask: 0x3f)              */

/* ----------------------------  I2C_I2C_SDA_HOLD_REG  ---------------------------- */
#define I2C_I2C_SDA_HOLD_REG_IC_SDA_HOLD_Pos  (0UL)                     /*!< I2C I2C_SDA_HOLD_REG: IC_SDA_HOLD (Bit 0)                   */
#define I2C_I2C_SDA_HOLD_REG_IC_SDA_HOLD_Msk  (0xffffUL)                /*!< I2C I2C_SDA_HOLD_REG: IC_SDA_HOLD (Bitfield-Mask: 0xffff)   */

/* -------------------------  I2C_I2C_TX_ABRT_SOURCE_REG  ------------------------- */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_7B_ADDR_NOACK_Pos (0UL)         /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_7B_ADDR_NOACK (Bit 0)      */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_7B_ADDR_NOACK_Msk (0x1UL)       /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_7B_ADDR_NOACK (Bitfield-Mask: 0x01) */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_10ADDR1_NOACK_Pos (1UL)         /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_10ADDR1_NOACK (Bit 1)      */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_10ADDR1_NOACK_Msk (0x2UL)       /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_10ADDR1_NOACK (Bitfield-Mask: 0x01) */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_10ADDR2_NOACK_Pos (2UL)         /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_10ADDR2_NOACK (Bit 2)      */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_10ADDR2_NOACK_Msk (0x4UL)       /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_10ADDR2_NOACK (Bitfield-Mask: 0x01) */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_TXDATA_NOACK_Pos (3UL)          /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_TXDATA_NOACK (Bit 3)       */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_TXDATA_NOACK_Msk (0x8UL)        /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_TXDATA_NOACK (Bitfield-Mask: 0x01) */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_GCALL_NOACK_Pos (4UL)           /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_GCALL_NOACK (Bit 4)        */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_GCALL_NOACK_Msk (0x10UL)        /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_GCALL_NOACK (Bitfield-Mask: 0x01) */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_GCALL_READ_Pos (5UL)            /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_GCALL_READ (Bit 5)         */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_GCALL_READ_Msk (0x20UL)         /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_GCALL_READ (Bitfield-Mask: 0x01) */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_HS_ACKDET_Pos (6UL)             /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_HS_ACKDET (Bit 6)          */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_HS_ACKDET_Msk (0x40UL)          /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_HS_ACKDET (Bitfield-Mask: 0x01) */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_SBYTE_ACKDET_Pos (7UL)          /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_SBYTE_ACKDET (Bit 7)       */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_SBYTE_ACKDET_Msk (0x80UL)       /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_SBYTE_ACKDET (Bitfield-Mask: 0x01) */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_HS_NORSTRT_Pos (8UL)            /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_HS_NORSTRT (Bit 8)         */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_HS_NORSTRT_Msk (0x100UL)        /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_HS_NORSTRT (Bitfield-Mask: 0x01) */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_SBYTE_NORSTRT_Pos (9UL)         /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_SBYTE_NORSTRT (Bit 9)      */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_SBYTE_NORSTRT_Msk (0x200UL)     /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_SBYTE_NORSTRT (Bitfield-Mask: 0x01) */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_10B_RD_NORSTRT_Pos (10UL)       /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_10B_RD_NORSTRT (Bit 10)    */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_10B_RD_NORSTRT_Msk (0x400UL)    /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_10B_RD_NORSTRT (Bitfield-Mask: 0x01) */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_MASTER_DIS_Pos (11UL)           /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_MASTER_DIS (Bit 11)        */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_MASTER_DIS_Msk (0x800UL)        /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_MASTER_DIS (Bitfield-Mask: 0x01) */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ARB_LOST_Pos (12UL)                  /*!< I2C I2C_TX_ABRT_SOURCE_REG: ARB_LOST (Bit 12)               */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ARB_LOST_Msk (0x1000UL)              /*!< I2C I2C_TX_ABRT_SOURCE_REG: ARB_LOST (Bitfield-Mask: 0x01)  */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_SLVFLUSH_TXFIFO_Pos (13UL)      /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_SLVFLUSH_TXFIFO (Bit 13)   */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_SLVFLUSH_TXFIFO_Msk (0x2000UL)  /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_SLVFLUSH_TXFIFO (Bitfield-Mask: 0x01) */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_SLV_ARBLOST_Pos (14UL)          /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_SLV_ARBLOST (Bit 14)       */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_SLV_ARBLOST_Msk (0x4000UL)      /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_SLV_ARBLOST (Bitfield-Mask: 0x01) */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_SLVRD_INTX_Pos (15UL)           /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_SLVRD_INTX (Bit 15)        */
#define I2C_I2C_TX_ABRT_SOURCE_REG_ABRT_SLVRD_INTX_Msk (0x8000UL)       /*!< I2C I2C_TX_ABRT_SOURCE_REG: ABRT_SLVRD_INTX (Bitfield-Mask: 0x01) */

/* -----------------------------  I2C_I2C_DMA_CR_REG  ----------------------------- */
#define I2C_I2C_DMA_CR_REG_RDMAE_Pos          (0UL)                     /*!< I2C I2C_DMA_CR_REG: RDMAE (Bit 0)                           */
#define I2C_I2C_DMA_CR_REG_RDMAE_Msk          (0x1UL)                   /*!< I2C I2C_DMA_CR_REG: RDMAE (Bitfield-Mask: 0x01)             */
#define I2C_I2C_DMA_CR_REG_TDMAE_Pos          (1UL)                     /*!< I2C I2C_DMA_CR_REG: TDMAE (Bit 1)                           */
#define I2C_I2C_DMA_CR_REG_TDMAE_Msk          (0x2UL)                   /*!< I2C I2C_DMA_CR_REG: TDMAE (Bitfield-Mask: 0x01)             */

