openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* --------------------------  I2C2_I2C2_CLR_TX_OVER_REG  ------------------------- */
#define I2C2_I2C2_CLR_TX_OVER_REG_CLR_TX_OVER_Pos (0UL)                 /*!< I2C2 I2C2_CLR_TX_OVER_REG: CLR_TX_OVER (Bit 0)              */
#define I2C2_I2C2_CLR_TX_OVER_REG_CLR_TX_OVER_Msk (0x1UL)               /*!< I2C2 I2C2_CLR_TX_OVER_REG: CLR_TX_OVER (Bitfield-Mask: 0x01) */

/* --------------------------  I2C2_I2C2_CLR_RD_REQ_REG  -------------------------- */
#define I2C2_I2C2_CLR_RD_REQ_REG_CLR_RD_REQ_Pos (0UL)                   /*!< I2C2 I2C2_CLR_RD_REQ_REG: CLR_RD_REQ (Bit 0)                */
#define I2C2_I2C2_CLR_RD_REQ_REG_CLR_RD_REQ_Msk (0x1UL)                 /*!< I2C2 I2C2_CLR_RD_REQ_REG: CLR_RD_REQ (Bitfield-Mask: 0x01)  */

/* --------------------------  I2C2_I2C2_CLR_TX_ABRT_REG  ------------------------- */
#define I2C2_I2C2_CLR_TX_ABRT_REG_CLR_TX_ABRT_Pos (0UL)                 /*!< I2C2 I2C2_CLR_TX_ABRT_REG: CLR_TX_ABRT (Bit 0)              */
#define I2C2_I2C2_CLR_TX_ABRT_REG_CLR_TX_ABRT_Msk (0x1UL)               /*!< I2C2 I2C2_CLR_TX_ABRT_REG: CLR_TX_ABRT (Bitfield-Mask: 0x01) */

/* --------------------------  I2C2_I2C2_CLR_RX_DONE_REG  ------------------------- */
#define I2C2_I2C2_CLR_RX_DONE_REG_CLR_RX_DONE_Pos (0UL)                 /*!< I2C2 I2C2_CLR_RX_DONE_REG: CLR_RX_DONE (Bit 0)              */
#define I2C2_I2C2_CLR_RX_DONE_REG_CLR_RX_DONE_Msk (0x1UL)               /*!< I2C2 I2C2_CLR_RX_DONE_REG: CLR_RX_DONE (Bitfield-Mask: 0x01) */

/* -------------------------  I2C2_I2C2_CLR_ACTIVITY_REG  ------------------------- */
#define I2C2_I2C2_CLR_ACTIVITY_REG_CLR_ACTIVITY_Pos (0UL)               /*!< I2C2 I2C2_CLR_ACTIVITY_REG: CLR_ACTIVITY (Bit 0)            */
#define I2C2_I2C2_CLR_ACTIVITY_REG_CLR_ACTIVITY_Msk (0x1UL)             /*!< I2C2 I2C2_CLR_ACTIVITY_REG: CLR_ACTIVITY (Bitfield-Mask: 0x01) */

/* -------------------------  I2C2_I2C2_CLR_STOP_DET_REG  ------------------------- */
#define I2C2_I2C2_CLR_STOP_DET_REG_CLR_ACTIVITY_Pos (0UL)               /*!< I2C2 I2C2_CLR_STOP_DET_REG: CLR_ACTIVITY (Bit 0)            */
#define I2C2_I2C2_CLR_STOP_DET_REG_CLR_ACTIVITY_Msk (0x1UL)             /*!< I2C2 I2C2_CLR_STOP_DET_REG: CLR_ACTIVITY (Bitfield-Mask: 0x01) */

/* -------------------------  I2C2_I2C2_CLR_START_DET_REG  ------------------------ */
#define I2C2_I2C2_CLR_START_DET_REG_CLR_START_DET_Pos (0UL)             /*!< I2C2 I2C2_CLR_START_DET_REG: CLR_START_DET (Bit 0)          */
#define I2C2_I2C2_CLR_START_DET_REG_CLR_START_DET_Msk (0x1UL)           /*!< I2C2 I2C2_CLR_START_DET_REG: CLR_START_DET (Bitfield-Mask: 0x01) */

/* -------------------------  I2C2_I2C2_CLR_GEN_CALL_REG  ------------------------- */
#define I2C2_I2C2_CLR_GEN_CALL_REG_CLR_GEN_CALL_Pos (0UL)               /*!< I2C2 I2C2_CLR_GEN_CALL_REG: CLR_GEN_CALL (Bit 0)            */
#define I2C2_I2C2_CLR_GEN_CALL_REG_CLR_GEN_CALL_Msk (0x1UL)             /*!< I2C2 I2C2_CLR_GEN_CALL_REG: CLR_GEN_CALL (Bitfield-Mask: 0x01) */

/* ----------------------------  I2C2_I2C2_ENABLE_REG  ---------------------------- */
#define I2C2_I2C2_ENABLE_REG_CTRL_ENABLE_Pos  (0UL)                     /*!< I2C2 I2C2_ENABLE_REG: CTRL_ENABLE (Bit 0)                   */
#define I2C2_I2C2_ENABLE_REG_CTRL_ENABLE_Msk  (0x1UL)                   /*!< I2C2 I2C2_ENABLE_REG: CTRL_ENABLE (Bitfield-Mask: 0x01)     */

/* ----------------------------  I2C2_I2C2_STATUS_REG  ---------------------------- */
#define I2C2_I2C2_STATUS_REG_I2C_ACTIVITY_Pos (0UL)                     /*!< I2C2 I2C2_STATUS_REG: I2C_ACTIVITY (Bit 0)                  */
#define I2C2_I2C2_STATUS_REG_I2C_ACTIVITY_Msk (0x1UL)                   /*!< I2C2 I2C2_STATUS_REG: I2C_ACTIVITY (Bitfield-Mask: 0x01)    */
#define I2C2_I2C2_STATUS_REG_TFNF_Pos         (1UL)                     /*!< I2C2 I2C2_STATUS_REG: TFNF (Bit 1)                          */
#define I2C2_I2C2_STATUS_REG_TFNF_Msk         (0x2UL)                   /*!< I2C2 I2C2_STATUS_REG: TFNF (Bitfield-Mask: 0x01)            */
#define I2C2_I2C2_STATUS_REG_TFE_Pos          (2UL)                     /*!< I2C2 I2C2_STATUS_REG: TFE (Bit 2)                           */
#define I2C2_I2C2_STATUS_REG_TFE_Msk          (0x4UL)                   /*!< I2C2 I2C2_STATUS_REG: TFE (Bitfield-Mask: 0x01)             */
#define I2C2_I2C2_STATUS_REG_RFNE_Pos         (3UL)                     /*!< I2C2 I2C2_STATUS_REG: RFNE (Bit 3)                          */
#define I2C2_I2C2_STATUS_REG_RFNE_Msk         (0x8UL)                   /*!< I2C2 I2C2_STATUS_REG: RFNE (Bitfield-Mask: 0x01)            */
#define I2C2_I2C2_STATUS_REG_RFF_Pos          (4UL)                     /*!< I2C2 I2C2_STATUS_REG: RFF (Bit 4)                           */
#define I2C2_I2C2_STATUS_REG_RFF_Msk          (0x10UL)                  /*!< I2C2 I2C2_STATUS_REG: RFF (Bitfield-Mask: 0x01)             */
#define I2C2_I2C2_STATUS_REG_MST_ACTIVITY_Pos (5UL)                     /*!< I2C2 I2C2_STATUS_REG: MST_ACTIVITY (Bit 5)                  */
#define I2C2_I2C2_STATUS_REG_MST_ACTIVITY_Msk (0x20UL)                  /*!< I2C2 I2C2_STATUS_REG: MST_ACTIVITY (Bitfield-Mask: 0x01)    */
#define I2C2_I2C2_STATUS_REG_SLV_ACTIVITY_Pos (6UL)                     /*!< I2C2 I2C2_STATUS_REG: SLV_ACTIVITY (Bit 6)                  */
#define I2C2_I2C2_STATUS_REG_SLV_ACTIVITY_Msk (0x40UL)                  /*!< I2C2 I2C2_STATUS_REG: SLV_ACTIVITY (Bitfield-Mask: 0x01)    */

/* -----------------------------  I2C2_I2C2_TXFLR_REG  ---------------------------- */
#define I2C2_I2C2_TXFLR_REG_TXFLR_Pos         (0UL)                     /*!< I2C2 I2C2_TXFLR_REG: TXFLR (Bit 0)                          */
#define I2C2_I2C2_TXFLR_REG_TXFLR_Msk         (0x3fUL)                  /*!< I2C2 I2C2_TXFLR_REG: TXFLR (Bitfield-Mask: 0x3f)            */

/* -----------------------------  I2C2_I2C2_RXFLR_REG  ---------------------------- */
#define I2C2_I2C2_RXFLR_REG_RXFLR_Pos         (0UL)                     /*!< I2C2 I2C2_RXFLR_REG: RXFLR (Bit 0)                          */
#define I2C2_I2C2_RXFLR_REG_RXFLR_Msk         (0x3fUL)                  /*!< I2C2 I2C2_RXFLR_REG: RXFLR (Bitfield-Mask: 0x3f)            */

/* ---------------------------  I2C2_I2C2_SDA_HOLD_REG  --------------------------- */
#define I2C2_I2C2_SDA_HOLD_REG_IC_SDA_HOLD_Pos (0UL)                    /*!< I2C2 I2C2_SDA_HOLD_REG: IC_SDA_HOLD (Bit 0)                 */
#define I2C2_I2C2_SDA_HOLD_REG_IC_SDA_HOLD_Msk (0xffffUL)               /*!< I2C2 I2C2_SDA_HOLD_REG: IC_SDA_HOLD (Bitfield-Mask: 0xffff) */

/* ------------------------  I2C2_I2C2_TX_ABRT_SOURCE_REG  ------------------------ */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_7B_ADDR_NOACK_Pos (0UL)       /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_7B_ADDR_NOACK (Bit 0)    */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_7B_ADDR_NOACK_Msk (0x1UL)     /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_7B_ADDR_NOACK (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_10ADDR1_NOACK_Pos (1UL)       /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_10ADDR1_NOACK (Bit 1)    */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_10ADDR1_NOACK_Msk (0x2UL)     /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_10ADDR1_NOACK (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_10ADDR2_NOACK_Pos (2UL)       /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_10ADDR2_NOACK (Bit 2)    */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_10ADDR2_NOACK_Msk (0x4UL)     /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_10ADDR2_NOACK (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_TXDATA_NOACK_Pos (3UL)        /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_TXDATA_NOACK (Bit 3)     */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_TXDATA_NOACK_Msk (0x8UL)      /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_TXDATA_NOACK (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_GCALL_NOACK_Pos (4UL)         /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_GCALL_NOACK (Bit 4)      */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_GCALL_NOACK_Msk (0x10UL)      /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_GCALL_NOACK (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_GCALL_READ_Pos (5UL)          /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_GCALL_READ (Bit 5)       */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_GCALL_READ_Msk (0x20UL)       /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_GCALL_READ (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_HS_ACKDET_Pos (6UL)           /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_HS_ACKDET (Bit 6)        */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_HS_ACKDET_Msk (0x40UL)        /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_HS_ACKDET (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_SBYTE_ACKDET_Pos (7UL)        /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_SBYTE_ACKDET (Bit 7)     */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_SBYTE_ACKDET_Msk (0x80UL)     /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_SBYTE_ACKDET (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_HS_NORSTRT_Pos (8UL)          /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_HS_NORSTRT (Bit 8)       */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_HS_NORSTRT_Msk (0x100UL)      /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_HS_NORSTRT (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_SBYTE_NORSTRT_Pos (9UL)       /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_SBYTE_NORSTRT (Bit 9)    */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_SBYTE_NORSTRT_Msk (0x200UL)   /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_SBYTE_NORSTRT (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_10B_RD_NORSTRT_Pos (10UL)     /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_10B_RD_NORSTRT (Bit 10)  */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_10B_RD_NORSTRT_Msk (0x400UL)  /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_10B_RD_NORSTRT (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_MASTER_DIS_Pos (11UL)         /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_MASTER_DIS (Bit 11)      */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_MASTER_DIS_Msk (0x800UL)      /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_MASTER_DIS (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ARB_LOST_Pos (12UL)                /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ARB_LOST (Bit 12)             */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ARB_LOST_Msk (0x1000UL)            /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ARB_LOST (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_SLVFLUSH_TXFIFO_Pos (13UL)    /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_SLVFLUSH_TXFIFO (Bit 13) */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_SLVFLUSH_TXFIFO_Msk (0x2000UL) /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_SLVFLUSH_TXFIFO (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_SLV_ARBLOST_Pos (14UL)        /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_SLV_ARBLOST (Bit 14)     */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_SLV_ARBLOST_Msk (0x4000UL)    /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_SLV_ARBLOST (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_SLVRD_INTX_Pos (15UL)         /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_SLVRD_INTX (Bit 15)      */
#define I2C2_I2C2_TX_ABRT_SOURCE_REG_ABRT_SLVRD_INTX_Msk (0x8000UL)     /*!< I2C2 I2C2_TX_ABRT_SOURCE_REG: ABRT_SLVRD_INTX (Bitfield-Mask: 0x01) */

/* ----------------------------  I2C2_I2C2_DMA_CR_REG  ---------------------------- */
#define I2C2_I2C2_DMA_CR_REG_RDMAE_Pos        (0UL)                     /*!< I2C2 I2C2_DMA_CR_REG: RDMAE (Bit 0)                         */
#define I2C2_I2C2_DMA_CR_REG_RDMAE_Msk        (0x1UL)                   /*!< I2C2 I2C2_DMA_CR_REG: RDMAE (Bitfield-Mask: 0x01)           */
#define I2C2_I2C2_DMA_CR_REG_TDMAE_Pos        (1UL)                     /*!< I2C2 I2C2_DMA_CR_REG: TDMAE (Bit 1)                         */
#define I2C2_I2C2_DMA_CR_REG_TDMAE_Msk        (0x2UL)                   /*!< I2C2 I2C2_DMA_CR_REG: TDMAE (Bitfield-Mask: 0x01)           */

/* ---------------------------  I2C2_I2C2_DMA_TDLR_REG  --------------------------- */
#define I2C2_I2C2_DMA_TDLR_REG_DMATDL_Pos     (0UL)                     /*!< I2C2 I2C2_DMA_TDLR_REG: DMATDL (Bit 0)                      */
#define I2C2_I2C2_DMA_TDLR_REG_DMATDL_Msk     (0x1fUL)                  /*!< I2C2 I2C2_DMA_TDLR_REG: DMATDL (Bitfield-Mask: 0x1f)        */

/* ---------------------------  I2C2_I2C2_DMA_RDLR_REG  --------------------------- */
#define I2C2_I2C2_DMA_RDLR_REG_DMARDL_Pos     (0UL)                     /*!< I2C2 I2C2_DMA_RDLR_REG: DMARDL (Bit 0)                      */
#define I2C2_I2C2_DMA_RDLR_REG_DMARDL_Msk     (0x1fUL)                  /*!< I2C2 I2C2_DMA_RDLR_REG: DMARDL (Bitfield-Mask: 0x1f)        */

/* ---------------------------  I2C2_I2C2_SDA_SETUP_REG  -------------------------- */
#define I2C2_I2C2_SDA_SETUP_REG_SDA_SETUP_Pos (0UL)                     /*!< I2C2 I2C2_SDA_SETUP_REG: SDA_SETUP (Bit 0)                  */
#define I2C2_I2C2_SDA_SETUP_REG_SDA_SETUP_Msk (0xffUL)                  /*!< I2C2 I2C2_SDA_SETUP_REG: SDA_SETUP (Bitfield-Mask: 0xff)    */

/* -----------------------  I2C2_I2C2_ACK_GENERAL_CALL_REG  ----------------------- */
#define I2C2_I2C2_ACK_GENERAL_CALL_REG_ACK_GEN_CALL_Pos (0UL)           /*!< I2C2 I2C2_ACK_GENERAL_CALL_REG: ACK_GEN_CALL (Bit 0)        */
#define I2C2_I2C2_ACK_GENERAL_CALL_REG_ACK_GEN_CALL_Msk (0x1UL)         /*!< I2C2 I2C2_ACK_GENERAL_CALL_REG: ACK_GEN_CALL (Bitfield-Mask: 0x01) */

/* -------------------------  I2C2_I2C2_ENABLE_STATUS_REG  ------------------------ */
#define I2C2_I2C2_ENABLE_STATUS_REG_IC_EN_Pos (0UL)                     /*!< I2C2 I2C2_ENABLE_STATUS_REG: IC_EN (Bit 0)                  */
#define I2C2_I2C2_ENABLE_STATUS_REG_IC_EN_Msk (0x1UL)                   /*!< I2C2 I2C2_ENABLE_STATUS_REG: IC_EN (Bitfield-Mask: 0x01)    */
#define I2C2_I2C2_ENABLE_STATUS_REG_SLV_DISABLED_WHILE_BUSY_Pos (1UL)   /*!< I2C2 I2C2_ENABLE_STATUS_REG: SLV_DISABLED_WHILE_BUSY (Bit 1) */
#define I2C2_I2C2_ENABLE_STATUS_REG_SLV_DISABLED_WHILE_BUSY_Msk (0x2UL) /*!< I2C2 I2C2_ENABLE_STATUS_REG: SLV_DISABLED_WHILE_BUSY (Bitfield-Mask: 0x01) */
#define I2C2_I2C2_ENABLE_STATUS_REG_SLV_RX_DATA_LOST_Pos (2UL)          /*!< I2C2 I2C2_ENABLE_STATUS_REG: SLV_RX_DATA_LOST (Bit 2)       */
#define I2C2_I2C2_ENABLE_STATUS_REG_SLV_RX_DATA_LOST_Msk (0x4UL)        /*!< I2C2 I2C2_ENABLE_STATUS_REG: SLV_RX_DATA_LOST (Bitfield-Mask: 0x01) */

/* -------------------------  I2C2_I2C2_IC_FS_SPKLEN_REG  ------------------------- */
#define I2C2_I2C2_IC_FS_SPKLEN_REG_IC_FS_SPKLEN_Pos (0UL)               /*!< I2C2 I2C2_IC_FS_SPKLEN_REG: IC_FS_SPKLEN (Bit 0)            */
#define I2C2_I2C2_IC_FS_SPKLEN_REG_IC_FS_SPKLEN_Msk (0xffUL)            /*!< I2C2 I2C2_IC_FS_SPKLEN_REG: IC_FS_SPKLEN (Bitfield-Mask: 0xff) */

/* --------------------------  I2C2_I2C2_COMP_PARAM1_REG  ------------------------- */
#define I2C2_I2C2_COMP_PARAM1_REG_IC_COMP_PARAM1_Pos (0UL)              /*!< I2C2 I2C2_COMP_PARAM1_REG: IC_COMP_PARAM1 (Bit 0)           */
#define I2C2_I2C2_COMP_PARAM1_REG_IC_COMP_PARAM1_Msk (0xffffUL)         /*!< I2C2 I2C2_COMP_PARAM1_REG: IC_COMP_PARAM1 (Bitfield-Mask: 0xffff) */

/* --------------------------  I2C2_I2C2_COMP_PARAM2_REG  ------------------------- */
#define I2C2_I2C2_COMP_PARAM2_REG_IC_COMP_PARAM2_Pos (0UL)              /*!< I2C2 I2C2_COMP_PARAM2_REG: IC_COMP_PARAM2 (Bit 0)           */
#define I2C2_I2C2_COMP_PARAM2_REG_IC_COMP_PARAM2_Msk (0xffffUL)         /*!< I2C2 I2C2_COMP_PARAM2_REG: IC_COMP_PARAM2 (Bitfield-Mask: 0xffff) */

/* -------------------------  I2C2_I2C2_COMP_VERSION_REG  ------------------------- */
#define I2C2_I2C2_COMP_VERSION_REG_IC_COMP_VERSION_Pos (0UL)            /*!< I2C2 I2C2_COMP_VERSION_REG: IC_COMP_VERSION (Bit 0)         */
#define I2C2_I2C2_COMP_VERSION_REG_IC_COMP_VERSION_Msk (0xffffUL)       /*!< I2C2 I2C2_COMP_VERSION_REG: IC_COMP_VERSION (Bitfield-Mask: 0xffff) */

