openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* ---------------------------  PATCH_PATCH_ADDR16_REG  --------------------------- */
#define PATCH_PATCH_ADDR16_REG_PATCH_ADDR_C_Pos (1UL)                   /*!< PATCH PATCH_ADDR16_REG: PATCH_ADDR_C (Bit 1)                */
#define PATCH_PATCH_ADDR16_REG_PATCH_ADDR_C_Msk (0x1fffeUL)             /*!< PATCH PATCH_ADDR16_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR16_REG_PATCH_ADDR_19_Pos (19UL)                 /*!< PATCH PATCH_ADDR16_REG: PATCH_ADDR_19 (Bit 19)              */
#define PATCH_PATCH_ADDR16_REG_PATCH_ADDR_19_Msk (0x80000UL)            /*!< PATCH PATCH_ADDR16_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */

/* ---------------------------  PATCH_PATCH_ADDR17_REG  --------------------------- */
#define PATCH_PATCH_ADDR17_REG_PATCH_ADDR_C_Pos (1UL)                   /*!< PATCH PATCH_ADDR17_REG: PATCH_ADDR_C (Bit 1)                */
#define PATCH_PATCH_ADDR17_REG_PATCH_ADDR_C_Msk (0x1fffeUL)             /*!< PATCH PATCH_ADDR17_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR17_REG_PATCH_ADDR_19_Pos (19UL)                 /*!< PATCH PATCH_ADDR17_REG: PATCH_ADDR_19 (Bit 19)              */
#define PATCH_PATCH_ADDR17_REG_PATCH_ADDR_19_Msk (0x80000UL)            /*!< PATCH PATCH_ADDR17_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */

/* ---------------------------  PATCH_PATCH_ADDR18_REG  --------------------------- */
#define PATCH_PATCH_ADDR18_REG_PATCH_ADDR_C_Pos (1UL)                   /*!< PATCH PATCH_ADDR18_REG: PATCH_ADDR_C (Bit 1)                */
#define PATCH_PATCH_ADDR18_REG_PATCH_ADDR_C_Msk (0x1fffeUL)             /*!< PATCH PATCH_ADDR18_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR18_REG_PATCH_ADDR_19_Pos (19UL)                 /*!< PATCH PATCH_ADDR18_REG: PATCH_ADDR_19 (Bit 19)              */
#define PATCH_PATCH_ADDR18_REG_PATCH_ADDR_19_Msk (0x80000UL)            /*!< PATCH PATCH_ADDR18_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */

/* ---------------------------  PATCH_PATCH_ADDR19_REG  --------------------------- */
#define PATCH_PATCH_ADDR19_REG_PATCH_ADDR_C_Pos (1UL)                   /*!< PATCH PATCH_ADDR19_REG: PATCH_ADDR_C (Bit 1)                */
#define PATCH_PATCH_ADDR19_REG_PATCH_ADDR_C_Msk (0x1fffeUL)             /*!< PATCH PATCH_ADDR19_REG: PATCH_ADDR_C (Bitfield-Mask: 0xffff) */
#define PATCH_PATCH_ADDR19_REG_PATCH_ADDR_19_Pos (19UL)                 /*!< PATCH PATCH_ADDR19_REG: PATCH_ADDR_19 (Bit 19)              */
#define PATCH_PATCH_ADDR19_REG_PATCH_ADDR_19_Msk (0x80000UL)            /*!< PATCH PATCH_ADDR19_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */

/* ---------------------------  PATCH_PATCH_ADDR20_REG  --------------------------- */
#define PATCH_PATCH_ADDR20_REG_PATCH_ADDR_D_Pos (2UL)                   /*!< PATCH PATCH_ADDR20_REG: PATCH_ADDR_D (Bit 2)                */
#define PATCH_PATCH_ADDR20_REG_PATCH_ADDR_D_Msk (0x1fffcUL)             /*!< PATCH PATCH_ADDR20_REG: PATCH_ADDR_D (Bitfield-Mask: 0x7fff) */
#define PATCH_PATCH_ADDR20_REG_PATCH_ADDR_19_Pos (19UL)                 /*!< PATCH PATCH_ADDR20_REG: PATCH_ADDR_19 (Bit 19)              */
#define PATCH_PATCH_ADDR20_REG_PATCH_ADDR_19_Msk (0x80000UL)            /*!< PATCH PATCH_ADDR20_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */

/* ---------------------------  PATCH_PATCH_DATA20_REG  --------------------------- */
#define PATCH_PATCH_DATA20_REG_PATCH_DATA_Pos (0UL)                     /*!< PATCH PATCH_DATA20_REG: PATCH_DATA (Bit 0)                  */
#define PATCH_PATCH_DATA20_REG_PATCH_DATA_Msk (0xffffffffUL)            /*!< PATCH PATCH_DATA20_REG: PATCH_DATA (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  PATCH_PATCH_ADDR21_REG  --------------------------- */
#define PATCH_PATCH_ADDR21_REG_PATCH_ADDR_D_Pos (2UL)                   /*!< PATCH PATCH_ADDR21_REG: PATCH_ADDR_D (Bit 2)                */
#define PATCH_PATCH_ADDR21_REG_PATCH_ADDR_D_Msk (0x1fffcUL)             /*!< PATCH PATCH_ADDR21_REG: PATCH_ADDR_D (Bitfield-Mask: 0x7fff) */
#define PATCH_PATCH_ADDR21_REG_PATCH_ADDR_19_Pos (19UL)                 /*!< PATCH PATCH_ADDR21_REG: PATCH_ADDR_19 (Bit 19)              */
#define PATCH_PATCH_ADDR21_REG_PATCH_ADDR_19_Msk (0x80000UL)            /*!< PATCH PATCH_ADDR21_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */

/* ---------------------------  PATCH_PATCH_DATA21_REG  --------------------------- */
#define PATCH_PATCH_DATA21_REG_PATCH_DATA_Pos (0UL)                     /*!< PATCH PATCH_DATA21_REG: PATCH_DATA (Bit 0)                  */
#define PATCH_PATCH_DATA21_REG_PATCH_DATA_Msk (0xffffffffUL)            /*!< PATCH PATCH_DATA21_REG: PATCH_DATA (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  PATCH_PATCH_ADDR22_REG  --------------------------- */
#define PATCH_PATCH_ADDR22_REG_PATCH_ADDR_D_Pos (2UL)                   /*!< PATCH PATCH_ADDR22_REG: PATCH_ADDR_D (Bit 2)                */
#define PATCH_PATCH_ADDR22_REG_PATCH_ADDR_D_Msk (0x1fffcUL)             /*!< PATCH PATCH_ADDR22_REG: PATCH_ADDR_D (Bitfield-Mask: 0x7fff) */
#define PATCH_PATCH_ADDR22_REG_PATCH_ADDR_19_Pos (19UL)                 /*!< PATCH PATCH_ADDR22_REG: PATCH_ADDR_19 (Bit 19)              */
#define PATCH_PATCH_ADDR22_REG_PATCH_ADDR_19_Msk (0x80000UL)            /*!< PATCH PATCH_ADDR22_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */

/* ---------------------------  PATCH_PATCH_DATA22_REG  --------------------------- */
#define PATCH_PATCH_DATA22_REG_PATCH_DATA_Pos (0UL)                     /*!< PATCH PATCH_DATA22_REG: PATCH_DATA (Bit 0)                  */
#define PATCH_PATCH_DATA22_REG_PATCH_DATA_Msk (0xffffffffUL)            /*!< PATCH PATCH_DATA22_REG: PATCH_DATA (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  PATCH_PATCH_ADDR23_REG  --------------------------- */
#define PATCH_PATCH_ADDR23_REG_PATCH_ADDR_D_Pos (2UL)                   /*!< PATCH PATCH_ADDR23_REG: PATCH_ADDR_D (Bit 2)                */
#define PATCH_PATCH_ADDR23_REG_PATCH_ADDR_D_Msk (0x1fffcUL)             /*!< PATCH PATCH_ADDR23_REG: PATCH_ADDR_D (Bitfield-Mask: 0x7fff) */
#define PATCH_PATCH_ADDR23_REG_PATCH_ADDR_19_Pos (19UL)                 /*!< PATCH PATCH_ADDR23_REG: PATCH_ADDR_19 (Bit 19)              */
#define PATCH_PATCH_ADDR23_REG_PATCH_ADDR_19_Msk (0x80000UL)            /*!< PATCH PATCH_ADDR23_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */

/* ---------------------------  PATCH_PATCH_DATA23_REG  --------------------------- */
#define PATCH_PATCH_DATA23_REG_PATCH_DATA_Pos (0UL)                     /*!< PATCH PATCH_DATA23_REG: PATCH_DATA (Bit 0)                  */
#define PATCH_PATCH_DATA23_REG_PATCH_DATA_Msk (0xffffffffUL)            /*!< PATCH PATCH_DATA23_REG: PATCH_DATA (Bitfield-Mask: 0xffffffff) */

