openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* ---------------------------  PATCH_PATCH_ADDR24_REG  --------------------------- */
#define PATCH_PATCH_ADDR24_REG_PATCH_ADDR_D_Pos (2UL)                   /*!< PATCH PATCH_ADDR24_REG: PATCH_ADDR_D (Bit 2)                */
#define PATCH_PATCH_ADDR24_REG_PATCH_ADDR_D_Msk (0x1fffcUL)             /*!< PATCH PATCH_ADDR24_REG: PATCH_ADDR_D (Bitfield-Mask: 0x7fff) */
#define PATCH_PATCH_ADDR24_REG_PATCH_ADDR_19_Pos (19UL)                 /*!< PATCH PATCH_ADDR24_REG: PATCH_ADDR_19 (Bit 19)              */
#define PATCH_PATCH_ADDR24_REG_PATCH_ADDR_19_Msk (0x80000UL)            /*!< PATCH PATCH_ADDR24_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */

/* ---------------------------  PATCH_PATCH_DATA24_REG  --------------------------- */
#define PATCH_PATCH_DATA24_REG_PATCH_DATA_Pos (0UL)                     /*!< PATCH PATCH_DATA24_REG: PATCH_DATA (Bit 0)                  */
#define PATCH_PATCH_DATA24_REG_PATCH_DATA_Msk (0xffffffffUL)            /*!< PATCH PATCH_DATA24_REG: PATCH_DATA (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  PATCH_PATCH_ADDR25_REG  --------------------------- */
#define PATCH_PATCH_ADDR25_REG_PATCH_ADDR_D_Pos (2UL)                   /*!< PATCH PATCH_ADDR25_REG: PATCH_ADDR_D (Bit 2)                */
#define PATCH_PATCH_ADDR25_REG_PATCH_ADDR_D_Msk (0x1fffcUL)             /*!< PATCH PATCH_ADDR25_REG: PATCH_ADDR_D (Bitfield-Mask: 0x7fff) */
#define PATCH_PATCH_ADDR25_REG_PATCH_ADDR_19_Pos (19UL)                 /*!< PATCH PATCH_ADDR25_REG: PATCH_ADDR_19 (Bit 19)              */
#define PATCH_PATCH_ADDR25_REG_PATCH_ADDR_19_Msk (0x80000UL)            /*!< PATCH PATCH_ADDR25_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */

/* ---------------------------  PATCH_PATCH_DATA25_REG  --------------------------- */
#define PATCH_PATCH_DATA25_REG_PATCH_DATA_Pos (0UL)                     /*!< PATCH PATCH_DATA25_REG: PATCH_DATA (Bit 0)                  */
#define PATCH_PATCH_DATA25_REG_PATCH_DATA_Msk (0xffffffffUL)            /*!< PATCH PATCH_DATA25_REG: PATCH_DATA (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  PATCH_PATCH_ADDR26_REG  --------------------------- */
#define PATCH_PATCH_ADDR26_REG_PATCH_ADDR_D_Pos (2UL)                   /*!< PATCH PATCH_ADDR26_REG: PATCH_ADDR_D (Bit 2)                */
#define PATCH_PATCH_ADDR26_REG_PATCH_ADDR_D_Msk (0x1fffcUL)             /*!< PATCH PATCH_ADDR26_REG: PATCH_ADDR_D (Bitfield-Mask: 0x7fff) */
#define PATCH_PATCH_ADDR26_REG_PATCH_ADDR_19_Pos (19UL)                 /*!< PATCH PATCH_ADDR26_REG: PATCH_ADDR_19 (Bit 19)              */
#define PATCH_PATCH_ADDR26_REG_PATCH_ADDR_19_Msk (0x80000UL)            /*!< PATCH PATCH_ADDR26_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */

/* ---------------------------  PATCH_PATCH_DATA26_REG  --------------------------- */
#define PATCH_PATCH_DATA26_REG_PATCH_DATA_Pos (0UL)                     /*!< PATCH PATCH_DATA26_REG: PATCH_DATA (Bit 0)                  */
#define PATCH_PATCH_DATA26_REG_PATCH_DATA_Msk (0xffffffffUL)            /*!< PATCH PATCH_DATA26_REG: PATCH_DATA (Bitfield-Mask: 0xffffffff) */

/* ---------------------------  PATCH_PATCH_ADDR27_REG  --------------------------- */
#define PATCH_PATCH_ADDR27_REG_PATCH_ADDR_D_Pos (2UL)                   /*!< PATCH PATCH_ADDR27_REG: PATCH_ADDR_D (Bit 2)                */
#define PATCH_PATCH_ADDR27_REG_PATCH_ADDR_D_Msk (0x1fffcUL)             /*!< PATCH PATCH_ADDR27_REG: PATCH_ADDR_D (Bitfield-Mask: 0x7fff) */
#define PATCH_PATCH_ADDR27_REG_PATCH_ADDR_19_Pos (19UL)                 /*!< PATCH PATCH_ADDR27_REG: PATCH_ADDR_19 (Bit 19)              */
#define PATCH_PATCH_ADDR27_REG_PATCH_ADDR_19_Msk (0x80000UL)            /*!< PATCH PATCH_ADDR27_REG: PATCH_ADDR_19 (Bitfield-Mask: 0x01) */

/* ---------------------------  PATCH_PATCH_DATA27_REG  --------------------------- */
#define PATCH_PATCH_DATA27_REG_PATCH_DATA_Pos (0UL)                     /*!< PATCH PATCH_DATA27_REG: PATCH_DATA (Bit 0)                  */
#define PATCH_PATCH_DATA27_REG_PATCH_DATA_Msk (0xffffffffUL)            /*!< PATCH PATCH_DATA27_REG: PATCH_DATA (Bitfield-Mask: 0xffffffff) */


/* ================================================================================ */
/* ================         struct 'PLLDIG' Position & Mask        ================ */
/* ================================================================================ */


/* ------------------------  PLLDIG_RF_SYNTH_CTRL1_BLE_REG  ----------------------- */
#define PLLDIG_RF_SYNTH_CTRL1_BLE_REG_CHANNEL_ZERO_Pos (0UL)            /*!< PLLDIG RF_SYNTH_CTRL1_BLE_REG: CHANNEL_ZERO (Bit 0)         */
#define PLLDIG_RF_SYNTH_CTRL1_BLE_REG_CHANNEL_ZERO_Msk (0xfffUL)        /*!< PLLDIG RF_SYNTH_CTRL1_BLE_REG: CHANNEL_ZERO (Bitfield-Mask: 0xfff) */
#define PLLDIG_RF_SYNTH_CTRL1_BLE_REG_SGN_Pos (12UL)                    /*!< PLLDIG RF_SYNTH_CTRL1_BLE_REG: SGN (Bit 12)                 */
#define PLLDIG_RF_SYNTH_CTRL1_BLE_REG_SGN_Msk (0x1000UL)                /*!< PLLDIG RF_SYNTH_CTRL1_BLE_REG: SGN (Bitfield-Mask: 0x01)    */
#define PLLDIG_RF_SYNTH_CTRL1_BLE_REG_CS_Pos  (13UL)                    /*!< PLLDIG RF_SYNTH_CTRL1_BLE_REG: CS (Bit 13)                  */
#define PLLDIG_RF_SYNTH_CTRL1_BLE_REG_CS_Msk  (0x2000UL)                /*!< PLLDIG RF_SYNTH_CTRL1_BLE_REG: CS (Bitfield-Mask: 0x01)     */
#define PLLDIG_RF_SYNTH_CTRL1_BLE_REG_PLL_HSI_POL_Pos (14UL)            /*!< PLLDIG RF_SYNTH_CTRL1_BLE_REG: PLL_HSI_POL (Bit 14)         */
#define PLLDIG_RF_SYNTH_CTRL1_BLE_REG_PLL_HSI_POL_Msk (0x4000UL)        /*!< PLLDIG RF_SYNTH_CTRL1_BLE_REG: PLL_HSI_POL (Bitfield-Mask: 0x01) */

/* -----------------------  PLLDIG_RF_SYNTH_CTRL1_FTDF_REG  ----------------------- */
#define PLLDIG_RF_SYNTH_CTRL1_FTDF_REG_CHANNEL_ZERO_Pos (0UL)           /*!< PLLDIG RF_SYNTH_CTRL1_FTDF_REG: CHANNEL_ZERO (Bit 0)        */
#define PLLDIG_RF_SYNTH_CTRL1_FTDF_REG_CHANNEL_ZERO_Msk (0xfffUL)       /*!< PLLDIG RF_SYNTH_CTRL1_FTDF_REG: CHANNEL_ZERO (Bitfield-Mask: 0xfff) */
#define PLLDIG_RF_SYNTH_CTRL1_FTDF_REG_SGN_Pos (12UL)                   /*!< PLLDIG RF_SYNTH_CTRL1_FTDF_REG: SGN (Bit 12)                */
#define PLLDIG_RF_SYNTH_CTRL1_FTDF_REG_SGN_Msk (0x1000UL)               /*!< PLLDIG RF_SYNTH_CTRL1_FTDF_REG: SGN (Bitfield-Mask: 0x01)   */
#define PLLDIG_RF_SYNTH_CTRL1_FTDF_REG_CS_Pos (13UL)                    /*!< PLLDIG RF_SYNTH_CTRL1_FTDF_REG: CS (Bit 13)                 */
#define PLLDIG_RF_SYNTH_CTRL1_FTDF_REG_CS_Msk (0x2000UL)                /*!< PLLDIG RF_SYNTH_CTRL1_FTDF_REG: CS (Bitfield-Mask: 0x01)    */
#define PLLDIG_RF_SYNTH_CTRL1_FTDF_REG_PLL_HSI_POL_Pos (14UL)           /*!< PLLDIG RF_SYNTH_CTRL1_FTDF_REG: PLL_HSI_POL (Bit 14)        */
#define PLLDIG_RF_SYNTH_CTRL1_FTDF_REG_PLL_HSI_POL_Msk (0x4000UL)       /*!< PLLDIG RF_SYNTH_CTRL1_FTDF_REG: PLL_HSI_POL (Bitfield-Mask: 0x01) */

/* ------------------------  PLLDIG_RF_SYNTH_CTRL2_BLE_REG  ----------------------- */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_SD_ORDER_RX_Pos (0UL)             /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: SD_ORDER_RX (Bit 0)          */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_SD_ORDER_RX_Msk (0x3UL)           /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: SD_ORDER_RX (Bitfield-Mask: 0x03) */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_SD_ORDER_TX_Pos (2UL)             /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: SD_ORDER_TX (Bit 2)          */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_SD_ORDER_TX_Msk (0xcUL)           /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: SD_ORDER_TX (Bitfield-Mask: 0x03) */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_MODINDEX_Pos (4UL)                /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: MODINDEX (Bit 4)             */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_MODINDEX_Msk (0x30UL)             /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: MODINDEX (Bitfield-Mask: 0x03) */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_DELAY_Pos (6UL)                   /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: DELAY (Bit 6)                */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_DELAY_Msk (0xc0UL)                /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: DELAY (Bitfield-Mask: 0x03)  */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_GAUSS_INV_Pos (8UL)               /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: GAUSS_INV (Bit 8)            */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_GAUSS_INV_Msk (0x100UL)           /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: GAUSS_INV (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_GAUSS_86_Pos (9UL)                /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: GAUSS_86 (Bit 9)             */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_GAUSS_86_Msk (0x200UL)            /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: GAUSS_86 (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_TXDATA_INV_Pos (10UL)             /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: TXDATA_INV (Bit 10)          */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_TXDATA_INV_Msk (0x400UL)          /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: TXDATA_INV (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_EO_PACKET_DIS_Pos (11UL)          /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: EO_PACKET_DIS (Bit 11)       */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_EO_PACKET_DIS_Msk (0x800UL)       /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: EO_PACKET_DIS (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_BT_SEL_Pos (12UL)                 /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: BT_SEL (Bit 12)              */
#define PLLDIG_RF_SYNTH_CTRL2_BLE_REG_BT_SEL_Msk (0x1000UL)             /*!< PLLDIG RF_SYNTH_CTRL2_BLE_REG: BT_SEL (Bitfield-Mask: 0x01) */

