openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* -----------------------  PLLDIG_RF_VCO_CALCAP_BIT15_REG  ----------------------- */
#define PLLDIG_RF_VCO_CALCAP_BIT15_REG_VCO_CALCAP_BIT15_Pos (0UL)       /*!< PLLDIG RF_VCO_CALCAP_BIT15_REG: VCO_CALCAP_BIT15 (Bit 0)    */
#define PLLDIG_RF_VCO_CALCAP_BIT15_REG_VCO_CALCAP_BIT15_Msk (0xffffUL)  /*!< PLLDIG RF_VCO_CALCAP_BIT15_REG: VCO_CALCAP_BIT15 (Bitfield-Mask: 0xffff) */

/* -----------------------------  PLLDIG_RF_BMCW_REG  ----------------------------- */
#define PLLDIG_RF_BMCW_REG_CN_WR_Pos          (0UL)                     /*!< PLLDIG RF_BMCW_REG: CN_WR (Bit 0)                           */
#define PLLDIG_RF_BMCW_REG_CN_WR_Msk          (0x3fUL)                  /*!< PLLDIG RF_BMCW_REG: CN_WR (Bitfield-Mask: 0x3f)             */
#define PLLDIG_RF_BMCW_REG_HSI_WR_Pos         (6UL)                     /*!< PLLDIG RF_BMCW_REG: HSI_WR (Bit 6)                          */
#define PLLDIG_RF_BMCW_REG_HSI_WR_Msk         (0x40UL)                  /*!< PLLDIG RF_BMCW_REG: HSI_WR (Bitfield-Mask: 0x01)            */
#define PLLDIG_RF_BMCW_REG_CN_SEL_Pos         (7UL)                     /*!< PLLDIG RF_BMCW_REG: CN_SEL (Bit 7)                          */
#define PLLDIG_RF_BMCW_REG_CN_SEL_Msk         (0x80UL)                  /*!< PLLDIG RF_BMCW_REG: CN_SEL (Bitfield-Mask: 0x01)            */
#define PLLDIG_RF_BMCW_REG_HSI_SEL_Pos        (8UL)                     /*!< PLLDIG RF_BMCW_REG: HSI_SEL (Bit 8)                         */
#define PLLDIG_RF_BMCW_REG_HSI_SEL_Msk        (0x100UL)                 /*!< PLLDIG RF_BMCW_REG: HSI_SEL (Bitfield-Mask: 0x01)           */

/* --------------------------  PLLDIG_RF_KMOD_ALPHA_REG  -------------------------- */
#define PLLDIG_RF_KMOD_ALPHA_REG_KMOD_ALPHA_BLE_Pos (0UL)               /*!< PLLDIG RF_KMOD_ALPHA_REG: KMOD_ALPHA_BLE (Bit 0)            */
#define PLLDIG_RF_KMOD_ALPHA_REG_KMOD_ALPHA_BLE_Msk (0x3fUL)            /*!< PLLDIG RF_KMOD_ALPHA_REG: KMOD_ALPHA_BLE (Bitfield-Mask: 0x3f) */
#define PLLDIG_RF_KMOD_ALPHA_REG_KMOD_ALPHA_FTDF_Pos (6UL)              /*!< PLLDIG RF_KMOD_ALPHA_REG: KMOD_ALPHA_FTDF (Bit 6)           */
#define PLLDIG_RF_KMOD_ALPHA_REG_KMOD_ALPHA_FTDF_Msk (0xfc0UL)          /*!< PLLDIG RF_KMOD_ALPHA_REG: KMOD_ALPHA_FTDF (Bitfield-Mask: 0x3f) */

/* -----------------------  PLLDIG_RF_SYNTH_RESULT_BLE_REG  ----------------------- */
#define PLLDIG_RF_SYNTH_RESULT_BLE_REG_GAUSS_GAIN_CAL_RD_Pos (0UL)      /*!< PLLDIG RF_SYNTH_RESULT_BLE_REG: GAUSS_GAIN_CAL_RD (Bit 0)   */
#define PLLDIG_RF_SYNTH_RESULT_BLE_REG_GAUSS_GAIN_CAL_RD_Msk (0xffUL)   /*!< PLLDIG RF_SYNTH_RESULT_BLE_REG: GAUSS_GAIN_CAL_RD (Bitfield-Mask: 0xff) */
#define PLLDIG_RF_SYNTH_RESULT_BLE_REG_VCO_FREQTRIM_RD_Pos (8UL)        /*!< PLLDIG RF_SYNTH_RESULT_BLE_REG: VCO_FREQTRIM_RD (Bit 8)     */
#define PLLDIG_RF_SYNTH_RESULT_BLE_REG_VCO_FREQTRIM_RD_Msk (0xf00UL)    /*!< PLLDIG RF_SYNTH_RESULT_BLE_REG: VCO_FREQTRIM_RD (Bitfield-Mask: 0x0f) */

/* -----------------------  PLLDIG_RF_SYNTH_RESULT_FTDF_REG  ---------------------- */
#define PLLDIG_RF_SYNTH_RESULT_FTDF_REG_MSK_GAIN_CAL_RD_Pos (0UL)       /*!< PLLDIG RF_SYNTH_RESULT_FTDF_REG: MSK_GAIN_CAL_RD (Bit 0)    */
#define PLLDIG_RF_SYNTH_RESULT_FTDF_REG_MSK_GAIN_CAL_RD_Msk (0x3fUL)    /*!< PLLDIG RF_SYNTH_RESULT_FTDF_REG: MSK_GAIN_CAL_RD (Bitfield-Mask: 0x3f) */

/* -----------------------  PLLDIG_RF_SYNTH_RESULT2_BLE_REG  ---------------------- */
#define PLLDIG_RF_SYNTH_RESULT2_BLE_REG_GAUSS_GAIN_RD_Pos (0UL)         /*!< PLLDIG RF_SYNTH_RESULT2_BLE_REG: GAUSS_GAIN_RD (Bit 0)      */
#define PLLDIG_RF_SYNTH_RESULT2_BLE_REG_GAUSS_GAIN_RD_Msk (0xffUL)      /*!< PLLDIG RF_SYNTH_RESULT2_BLE_REG: GAUSS_GAIN_RD (Bitfield-Mask: 0xff) */
#define PLLDIG_RF_SYNTH_RESULT2_BLE_REG_CN_CAL_RD_Pos (8UL)             /*!< PLLDIG RF_SYNTH_RESULT2_BLE_REG: CN_CAL_RD (Bit 8)          */
#define PLLDIG_RF_SYNTH_RESULT2_BLE_REG_CN_CAL_RD_Msk (0x3f00UL)        /*!< PLLDIG RF_SYNTH_RESULT2_BLE_REG: CN_CAL_RD (Bitfield-Mask: 0x3f) */

/* ----------------------  PLLDIG_RF_SYNTH_RESULT2_FTDF_REG  ---------------------- */
#define PLLDIG_RF_SYNTH_RESULT2_FTDF_REG_MSK_GAIN_LOWER_RD_Pos (0UL)    /*!< PLLDIG RF_SYNTH_RESULT2_FTDF_REG: MSK_GAIN_LOWER_RD (Bit 0) */
#define PLLDIG_RF_SYNTH_RESULT2_FTDF_REG_MSK_GAIN_LOWER_RD_Msk (0x3fUL) /*!< PLLDIG RF_SYNTH_RESULT2_FTDF_REG: MSK_GAIN_LOWER_RD (Bitfield-Mask: 0x3f) */
#define PLLDIG_RF_SYNTH_RESULT2_FTDF_REG_MSK_GAIN_UPPER_RD_Pos (6UL)    /*!< PLLDIG RF_SYNTH_RESULT2_FTDF_REG: MSK_GAIN_UPPER_RD (Bit 6) */
#define PLLDIG_RF_SYNTH_RESULT2_FTDF_REG_MSK_GAIN_UPPER_RD_Msk (0xfc0UL) /*!< PLLDIG RF_SYNTH_RESULT2_FTDF_REG: MSK_GAIN_UPPER_RD (Bitfield-Mask: 0x3f) */

/* ----------------------  PLLDIG_RF_SYNTH_RESULT3_FTDF_REG  ---------------------- */
#define PLLDIG_RF_SYNTH_RESULT3_FTDF_REG_CN_CAL_FTDF_RD_Pos (0UL)       /*!< PLLDIG RF_SYNTH_RESULT3_FTDF_REG: CN_CAL_FTDF_RD (Bit 0)    */
#define PLLDIG_RF_SYNTH_RESULT3_FTDF_REG_CN_CAL_FTDF_RD_Msk (0x3fUL)    /*!< PLLDIG RF_SYNTH_RESULT3_FTDF_REG: CN_CAL_FTDF_RD (Bitfield-Mask: 0x3f) */

/* ----------------------------  PLLDIG_RF_CALCAP1_REG  --------------------------- */
#define PLLDIG_RF_CALCAP1_REG_VCO_CALCAP_LOW_Pos (0UL)                  /*!< PLLDIG RF_CALCAP1_REG: VCO_CALCAP_LOW (Bit 0)               */
#define PLLDIG_RF_CALCAP1_REG_VCO_CALCAP_LOW_Msk (0xffffUL)             /*!< PLLDIG RF_CALCAP1_REG: VCO_CALCAP_LOW (Bitfield-Mask: 0xffff) */

/* ----------------------------  PLLDIG_RF_CALCAP2_REG  --------------------------- */
#define PLLDIG_RF_CALCAP2_REG_VCO_CALCAP_HIGH_Pos (0UL)                 /*!< PLLDIG RF_CALCAP2_REG: VCO_CALCAP_HIGH (Bit 0)              */
#define PLLDIG_RF_CALCAP2_REG_VCO_CALCAP_HIGH_Msk (0x3UL)               /*!< PLLDIG RF_CALCAP2_REG: VCO_CALCAP_HIGH (Bitfield-Mask: 0x03) */

/* -------------------------  PLLDIG_RF_FTDF_PHYATTR_REG  ------------------------- */
#define PLLDIG_RF_FTDF_PHYATTR_REG_FTDF_PHYATTR_Pos (0UL)               /*!< PLLDIG RF_FTDF_PHYATTR_REG: FTDF_PHYATTR (Bit 0)            */
#define PLLDIG_RF_FTDF_PHYATTR_REG_FTDF_PHYATTR_Msk (0xffffUL)          /*!< PLLDIG RF_FTDF_PHYATTR_REG: FTDF_PHYATTR (Bitfield-Mask: 0xffff) */

/* -------------------------  PLLDIG_RF_CALTRIM_STEP1_REG  ------------------------ */
#define PLLDIG_RF_CALTRIM_STEP1_REG_MDSTATE_RD_Pos (0UL)                /*!< PLLDIG RF_CALTRIM_STEP1_REG: MDSTATE_RD (Bit 0)             */
#define PLLDIG_RF_CALTRIM_STEP1_REG_MDSTATE_RD_Msk (0xffffUL)           /*!< PLLDIG RF_CALTRIM_STEP1_REG: MDSTATE_RD (Bitfield-Mask: 0xffff) */

