openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* -------------------------  PLLDIG_RF_CALTRIM_STEP2_REG  ------------------------ */
#define PLLDIG_RF_CALTRIM_STEP2_REG_MDSTATE_RD_Pos (0UL)                /*!< PLLDIG RF_CALTRIM_STEP2_REG: MDSTATE_RD (Bit 0)             */
#define PLLDIG_RF_CALTRIM_STEP2_REG_MDSTATE_RD_Msk (0xffffUL)           /*!< PLLDIG RF_CALTRIM_STEP2_REG: MDSTATE_RD (Bitfield-Mask: 0xffff) */

/* -------------------------  PLLDIG_RF_CALTRIM_STEP3_REG  ------------------------ */
#define PLLDIG_RF_CALTRIM_STEP3_REG_MDSTATE_RD_Pos (0UL)                /*!< PLLDIG RF_CALTRIM_STEP3_REG: MDSTATE_RD (Bit 0)             */
#define PLLDIG_RF_CALTRIM_STEP3_REG_MDSTATE_RD_Msk (0xffffUL)           /*!< PLLDIG RF_CALTRIM_STEP3_REG: MDSTATE_RD (Bitfield-Mask: 0xffff) */

/* -------------------------  PLLDIG_RF_CALTRIM_STEP4_REG  ------------------------ */
#define PLLDIG_RF_CALTRIM_STEP4_REG_MDSTATE_RD_Pos (0UL)                /*!< PLLDIG RF_CALTRIM_STEP4_REG: MDSTATE_RD (Bit 0)             */
#define PLLDIG_RF_CALTRIM_STEP4_REG_MDSTATE_RD_Msk (0xffffUL)           /*!< PLLDIG RF_CALTRIM_STEP4_REG: MDSTATE_RD (Bitfield-Mask: 0xffff) */

/* -------------------------  PLLDIG_RF_MSKMOD_CTRL1_REG  ------------------------- */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_TX_DAC_DELAY_Pos (0UL)               /*!< PLLDIG RF_MSKMOD_CTRL1_REG: TX_DAC_DELAY (Bit 0)            */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_TX_DAC_DELAY_Msk (0x3UL)             /*!< PLLDIG RF_MSKMOD_CTRL1_REG: TX_DAC_DELAY (Bitfield-Mask: 0x03) */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_INV_DAC_POL_Pos (2UL)                /*!< PLLDIG RF_MSKMOD_CTRL1_REG: INV_DAC_POL (Bit 2)             */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_INV_DAC_POL_Msk (0x4UL)              /*!< PLLDIG RF_MSKMOD_CTRL1_REG: INV_DAC_POL (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_INV_SDM_POL_Pos (3UL)                /*!< PLLDIG RF_MSKMOD_CTRL1_REG: INV_SDM_POL (Bit 3)             */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_INV_SDM_POL_Msk (0x8UL)              /*!< PLLDIG RF_MSKMOD_CTRL1_REG: INV_SDM_POL (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_DISABLE_DAC_Pos (4UL)                /*!< PLLDIG RF_MSKMOD_CTRL1_REG: DISABLE_DAC (Bit 4)             */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_DISABLE_DAC_Msk (0x10UL)             /*!< PLLDIG RF_MSKMOD_CTRL1_REG: DISABLE_DAC (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_DISABLE_SDM_Pos (5UL)                /*!< PLLDIG RF_MSKMOD_CTRL1_REG: DISABLE_SDM (Bit 5)             */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_DISABLE_SDM_Msk (0x20UL)             /*!< PLLDIG RF_MSKMOD_CTRL1_REG: DISABLE_SDM (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_TX_MOD_FROM_GPIO_Pos (6UL)           /*!< PLLDIG RF_MSKMOD_CTRL1_REG: TX_MOD_FROM_GPIO (Bit 6)        */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_TX_MOD_FROM_GPIO_Msk (0x40UL)        /*!< PLLDIG RF_MSKMOD_CTRL1_REG: TX_MOD_FROM_GPIO (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_MSK_BYPASS_PHASE_Pos (7UL)           /*!< PLLDIG RF_MSKMOD_CTRL1_REG: MSK_BYPASS_PHASE (Bit 7)        */
#define PLLDIG_RF_MSKMOD_CTRL1_REG_MSK_BYPASS_PHASE_Msk (0x80UL)        /*!< PLLDIG RF_MSKMOD_CTRL1_REG: MSK_BYPASS_PHASE (Bitfield-Mask: 0x01) */

/* -------------------------  PLLDIG_RF_MSKMOD_CTRL2_REG  ------------------------- */
#define PLLDIG_RF_MSKMOD_CTRL2_REG_TX_DATA_Pos (0UL)                    /*!< PLLDIG RF_MSKMOD_CTRL2_REG: TX_DATA (Bit 0)                 */
#define PLLDIG_RF_MSKMOD_CTRL2_REG_TX_DATA_Msk (0xfUL)                  /*!< PLLDIG RF_MSKMOD_CTRL2_REG: TX_DATA (Bitfield-Mask: 0x0f)   */
#define PLLDIG_RF_MSKMOD_CTRL2_REG_TX_VALID_Pos (4UL)                   /*!< PLLDIG RF_MSKMOD_CTRL2_REG: TX_VALID (Bit 4)                */
#define PLLDIG_RF_MSKMOD_CTRL2_REG_TX_VALID_Msk (0x10UL)                /*!< PLLDIG RF_MSKMOD_CTRL2_REG: TX_VALID (Bitfield-Mask: 0x01)  */
#define PLLDIG_RF_MSKMOD_CTRL2_REG_MSK_TX_SEL_Pos (5UL)                 /*!< PLLDIG RF_MSKMOD_CTRL2_REG: MSK_TX_SEL (Bit 5)              */
#define PLLDIG_RF_MSKMOD_CTRL2_REG_MSK_TX_SEL_Msk (0x20UL)              /*!< PLLDIG RF_MSKMOD_CTRL2_REG: MSK_TX_SEL (Bitfield-Mask: 0x01) */
#define PLLDIG_RF_MSKMOD_CTRL2_REG_MSK_ALW_EN_Pos (6UL)                 /*!< PLLDIG RF_MSKMOD_CTRL2_REG: MSK_ALW_EN (Bit 6)              */
#define PLLDIG_RF_MSKMOD_CTRL2_REG_MSK_ALW_EN_Msk (0x40UL)              /*!< PLLDIG RF_MSKMOD_CTRL2_REG: MSK_ALW_EN (Bitfield-Mask: 0x01) */

/* -------------------------  PLLDIG_RF_MSKMOD_CHIPL_REG  ------------------------- */
#define PLLDIG_RF_MSKMOD_CHIPL_REG_MSK_CHIPL_Pos (0UL)                  /*!< PLLDIG RF_MSKMOD_CHIPL_REG: MSK_CHIPL (Bit 0)               */
#define PLLDIG_RF_MSKMOD_CHIPL_REG_MSK_CHIPL_Msk (0xffffUL)             /*!< PLLDIG RF_MSKMOD_CHIPL_REG: MSK_CHIPL (Bitfield-Mask: 0xffff) */

/* -------------------------  PLLDIG_RF_MSKMOD_CHIPH_REG  ------------------------- */
#define PLLDIG_RF_MSKMOD_CHIPH_REG_MSK_CHIPH_Pos (0UL)                  /*!< PLLDIG RF_MSKMOD_CHIPH_REG: MSK_CHIPH (Bit 0)               */
#define PLLDIG_RF_MSKMOD_CHIPH_REG_MSK_CHIPH_Msk (0xffffUL)             /*!< PLLDIG RF_MSKMOD_CHIPH_REG: MSK_CHIPH (Bitfield-Mask: 0xffff) */

/* ------------------------  PLLDIG_RF_MGAIN_COMP_VAL0_REG  ----------------------- */
#define PLLDIG_RF_MGAIN_COMP_VAL0_REG_MGAIN_COMP_VAL_Pos (0UL)          /*!< PLLDIG RF_MGAIN_COMP_VAL0_REG: MGAIN_COMP_VAL (Bit 0)       */
#define PLLDIG_RF_MGAIN_COMP_VAL0_REG_MGAIN_COMP_VAL_Msk (0x1fUL)       /*!< PLLDIG RF_MGAIN_COMP_VAL0_REG: MGAIN_COMP_VAL (Bitfield-Mask: 0x1f) */

/* ------------------------  PLLDIG_RF_MGAIN_COMP_VAL1_REG  ----------------------- */
#define PLLDIG_RF_MGAIN_COMP_VAL1_REG_MGAIN_COMP_VAL_Pos (0UL)          /*!< PLLDIG RF_MGAIN_COMP_VAL1_REG: MGAIN_COMP_VAL (Bit 0)       */
#define PLLDIG_RF_MGAIN_COMP_VAL1_REG_MGAIN_COMP_VAL_Msk (0x1fUL)       /*!< PLLDIG RF_MGAIN_COMP_VAL1_REG: MGAIN_COMP_VAL (Bitfield-Mask: 0x1f) */

/* ------------------------  PLLDIG_RF_MGAIN_COMP_VAL2_REG  ----------------------- */
#define PLLDIG_RF_MGAIN_COMP_VAL2_REG_MGAIN_COMP_VAL_Pos (0UL)          /*!< PLLDIG RF_MGAIN_COMP_VAL2_REG: MGAIN_COMP_VAL (Bit 0)       */
#define PLLDIG_RF_MGAIN_COMP_VAL2_REG_MGAIN_COMP_VAL_Msk (0x1fUL)       /*!< PLLDIG RF_MGAIN_COMP_VAL2_REG: MGAIN_COMP_VAL (Bitfield-Mask: 0x1f) */

/* ------------------------  PLLDIG_RF_MGAIN_COMP_VAL3_REG  ----------------------- */
#define PLLDIG_RF_MGAIN_COMP_VAL3_REG_MGAIN_COMP_VAL_Pos (0UL)          /*!< PLLDIG RF_MGAIN_COMP_VAL3_REG: MGAIN_COMP_VAL (Bit 0)       */
#define PLLDIG_RF_MGAIN_COMP_VAL3_REG_MGAIN_COMP_VAL_Msk (0x1fUL)       /*!< PLLDIG RF_MGAIN_COMP_VAL3_REG: MGAIN_COMP_VAL (Bitfield-Mask: 0x1f) */

/* ------------------------  PLLDIG_RF_MGAIN_COMP_VAL4_REG  ----------------------- */
#define PLLDIG_RF_MGAIN_COMP_VAL4_REG_MGAIN_COMP_VAL_Pos (0UL)          /*!< PLLDIG RF_MGAIN_COMP_VAL4_REG: MGAIN_COMP_VAL (Bit 0)       */
#define PLLDIG_RF_MGAIN_COMP_VAL4_REG_MGAIN_COMP_VAL_Msk (0x1fUL)       /*!< PLLDIG RF_MGAIN_COMP_VAL4_REG: MGAIN_COMP_VAL (Bitfield-Mask: 0x1f) */

