openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* --------------------------  RFCU_RF_SCAN_FEEDBACK_REG  ------------------------- */
#define RFCU_RF_SCAN_FEEDBACK_REG_LF_RES_Pos  (0UL)                     /*!< RFCU RF_SCAN_FEEDBACK_REG: LF_RES (Bit 0)                   */
#define RFCU_RF_SCAN_FEEDBACK_REG_LF_RES_Msk  (0xfUL)                   /*!< RFCU RF_SCAN_FEEDBACK_REG: LF_RES (Bitfield-Mask: 0x0f)     */
#define RFCU_RF_SCAN_FEEDBACK_REG_CP_CUR_Pos  (4UL)                     /*!< RFCU RF_SCAN_FEEDBACK_REG: CP_CUR (Bit 4)                   */
#define RFCU_RF_SCAN_FEEDBACK_REG_CP_CUR_Msk  (0xf0UL)                  /*!< RFCU RF_SCAN_FEEDBACK_REG: CP_CUR (Bitfield-Mask: 0x0f)     */

/* ---------------------------  RFCU_RF_REF_OSC_BLE_REG  -------------------------- */
#define RFCU_RF_REF_OSC_BLE_REG_CNT_RO_Pos    (0UL)                     /*!< RFCU RF_REF_OSC_BLE_REG: CNT_RO (Bit 0)                     */
#define RFCU_RF_REF_OSC_BLE_REG_CNT_RO_Msk    (0x3fUL)                  /*!< RFCU RF_REF_OSC_BLE_REG: CNT_RO (Bitfield-Mask: 0x3f)       */
#define RFCU_RF_REF_OSC_BLE_REG_CNT_CLK_Pos   (6UL)                     /*!< RFCU RF_REF_OSC_BLE_REG: CNT_CLK (Bit 6)                    */
#define RFCU_RF_REF_OSC_BLE_REG_CNT_CLK_Msk   (0x7fc0UL)                /*!< RFCU RF_REF_OSC_BLE_REG: CNT_CLK (Bitfield-Mask: 0x1ff)     */

/* --------------------------  RFCU_RF_REF_OSC_FTDF_REG  -------------------------- */
#define RFCU_RF_REF_OSC_FTDF_REG_CNT_RO_Pos   (0UL)                     /*!< RFCU RF_REF_OSC_FTDF_REG: CNT_RO (Bit 0)                    */
#define RFCU_RF_REF_OSC_FTDF_REG_CNT_RO_Msk   (0x3fUL)                  /*!< RFCU RF_REF_OSC_FTDF_REG: CNT_RO (Bitfield-Mask: 0x3f)      */
#define RFCU_RF_REF_OSC_FTDF_REG_CNT_CLK_Pos  (6UL)                     /*!< RFCU RF_REF_OSC_FTDF_REG: CNT_CLK (Bit 6)                   */
#define RFCU_RF_REF_OSC_FTDF_REG_CNT_CLK_Msk  (0x7fc0UL)                /*!< RFCU RF_REF_OSC_FTDF_REG: CNT_CLK (Bitfield-Mask: 0x1ff)    */

/* ----------------------------  RFCU_RF_CAL_CTRL_REG  ---------------------------- */
#define RFCU_RF_CAL_CTRL_REG_SO_CAL_Pos       (0UL)                     /*!< RFCU RF_CAL_CTRL_REG: SO_CAL (Bit 0)                        */
#define RFCU_RF_CAL_CTRL_REG_SO_CAL_Msk       (0x1UL)                   /*!< RFCU RF_CAL_CTRL_REG: SO_CAL (Bitfield-Mask: 0x01)          */
#define RFCU_RF_CAL_CTRL_REG_EO_CAL_Pos       (1UL)                     /*!< RFCU RF_CAL_CTRL_REG: EO_CAL (Bit 1)                        */
#define RFCU_RF_CAL_CTRL_REG_EO_CAL_Msk       (0x2UL)                   /*!< RFCU RF_CAL_CTRL_REG: EO_CAL (Bitfield-Mask: 0x01)          */
#define RFCU_RF_CAL_CTRL_REG_MGAIN_CAL_DIS_Pos (2UL)                    /*!< RFCU RF_CAL_CTRL_REG: MGAIN_CAL_DIS (Bit 2)                 */
#define RFCU_RF_CAL_CTRL_REG_MGAIN_CAL_DIS_Msk (0x4UL)                  /*!< RFCU RF_CAL_CTRL_REG: MGAIN_CAL_DIS (Bitfield-Mask: 0x01)   */
#define RFCU_RF_CAL_CTRL_REG_IFF_CAL_DIS_Pos  (3UL)                     /*!< RFCU RF_CAL_CTRL_REG: IFF_CAL_DIS (Bit 3)                   */
#define RFCU_RF_CAL_CTRL_REG_IFF_CAL_DIS_Msk  (0x8UL)                   /*!< RFCU RF_CAL_CTRL_REG: IFF_CAL_DIS (Bitfield-Mask: 0x01)     */
#define RFCU_RF_CAL_CTRL_REG_DC_OFFSET_CAL_DIS_Pos (4UL)                /*!< RFCU RF_CAL_CTRL_REG: DC_OFFSET_CAL_DIS (Bit 4)             */
#define RFCU_RF_CAL_CTRL_REG_DC_OFFSET_CAL_DIS_Msk (0x10UL)             /*!< RFCU RF_CAL_CTRL_REG: DC_OFFSET_CAL_DIS (Bitfield-Mask: 0x01) */
#define RFCU_RF_CAL_CTRL_REG_VCO_CAL_DIS_Pos  (5UL)                     /*!< RFCU RF_CAL_CTRL_REG: VCO_CAL_DIS (Bit 5)                   */
#define RFCU_RF_CAL_CTRL_REG_VCO_CAL_DIS_Msk  (0x20UL)                  /*!< RFCU RF_CAL_CTRL_REG: VCO_CAL_DIS (Bitfield-Mask: 0x01)     */

/* ----------------------------  RFCU_RF_IRQ_CTRL_REG  ---------------------------- */
#define RFCU_RF_IRQ_CTRL_REG_EO_CAL_CLEAR_Pos (0UL)                     /*!< RFCU RF_IRQ_CTRL_REG: EO_CAL_CLEAR (Bit 0)                  */
#define RFCU_RF_IRQ_CTRL_REG_EO_CAL_CLEAR_Msk (0x1UL)                   /*!< RFCU RF_IRQ_CTRL_REG: EO_CAL_CLEAR (Bitfield-Mask: 0x01)    */

/* -------------------------  RFCU_RF_ADCI_DC_OFFSET_REG  ------------------------- */
#define RFCU_RF_ADCI_DC_OFFSET_REG_ADC_OFFP_I_RD_Pos (0UL)              /*!< RFCU RF_ADCI_DC_OFFSET_REG: ADC_OFFP_I_RD (Bit 0)           */
#define RFCU_RF_ADCI_DC_OFFSET_REG_ADC_OFFP_I_RD_Msk (0xffUL)           /*!< RFCU RF_ADCI_DC_OFFSET_REG: ADC_OFFP_I_RD (Bitfield-Mask: 0xff) */
#define RFCU_RF_ADCI_DC_OFFSET_REG_ADC_OFFN_I_RD_Pos (8UL)              /*!< RFCU RF_ADCI_DC_OFFSET_REG: ADC_OFFN_I_RD (Bit 8)           */
#define RFCU_RF_ADCI_DC_OFFSET_REG_ADC_OFFN_I_RD_Msk (0xff00UL)         /*!< RFCU RF_ADCI_DC_OFFSET_REG: ADC_OFFN_I_RD (Bitfield-Mask: 0xff) */

/* -------------------------  RFCU_RF_ADCQ_DC_OFFSET_REG  ------------------------- */
#define RFCU_RF_ADCQ_DC_OFFSET_REG_ADC_OFFP_Q_RD_Pos (0UL)              /*!< RFCU RF_ADCQ_DC_OFFSET_REG: ADC_OFFP_Q_RD (Bit 0)           */
#define RFCU_RF_ADCQ_DC_OFFSET_REG_ADC_OFFP_Q_RD_Msk (0xffUL)           /*!< RFCU RF_ADCQ_DC_OFFSET_REG: ADC_OFFP_Q_RD (Bitfield-Mask: 0xff) */
#define RFCU_RF_ADCQ_DC_OFFSET_REG_ADC_OFFN_Q_RD_Pos (8UL)              /*!< RFCU RF_ADCQ_DC_OFFSET_REG: ADC_OFFN_Q_RD (Bit 8)           */
#define RFCU_RF_ADCQ_DC_OFFSET_REG_ADC_OFFN_Q_RD_Msk (0xff00UL)         /*!< RFCU RF_ADCQ_DC_OFFSET_REG: ADC_OFFN_Q_RD (Bitfield-Mask: 0xff) */

/* ---------------------------  RFCU_RF_SPARE1_BLE_REG  --------------------------- */
#define RFCU_RF_SPARE1_BLE_REG_RF_XTAL_RFCLK_TEST_Pos (0UL)             /*!< RFCU RF_SPARE1_BLE_REG: RF_XTAL_RFCLK_TEST (Bit 0)          */
#define RFCU_RF_SPARE1_BLE_REG_RF_XTAL_RFCLK_TEST_Msk (0x1UL)           /*!< RFCU RF_SPARE1_BLE_REG: RF_XTAL_RFCLK_TEST (Bitfield-Mask: 0x01) */
#define RFCU_RF_SPARE1_BLE_REG_RF_XTAL_PLL_DXTAL16_TEST_Pos (1UL)       /*!< RFCU RF_SPARE1_BLE_REG: RF_XTAL_PLL_DXTAL16_TEST (Bit 1)    */
#define RFCU_RF_SPARE1_BLE_REG_RF_XTAL_PLL_DXTAL16_TEST_Msk (0x2UL)     /*!< RFCU RF_SPARE1_BLE_REG: RF_XTAL_PLL_DXTAL16_TEST (Bitfield-Mask: 0x01) */
#define RFCU_RF_SPARE1_BLE_REG_RF_VTUNE_TO_ADC_TEST_EN_Pos (2UL)        /*!< RFCU RF_SPARE1_BLE_REG: RF_VTUNE_TO_ADC_TEST_EN (Bit 2)     */
#define RFCU_RF_SPARE1_BLE_REG_RF_VTUNE_TO_ADC_TEST_EN_Msk (0x4UL)      /*!< RFCU RF_SPARE1_BLE_REG: RF_VTUNE_TO_ADC_TEST_EN (Bitfield-Mask: 0x01) */
#define RFCU_RF_SPARE1_BLE_REG_RFCU_TXRX_EN_OLD_Pos (7UL)               /*!< RFCU RF_SPARE1_BLE_REG: RFCU_TXRX_EN_OLD (Bit 7)            */
#define RFCU_RF_SPARE1_BLE_REG_RFCU_TXRX_EN_OLD_Msk (0x80UL)            /*!< RFCU RF_SPARE1_BLE_REG: RFCU_TXRX_EN_OLD (Bitfield-Mask: 0x01) */
#define RFCU_RF_SPARE1_BLE_REG_VCO_AMPL_SET_TX_Pos (8UL)                /*!< RFCU RF_SPARE1_BLE_REG: VCO_AMPL_SET_TX (Bit 8)             */
#define RFCU_RF_SPARE1_BLE_REG_VCO_AMPL_SET_TX_Msk (0xff00UL)           /*!< RFCU RF_SPARE1_BLE_REG: VCO_AMPL_SET_TX (Bitfield-Mask: 0xff) */

