openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* ------------------------------  UART_UART_USR_REG  ----------------------------- */
#define UART_UART_USR_REG_UART_BUSY_Pos       (0UL)                     /*!< UART UART_USR_REG: UART_BUSY (Bit 0)                        */
#define UART_UART_USR_REG_UART_BUSY_Msk       (0x1UL)                   /*!< UART UART_USR_REG: UART_BUSY (Bitfield-Mask: 0x01)          */

/* ------------------------------  UART_UART_SRR_REG  ----------------------------- */
#define UART_UART_SRR_REG_UART_UR_Pos         (0UL)                     /*!< UART UART_SRR_REG: UART_UR (Bit 0)                          */
#define UART_UART_SRR_REG_UART_UR_Msk         (0x1UL)                   /*!< UART UART_SRR_REG: UART_UR (Bitfield-Mask: 0x01)            */

/* -----------------------------  UART_UART_SBCR_REG  ----------------------------- */
#define UART_UART_SBCR_REG_UART_SHADOW_BREAK_CONTROL_Pos (0UL)          /*!< UART UART_SBCR_REG: UART_SHADOW_BREAK_CONTROL (Bit 0)       */
#define UART_UART_SBCR_REG_UART_SHADOW_BREAK_CONTROL_Msk (0x1UL)        /*!< UART UART_SBCR_REG: UART_SHADOW_BREAK_CONTROL (Bitfield-Mask: 0x01) */

/* -----------------------------  UART_UART_DMASA_REG  ---------------------------- */
#define UART_UART_DMASA_REG_DMASA_Pos         (0UL)                     /*!< UART UART_DMASA_REG: DMASA (Bit 0)                          */
#define UART_UART_DMASA_REG_DMASA_Msk         (0x1UL)                   /*!< UART UART_DMASA_REG: DMASA (Bitfield-Mask: 0x01)            */

/* ------------------------------  UART_UART_DLF_REG  ----------------------------- */
#define UART_UART_DLF_REG_UART_DLF_Pos        (0UL)                     /*!< UART UART_DLF_REG: UART_DLF (Bit 0)                         */
#define UART_UART_DLF_REG_UART_DLF_Msk        (0xfUL)                   /*!< UART UART_DLF_REG: UART_DLF (Bitfield-Mask: 0x0f)           */

/* ------------------------------  UART_UART_CPR_REG  ----------------------------- */
#define UART_UART_CPR_REG_CPR_Pos             (0UL)                     /*!< UART UART_CPR_REG: CPR (Bit 0)                              */
#define UART_UART_CPR_REG_CPR_Msk             (0xffffUL)                /*!< UART UART_CPR_REG: CPR (Bitfield-Mask: 0xffff)              */

/* ------------------------------  UART_UART_UCV_REG  ----------------------------- */
#define UART_UART_UCV_REG_UCV_Pos             (0UL)                     /*!< UART UART_UCV_REG: UCV (Bit 0)                              */
#define UART_UART_UCV_REG_UCV_Msk             (0xffffUL)                /*!< UART UART_UCV_REG: UCV (Bitfield-Mask: 0xffff)              */

/* ------------------------------  UART_UART_CTR_REG  ----------------------------- */
#define UART_UART_CTR_REG_CTR_Pos             (0UL)                     /*!< UART UART_CTR_REG: CTR (Bit 0)                              */
#define UART_UART_CTR_REG_CTR_Msk             (0xffffUL)                /*!< UART UART_CTR_REG: CTR (Bitfield-Mask: 0xffff)              */


/* ================================================================================ */
/* ================         struct 'UART2' Position & Mask         ================ */
/* ================================================================================ */


/* -------------------------  UART2_UART2_RBR_THR_DLL_REG  ------------------------ */
#define UART2_UART2_RBR_THR_DLL_REG_RBR_THR_DLL_Pos (0UL)               /*!< UART2 UART2_RBR_THR_DLL_REG: RBR_THR_DLL (Bit 0)            */
#define UART2_UART2_RBR_THR_DLL_REG_RBR_THR_DLL_Msk (0xffUL)            /*!< UART2 UART2_RBR_THR_DLL_REG: RBR_THR_DLL (Bitfield-Mask: 0xff) */

/* ---------------------------  UART2_UART2_IER_DLH_REG  -------------------------- */
#define UART2_UART2_IER_DLH_REG_ERBFI_dlh0_Pos (0UL)                    /*!< UART2 UART2_IER_DLH_REG: ERBFI_dlh0 (Bit 0)                 */
#define UART2_UART2_IER_DLH_REG_ERBFI_dlh0_Msk (0x1UL)                  /*!< UART2 UART2_IER_DLH_REG: ERBFI_dlh0 (Bitfield-Mask: 0x01)   */
#define UART2_UART2_IER_DLH_REG_ETBEI_dlh1_Pos (1UL)                    /*!< UART2 UART2_IER_DLH_REG: ETBEI_dlh1 (Bit 1)                 */
#define UART2_UART2_IER_DLH_REG_ETBEI_dlh1_Msk (0x2UL)                  /*!< UART2 UART2_IER_DLH_REG: ETBEI_dlh1 (Bitfield-Mask: 0x01)   */
#define UART2_UART2_IER_DLH_REG_ELSI_dhl2_Pos (2UL)                     /*!< UART2 UART2_IER_DLH_REG: ELSI_dhl2 (Bit 2)                  */
#define UART2_UART2_IER_DLH_REG_ELSI_dhl2_Msk (0x4UL)                   /*!< UART2 UART2_IER_DLH_REG: ELSI_dhl2 (Bitfield-Mask: 0x01)    */
#define UART2_UART2_IER_DLH_REG_PTIME_dlh7_Pos (7UL)                    /*!< UART2 UART2_IER_DLH_REG: PTIME_dlh7 (Bit 7)                 */
#define UART2_UART2_IER_DLH_REG_PTIME_dlh7_Msk (0x80UL)                 /*!< UART2 UART2_IER_DLH_REG: PTIME_dlh7 (Bitfield-Mask: 0x01)   */

/* ---------------------------  UART2_UART2_IIR_FCR_REG  -------------------------- */
#define UART2_UART2_IIR_FCR_REG_IIR_FCR_Pos   (0UL)                     /*!< UART2 UART2_IIR_FCR_REG: IIR_FCR (Bit 0)                    */
#define UART2_UART2_IIR_FCR_REG_IIR_FCR_Msk   (0xffffUL)                /*!< UART2 UART2_IIR_FCR_REG: IIR_FCR (Bitfield-Mask: 0xffff)    */

/* -----------------------------  UART2_UART2_LCR_REG  ---------------------------- */
#define UART2_UART2_LCR_REG_UART_DLS_Pos      (0UL)                     /*!< UART2 UART2_LCR_REG: UART_DLS (Bit 0)                       */
#define UART2_UART2_LCR_REG_UART_DLS_Msk      (0x3UL)                   /*!< UART2 UART2_LCR_REG: UART_DLS (Bitfield-Mask: 0x03)         */
#define UART2_UART2_LCR_REG_UART_STOP_Pos     (2UL)                     /*!< UART2 UART2_LCR_REG: UART_STOP (Bit 2)                      */
#define UART2_UART2_LCR_REG_UART_STOP_Msk     (0x4UL)                   /*!< UART2 UART2_LCR_REG: UART_STOP (Bitfield-Mask: 0x01)        */
#define UART2_UART2_LCR_REG_UART_PEN_Pos      (3UL)                     /*!< UART2 UART2_LCR_REG: UART_PEN (Bit 3)                       */
#define UART2_UART2_LCR_REG_UART_PEN_Msk      (0x8UL)                   /*!< UART2 UART2_LCR_REG: UART_PEN (Bitfield-Mask: 0x01)         */
#define UART2_UART2_LCR_REG_UART_EPS_Pos      (4UL)                     /*!< UART2 UART2_LCR_REG: UART_EPS (Bit 4)                       */
#define UART2_UART2_LCR_REG_UART_EPS_Msk      (0x10UL)                  /*!< UART2 UART2_LCR_REG: UART_EPS (Bitfield-Mask: 0x01)         */
#define UART2_UART2_LCR_REG_UART_BC_Pos       (6UL)                     /*!< UART2 UART2_LCR_REG: UART_BC (Bit 6)                        */
#define UART2_UART2_LCR_REG_UART_BC_Msk       (0x40UL)                  /*!< UART2 UART2_LCR_REG: UART_BC (Bitfield-Mask: 0x01)          */
#define UART2_UART2_LCR_REG_UART_DLAB_Pos     (7UL)                     /*!< UART2 UART2_LCR_REG: UART_DLAB (Bit 7)                      */
#define UART2_UART2_LCR_REG_UART_DLAB_Msk     (0x80UL)                  /*!< UART2 UART2_LCR_REG: UART_DLAB (Bitfield-Mask: 0x01)        */

