openthread/openthread/third_party/dialog/DialogSDK/bsp/include/DA14680AD.h
/* --------------------------  WAKEUP_WKUP_SELECT_P4_REG  ------------------------- */
#define WAKEUP_WKUP_SELECT_P4_REG_WKUP_SELECT_P4_Pos (0UL)              /*!< WAKEUP WKUP_SELECT_P4_REG: WKUP_SELECT_P4 (Bit 0)           */
#define WAKEUP_WKUP_SELECT_P4_REG_WKUP_SELECT_P4_Msk (0xffUL)           /*!< WAKEUP WKUP_SELECT_P4_REG: WKUP_SELECT_P4 (Bitfield-Mask: 0xff) */

/* ---------------------------  WAKEUP_WKUP_POL_P0_REG  --------------------------- */
#define WAKEUP_WKUP_POL_P0_REG_WKUP_POL_P0_Pos (0UL)                    /*!< WAKEUP WKUP_POL_P0_REG: WKUP_POL_P0 (Bit 0)                 */
#define WAKEUP_WKUP_POL_P0_REG_WKUP_POL_P0_Msk (0xffUL)                 /*!< WAKEUP WKUP_POL_P0_REG: WKUP_POL_P0 (Bitfield-Mask: 0xff)   */

/* ---------------------------  WAKEUP_WKUP_POL_P1_REG  --------------------------- */
#define WAKEUP_WKUP_POL_P1_REG_WKUP_POL_P1_Pos (0UL)                    /*!< WAKEUP WKUP_POL_P1_REG: WKUP_POL_P1 (Bit 0)                 */
#define WAKEUP_WKUP_POL_P1_REG_WKUP_POL_P1_Msk (0xffUL)                 /*!< WAKEUP WKUP_POL_P1_REG: WKUP_POL_P1 (Bitfield-Mask: 0xff)   */

/* ---------------------------  WAKEUP_WKUP_POL_P2_REG  --------------------------- */
#define WAKEUP_WKUP_POL_P2_REG_WKUP_POL_P2_Pos (0UL)                    /*!< WAKEUP WKUP_POL_P2_REG: WKUP_POL_P2 (Bit 0)                 */
#define WAKEUP_WKUP_POL_P2_REG_WKUP_POL_P2_Msk (0x1fUL)                 /*!< WAKEUP WKUP_POL_P2_REG: WKUP_POL_P2 (Bitfield-Mask: 0x1f)   */

/* ---------------------------  WAKEUP_WKUP_POL_P3_REG  --------------------------- */
#define WAKEUP_WKUP_POL_P3_REG_WKUP_POL_P3_Pos (0UL)                    /*!< WAKEUP WKUP_POL_P3_REG: WKUP_POL_P3 (Bit 0)                 */
#define WAKEUP_WKUP_POL_P3_REG_WKUP_POL_P3_Msk (0xffUL)                 /*!< WAKEUP WKUP_POL_P3_REG: WKUP_POL_P3 (Bitfield-Mask: 0xff)   */

/* ---------------------------  WAKEUP_WKUP_POL_P4_REG  --------------------------- */
#define WAKEUP_WKUP_POL_P4_REG_WKUP_POL_P4_Pos (0UL)                    /*!< WAKEUP WKUP_POL_P4_REG: WKUP_POL_P4 (Bit 0)                 */
#define WAKEUP_WKUP_POL_P4_REG_WKUP_POL_P4_Msk (0xffUL)                 /*!< WAKEUP WKUP_POL_P4_REG: WKUP_POL_P4 (Bitfield-Mask: 0xff)   */


/* ================================================================================ */
/* ================          struct 'WDOG' Position & Mask         ================ */
/* ================================================================================ */


/* ------------------------------  WDOG_WATCHDOG_REG  ----------------------------- */
#define WDOG_WATCHDOG_REG_WDOG_VAL_Pos        (0UL)                     /*!< WDOG WATCHDOG_REG: WDOG_VAL (Bit 0)                         */
#define WDOG_WATCHDOG_REG_WDOG_VAL_Msk        (0xffUL)                  /*!< WDOG WATCHDOG_REG: WDOG_VAL (Bitfield-Mask: 0xff)           */
#define WDOG_WATCHDOG_REG_WDOG_VAL_NEG_Pos    (8UL)                     /*!< WDOG WATCHDOG_REG: WDOG_VAL_NEG (Bit 8)                     */
#define WDOG_WATCHDOG_REG_WDOG_VAL_NEG_Msk    (0x100UL)                 /*!< WDOG WATCHDOG_REG: WDOG_VAL_NEG (Bitfield-Mask: 0x01)       */
#define WDOG_WATCHDOG_REG_WDOG_WEN_Pos        (9UL)                     /*!< WDOG WATCHDOG_REG: WDOG_WEN (Bit 9)                         */
#define WDOG_WATCHDOG_REG_WDOG_WEN_Msk        (0xfe00UL)                /*!< WDOG WATCHDOG_REG: WDOG_WEN (Bitfield-Mask: 0x7f)           */

/* ---------------------------  WDOG_WATCHDOG_CTRL_REG  --------------------------- */
#define WDOG_WATCHDOG_CTRL_REG_NMI_RST_Pos    (0UL)                     /*!< WDOG WATCHDOG_CTRL_REG: NMI_RST (Bit 0)                     */
#define WDOG_WATCHDOG_CTRL_REG_NMI_RST_Msk    (0x1UL)                   /*!< WDOG WATCHDOG_CTRL_REG: NMI_RST (Bitfield-Mask: 0x01)       */



/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define AES_HASH_BASE                   0x40020000UL
#define ANAMISC_BASE                    0x50001B00UL
#define APU_BASE                        0x50004000UL
#define BLE_BASE                        0x40000000UL
#define CACHE_BASE                      0x400C3000UL
#define CHIP_VERSION_BASE               0x50003200UL
#define COEX_BASE                       0x50002F00UL
#define CRG_PER_BASE                    0x50001C00UL
#define CRG_TOP_BASE                    0x50000000UL
#define DCDC_BASE                       0x50000080UL
#define DEM_BASE                        0x50002E00UL
#define DMA_BASE                        0x50003500UL
#define ECC_BASE                        0x50006000UL
#define FTDF_BASE                       0x40080000UL
#define GP_TIMERS_BASE                  0x50003400UL
#define GPADC_BASE                      0x50001900UL
#define GPIO_BASE                       0x50003000UL
#define GPREG_BASE                      0x50003300UL
#define I2C_BASE                        0x50001400UL
#define I2C2_BASE                       0x50001500UL
#define IR_BASE                         0x50001700UL
#define KBSCAN_BASE                     0x50001600UL
#define OTPC_BASE                       0x07F40000UL
#define PATCH_BASE                      0x40050000UL
#define PLLDIG_BASE                     0x50002D00UL
#define QSPIC_BASE                      0x0C000000UL
#define QUAD_BASE                       0x50001A00UL
#define RFCU_BASE                       0x50002000UL
#define RFCU_POWER_BASE                 0x50002200UL
#define RFPT_BASE                       0x50003600UL
#define SPI_BASE                        0x50001200UL
#define SPI2_BASE                       0x50001300UL
#define TIMER1_BASE                     0x50000200UL
#define TRNG_BASE                       0x50005000UL
#define UART_BASE                       0x50001000UL
#define UART2_BASE                      0x50001100UL
#define USB_BASE                        0x50001800UL
#define WAKEUP_BASE                     0x50000100UL
#define WDOG_BASE                       0x50003100UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

#define AES_HASH                        ((AES_HASH_Type           *) AES_HASH_BASE)
#define ANAMISC                         ((ANAMISC_Type            *) ANAMISC_BASE)
#define APU                             ((APU_Type                *) APU_BASE)
#define BLE                             ((BLE_Type                *) BLE_BASE)
#define CACHE                           ((CACHE_Type              *) CACHE_BASE)
#define CHIP_VERSION                    ((CHIP_VERSION_Type       *) CHIP_VERSION_BASE)
#define COEX                            ((COEX_Type               *) COEX_BASE)
#define CRG_PER                         ((CRG_PER_Type            *) CRG_PER_BASE)
#define CRG_TOP                         ((CRG_TOP_Type            *) CRG_TOP_BASE)
#define DCDC                            ((DCDC_Type               *) DCDC_BASE)
#define DEM                             ((DEM_Type                *) DEM_BASE)
#define DMA                             ((DMA_Type                *) DMA_BASE)
#define ECC                             ((ECC_Type                *) ECC_BASE)
#define FTDF                            ((FTDF_Type               *) FTDF_BASE)
#define GP_TIMERS                       ((GP_TIMERS_Type          *) GP_TIMERS_BASE)
#define GPADC                           ((GPADC_Type              *) GPADC_BASE)
#define GPIO                            ((GPIO_Type               *) GPIO_BASE)
#define GPREG                           ((GPREG_Type              *) GPREG_BASE)
#define I2C                             ((I2C_Type                *) I2C_BASE)
#define I2C2                            ((I2C2_Type               *) I2C2_BASE)
#define IR                              ((IR_Type                 *) IR_BASE)
#define KBSCAN                          ((KBSCAN_Type             *) KBSCAN_BASE)
#define OTPC                            ((OTPC_Type               *) OTPC_BASE)
#define PATCH                           ((PATCH_Type              *) PATCH_BASE)
#define PLLDIG                          ((PLLDIG_Type             *) PLLDIG_BASE)
#define QSPIC                           ((QSPIC_Type              *) QSPIC_BASE)
#define QUAD                            ((QUAD_Type               *) QUAD_BASE)
#define RFCU                            ((RFCU_Type               *) RFCU_BASE)
#define RFCU_POWER                      ((RFCU_POWER_Type         *) RFCU_POWER_BASE)
#define RFPT                            ((RFPT_Type               *) RFPT_BASE)
#define SPI                             ((SPI_Type                *) SPI_BASE)
#define SPI2                            ((SPI2_Type               *) SPI2_BASE)
#define TIMER1                          ((TIMER1_Type             *) TIMER1_BASE)
#define TRNG                            ((TRNG_Type               *) TRNG_BASE)
#define UART                            ((UART_Type               *) UART_BASE)
#define UART2                           ((UART2_Type              *) UART2_BASE)
#define USB                             ((USB_Type                *) USB_BASE)
#define WAKEUP                          ((WAKEUP_Type             *) WAKEUP_BASE)
#define WDOG                            ((WDOG_Type               *) WDOG_BASE)


/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group DA14680AD */
/** @} */ /* End of group Dialog */

#ifdef __cplusplus
}
#endif


#endif  /* DA14680AD_H */

